{
  "plotTitle": "Crisis Beyond the Frontier",
  "mainObjective": "Investigate the escalating bandit attacks on the Rangers' Outpost and uncover the supernatural threat corrupting the northern wilderness.",
  "plotPoints": [
    {
      "id": "PP001",
      "title": "Desperate Defense",
      "description": "The party arrives at Rangers' Outpost to find it in crisis. Three caravans have been massacred in five days with unnatural precision. Ranger Elen desperately recruits the party to interrogate the captured Bandit Leader Rusk and uncover who is behind these coordinated attacks before the frontier falls completely.",
      "location": "RO001",
      "nextPoints": [
        "PP002"
      ],
      "status": "in progress",
      "plotImpact": "The party has delivered a warning and evidence of the Crow's Hand's planned assault to Scout's Watch, giving the defenders a chance to prepare for the impending attack.",
      "sideQuests": [
        {
          "id": "SQ001",
          "title": "Restore the Silver Bell Network",
          "description": "The outpost's silver bell communication system has been sabotaged or disrupted. Restoring it will reestablish contact with other ranger posts and provide early warning of future attacks.",
          "involvedLocations": [
            "RO001"
          ],
          "status": "in progress",
          "plotImpact": "Eirik and Kira repaired the silver bell network post at Trader's Rest, restoring communication and defense against further attacks. The party also secured evidence of the Crow's Hand involvement."
        },
        {
          "id": "SQ002",
          "title": "Merchant's Dilemma",
          "description": "Trader Sila is considering abandoning the outpost due to the danger. Convincing her to stay will ensure continued supplies and maintain trade relationships vital to the frontier's survival.",
          "involvedLocations": [
            "RO001"
          ],
          "status": "in progress",
          "plotImpact": "Eirik warned Sila and the merchants about the Crow's Hand, confirming the danger. Trader Sila will remain cautious and advise others to stay together for safety until the threat is dealt with."
        }
      ]
    },
    {
      "id": "PP002",
      "title": "Into the Thornwood",
      "description": "Following leads from Rusk's interrogation, the party ventures into the Thornwood Wilds to locate the main bandit camp. They must navigate treacherous terrain, rescue captives, and discover evidence of the supernatural force coordinating the attacks.",
      "location": "TW001",
      "nextPoints": [
        "PP003"
      ],
      "status": "not started",
      "plotImpact": "",
      "sideQuests": [
        {
          "id": "SQ003",
          "title": "The Hermit's Warning",
          "description": "Spirit-Touched Hermit Maelo dwells deep in the Thornwood and possesses ancient knowledge about the corruption spreading from the north. He may provide crucial warnings about what the party will face.",
          "involvedLocations": [
            "TW001"
          ],
          "status": "not started",
          "plotImpact": ""
        },
        {
          "id": "SQ004",
          "title": "Rescue the Lost",
          "description": "Wounded Scout Neris and Merchant Lira are trapped somewhere in the Thornwood. Rescuing them will provide valuable intelligence about the bandit operations and the supernatural influences affecting the region.",
          "involvedLocations": [
            "TW001"
          ],
          "status": "not started",
          "plotImpact": ""
        }
      ]
    },
    {
      "id": "PP003",
      "title": "Corruption Revealed",
      "description": "The trail leads north to the Northern Corrupted Woods, where reality itself grows thin. The party must investigate the source of supernatural corruption that's influencing the bandits and threatening to spread south to civilized lands.",
      "location": "NCW001",
      "nextPoints": [
        "PP004"
      ],
      "status": "not started",
      "plotImpact": "",
      "sideQuests": [
        {
          "id": "SQ005",
          "title": "The Withered Hart",
          "description": "A once-noble forest guardian has been corrupted by the otherworldly influence. Confronting the Withered Hart may reveal the true nature of the threat and possibly provide a way to cleanse the corruption.",
          "involvedLocations": [
            "NCW001"
          ],
          "status": "not started",
          "plotImpact": ""
        }
      ]
    },
    {
      "id": "PP004",
      "title": "Confronting the Unknown",
      "description": "Deep in the corrupted woods lies the source: an otherworldly breach between dimensions. The party must destroy or seal this cosmic horror before it consumes the entire region and spreads beyond the frontier.",
      "location": "NCW001",
      "nextPoints": [
        "PP005"
      ],
      "status": "not started",
      "plotImpact": "",
      "sideQuests": []
    },
    {
      "id": "PP005",
      "title": "Frontier Secured",
      "description": "With the corruption source destroyed, the party returns to Rangers' Outpost as heroes. The bandit threat is ended, the woods begin to heal, and Ranger Elen can finally secure the frontier. New opportunities await as word of their success spreads.",
      "location": "RO001",
      "nextPoints": [],
      "status": "not started",
      "plotImpact": "",
      "sideQuests": []
    }
  ],
  "activeQuests": [],
  "completedQuests": [],
  "failedQuests": [],
  "worldEvents": [],
  "dmNotes": []
}
