{
  "worldName": "Fantasy Adventure World",
  "registryVersion": "1.0.0",
  "lastUpdated": "2025-06-18T21:59:24.337151",
  "modules": {
    "Keep_of_Doom": {
      "moduleName": "Keep_of_Doom",
      "addedDate": "2025-06-15T20:04:48.773150",
      "themes": [
        "The party arrives in Harrow's Hollow, a small, anxious village gripped by fear. Elder Mirna Harrow asks the characters to investigate recent disappearances, including that of Scout Elen. Tensions run ",
        "Tracking clues and rumors, the party must brave the haunted forest and reach the Keep of Doom. Along the way, they navigate treacherous terrain, spectral ambushes, and lingering wards. The forest is a",
        "The party reaches the foreboding Keep of Doom. They must find a way inside, dealing with traps, lingering magical defenses, and spectral guardians. Entry requires cunning, bravery, or the right key--p",
        "Within the keep's depths lies the source of the curse: the vengeful spirit of Lord Thaddeus Greymont, corrupted by dark magic. The party must confront him, either by combat, exorcism, or fulfilling hi",
        "With the curse lifted, the party returns to Harrow's Hollow as heroes. Elder Mirna and the villagers celebrate their success. Rewards, both material and social, await. New opportunities and adventures"
      ],
      "plotObjective": "Investigate the mysterious disappearances in Harrow's Hollow and discover the fate of Scout Elen.",
      "levelRange": {
        "min": 1,
        "max": 5
      },
      "areaCount": 5
    },
    "Silver_Vein_Whispers": {
      "moduleName": "Silver_Vein_Whispers",
      "addedDate": "2025-06-18T21:59:24.337151",
      "themes": [
        "the party arrive at the edge of the Sablemoor Reaches, a mist-wreathed expanse notorious for haunting whispers and unnatural mists. Locals warn travelers away, but the party seeks the tormented s",
        "The party descends into the fog-laden riverbanks, where spectral voices grow louder and strange phenomena threaten to overwhelm the senses. They must investigate the source of the voices, interacting ",
        "Deep in the river-concealed ruins, the party uncovers remnants of the lost city of Calamyr. Here, they must navigate ancient traps, decipher forgotten lore with Archivist Lareth, and contend with Capt",
        "With the means to commune with Rilith, the party enacts the ritual, confronting both the tormented spirit and the vengeful Queen Seralyth. Their choices--appeasement, cleansing, bargaining, or combat-",
        "Upon arrival in the Sablemoor Reaches, the party are greeted by Mira the Moorwise, a cryptic guide who warns them of ethereal whispers and spectral sightings along the ancient riverbanks. The par",
        "Guided by clues and visions, the party follow the haunting whispers to the Whispering Riverbanks, where lingering spirits are trapped by an ancient pact. Here, the party must negotiate or confron",
        "With the spirits' guidance--or wrath--the party discover the entrance to the Ruins of Calamyr. Within the labyrinthine halls, they must uncover records protected by Archivist Lareth and outwit ri",
        "At the heart of the ruins, the party confront Queen Seralyth's anguished spirit. The final confrontation can play out as battle, negotiation, or a complex ritual of atonement--depending on the pa",
        "The party arrives at the Sablemoor Reaches, where rumors swirl of strange lights and haunting whispers along the Whispering Riverbanks. Mira the Moorwise, an enigmatic guide, offers to lead the party ",
        "Guided by clues and the local guides, the party navigates the Whispering Riverbanks. They must contend with supernatural phenomena - ethereal whispers, illusions, and vengeful spirits. A rival expedit",
        "The party reaches the hidden shrine, a half-submerged ruin overgrown with willows. Powerful wards and puzzles bar entry, left by the Riverbound Circle. Inside, ancient spirits and magical traps guard ",
        "Within the heart of the shrine, the party faces Queen Seralyth's cursed spirit. Seralyth challenges them through a mix of combat, negotiation, and trials of will, testing their intentions and the choi"
      ],
      "plotObjective": "Uncover the origin and purpose of the Silver Vein River's unnatural magic by exploring the haunted moorlands, confronting the regret-bound queen's spirit, and recovering ancient relics from the ruined city of Calamyr before the river's curse reshapes the fate of all who dwell nearby.",
      "levelRange": {
        "min": 6,
        "max": 8
      },
      "areaCount": 3,
      "travelNarration": {
        "travelNarration": "Leaving familiar lands behind, the party journeys across bleak highlands and wind-swept moors, where the air grows thick with a silvery mist rising from the mysterious river below. The landscape is heavy with a sense of sorrow, and even the birdsong is drowned by the whispering of the Silver Vein, guiding you toward the forgotten spires of Calamyr rising from the fog.",
        "dmGuidance": "As you narrate the journey, emphasize the growing unnatural atmosphere: the shimmer of the river, the chill in the wind, and an ever-present sense of loss. Let the players feel the weight of the river's curse even before they reach the ruins, hinting at ghostly figures glimpsed through the mist and the oppressive silence that welcomes them to Calamyr's shattered gates.",
        "generatedDate": "2025-06-18T21:59:22.840018"
      }
    }
  },
  "areas": {
    "G001": {
      "areaName": "Gloamwood",
      "areaDescription": "A dense, brooding forest where sunlight rarely pierces the canopy. Ethereal mists swirl between ancient oaks, and spirits of the restless dead prowl the trails. Travelers risk losing both their way and their lives among the twisted paths and shadowed groves.",
      "areaType": "forest",
      "dangerLevel": "medium",
      "recommendedLevel": 1,
      "climate": "temperate",
      "terrain": "dense forest, misty trails, marshy clearings",
      "areaConnectivity": [],
      "areaConnectivityId": [],
      "locationCount": 9,
      "module": "Keep_of_Doom",
      "addedDate": "2025-06-15T20:04:48.773150"
    },
    "HH001": {
      "areaName": "Harrow's Hollow",
      "areaDescription": "Harrow's Hollow is a medium settlement where civilization meets the frontier. Politics and intrigue mix with everyday commerce.",
      "areaType": "town",
      "dangerLevel": "low",
      "recommendedLevel": 1,
      "climate": "temperate",
      "terrain": "urban streets and buildings",
      "areaConnectivity": [],
      "areaConnectivityId": [],
      "locationCount": 5,
      "module": "Keep_of_Doom",
      "addedDate": "2025-06-15T20:04:48.773150"
    },
    "SK001": {
      "areaName": "Shadowfall Keep",
      "areaDescription": "A crumbling fortress perched atop a rocky hill, its towers broken and battlements thick with creeping ivy. Within, restless spirits and deadly traps await all who enter, and the cursed knight's presence warps reality itself. The very stones seem to absorb light, casting the keep in perpetual shadow regardless of the time of day.",
      "areaType": "ruins",
      "dangerLevel": "high",
      "recommendedLevel": 2,
      "climate": "temperate",
      "terrain": "rocky hill, stone fortress, crumbling architecture",
      "areaConnectivity": [],
      "areaConnectivityId": [],
      "locationCount": 8,
      "module": "Keep_of_Doom",
      "addedDate": "2025-06-15T20:04:48.773150"
    },
    "TBM001": {
      "areaName": "The Blighted Marches",
      "areaDescription": "A desolate moor stretching beyond the keep, scarred by ancient battles and lingering curses. Strange lights drift over the bogs at night, and only the desperate or foolhardy dare to cross these lands. The soil itself seems poisoned, growing only twisted vegetation, while miasmic mists obscure vision and disorient travelers. Time and space bend unpredictably here, where the shadow relic's influence has seeped into the very landscape over centuries.",
      "areaType": "wilderness",
      "dangerLevel": "extreme",
      "recommendedLevel": 5,
      "climate": "cold and foggy",
      "terrain": "moors, bogs, rocky outcroppings, and blasted plains",
      "areaConnectivity": [],
      "areaConnectivityId": [],
      "locationCount": 6,
      "module": "Keep_of_Doom",
      "addedDate": "2025-06-15T20:04:48.773150"
    },
    "TCD001": {
      "areaName": "The Cursed Dungeons",
      "areaDescription": "Beneath the keep, these ancient catacombs twist into darkness, suffused with the shadow relic's malevolent power. Echoes of suffering and the undead linger in every shadowed cell and hidden chamber. The very stones pulse with corrupted energy, and the air is thick with the taste of fear and ancient despair. Time and space seem to warp within these depths, with passages that shouldn't connect somehow leading into one another.",
      "areaType": "dungeon",
      "dangerLevel": "high",
      "recommendedLevel": 3,
      "climate": "cold and damp",
      "terrain": "underground stone passages, cells, and chambers",
      "areaConnectivity": [],
      "areaConnectivityId": [],
      "locationCount": 7,
      "module": "Keep_of_Doom",
      "addedDate": "2025-06-15T20:04:48.773150"
    },
    "RC001": {
      "areaName": "Ruins of Calamyr",
      "areaDescription": "Shards of obsidian arch over shattered mosaic floors, their surfaces slick with perpetual condensation and faintly pulsing with deep violet light; every footstep echoes through the vast, angular halls, disturbed by a chorus of whispers that seem to rise from the very stones, hinting at volatile magics and the restless remnants of Calamyr's final hour.",
      "areaType": "dungeon",
      "dangerLevel": "high",
      "recommendedLevel": 8,
      "climate": "controlled - cool and damp",
      "terrain": "stone corridors and chambers",
      "areaConnectivity": [],
      "areaConnectivityId": [],
      "locationCount": 6,
      "module": "Silver_Vein_Whispers",
      "addedDate": "2025-06-18T21:59:24.337151"
    },
    "SR001": {
      "areaName": "Sablemoor Reaches",
      "areaDescription": "A hush blankets the Sablemoor Reaches, where fog-draped heath undulates beneath charcoal-tipped grasses and the distant piping of marsh birds echoes between scattered stands of twisted willow. Lanternflies drift in slow constellations above glassy pools, illuminating half-sunken monoliths and the faint, silvery tracks of creatures that prefer not to be seen.",
      "areaType": "wilderness",
      "dangerLevel": "low",
      "recommendedLevel": 6,
      "climate": "desert",
      "terrain": "forest",
      "areaConnectivity": [],
      "areaConnectivityId": [],
      "locationCount": 6,
      "module": "Silver_Vein_Whispers",
      "addedDate": "2025-06-18T21:59:24.337151"
    },
    "WR001": {
      "areaName": "Whispering Riverbanks",
      "areaDescription": "Water drips from stalactites into milky, sluggish currents winding between tangled roots and moss-choked stones, each splash echoing with the faintest impression of voices that never quite resolve into words. Lantern-light flickers over faded ritual markings along the muddy banks, while the air pulses with a damp, uneasy hush, as if the river itself is holding its breath, waiting for secrets best left unearthed.",
      "areaType": "dungeon",
      "dangerLevel": "medium",
      "recommendedLevel": 7,
      "climate": "controlled - cool and damp",
      "terrain": "stone corridors and chambers",
      "areaConnectivity": [],
      "areaConnectivityId": [],
      "locationCount": 6,
      "module": "Silver_Vein_Whispers",
      "addedDate": "2025-06-18T21:59:24.337151"
    }
  },
  "themes": {},
  "isolatedModules": true
}