{
  "locationId": "R05",
  "name": "The Wyrd Lantern Inn",
  "type": "tavern",
  "description": "A cozy, low-ceilinged inn with mismatched furniture, a roaring hearth, and walls festooned with charms against evil. The aroma of stew and fresh bread fills the air. Laughter and song are frequent, but at night, whispers of fear and superstition drift between tables.",
  "coordinates": "X1Y2",
  "connectivity": [
    "R01"
  ],
  "areaConnectivity": [],
  "areaConnectivityId": [],
  "npcs": [
    {
      "name": "Cira the Innkeeper",
      "description": "A warm, quick-witted woman with a knack for remembering faces and secrets. She runs the Wyrd Lantern with a firm but friendly hand.",
      "attitude": "Welcoming to all, but especially those with coin or gossip. Protective of her staff and regulars."
    }
  ],
  "monsters": [],
  "lootTable": [
    "Free meal and ale (at Cira's discretion)",
    "Set of bone dice (left in a booth)",
    "Silver earring (lost under a table)",
    "Charm against the evil eye (hanging near the bar)"
  ],
  "plotHooks": [
    "A fearful regular claims to have seen a ghostly figure on the east road.",
    "Cira offers the party free rooms if they can calm frightened townsfolk.",
    "A drunken patron insists the keep's curse is growing stronger and tries to start a brawl."
  ],
  "dmInstructions": "Cira is the party's best source for rumors and local color. She can direct them to Elder Mirna or Sergeant Feld for more official matters. A DC 10 Persuasion check gets her to share stories about the keep and its past. If trouble starts, Cira expects the party to help keep peace.",
  "doors": [
    {
      "name": "Inn Door",
      "description": "A wide, inviting wooden door painted green, with a brass lantern hanging overhead.",
      "type": "regular",
      "locked": false,
      "lockDC": 0,
      "breakDC": 12,
      "keyname": "",
      "trapped": false,
      "trap": ""
    },
    {
      "name": "Cellar Hatch",
      "description": "A sturdy hatch behind the bar, leading to the root cellar.",
      "type": "regular",
      "locked": true,
      "lockDC": 10,
      "breakDC": 14,
      "keyname": "Cellar key (kept by Cira)",
      "trapped": false,
      "trap": ""
    }
  ],
  "traps": [],
  "dcChecks": [
    "Persuasion DC 10: Convince Cira to share confidential rumors or grant a favor.",
    "Insight DC 12: Detect if a patron is hiding something about recent ghost sightings."
  ],
  "accessibility": "Easily reached from the square, step-free entrance, welcoming to all.",
  "dangerLevel": "Low",
  "features": [
    {
      "name": "The Bar",
      "description": "A polished oak bar lined with lanterns and dangling good luck charms."
    },
    {
      "name": "Hearth and Common Room",
      "description": "A crackling fire and mismatched armchairs make this a favorite gathering spot."
    },
    {
      "name": "Guest Rooms",
      "description": "Modest but clean rooms available for travelers."
    }
  ],
  "encounters": [],
  "adventureSummary": ""
}