{
  "locationId": "B07",
  "name": "Keeper's Cottage",
  "type": "cottage",
  "description": "A stone cottage nearly swallowed by the forest, its walls covered in thick ivy and moss that seem to pulse with slow vitality. Smoke drifts from a crooked chimney, and strange charms--bones, crystals, and dried herbs--hang from the eaves and windows. The cottage appears both welcoming and foreboding, with warm light spilling from the windows but shadows that move independently within. The garden surrounding the structure contains plants both medicinal and poisonous, some of which are unknown to conventional herbalism. A path of smooth stones leads to the wooden door, each stone etched with a different protective rune.",
  "coordinates": "X3Y3",
  "connectivity": [
    "B04",
    "B06"
  ],
  "areaConnectivity": [
    "Shadowfall Keep Outer Courtyard",
    "Sundered Causeway"
  ],
  "areaConnectivityId": [
    "SK001-C01",
    "TBM001-D01"
  ],
  "npcs": [
    {
      "name": "Keeper Morvath",
      "description": "An ancient, wizened figure with skin like bark and eyes that reflect the forest's depths. Morvath appears simultaneously grandfatherly and predatory, speaking in riddles and archaic language. The Keeper has watched over the forest for centuries, neither fully alive nor undead, bound to the land through old magic.",
      "attitude": "Ambiguously neutral, testing worthiness while offering cryptic guidance"
    }
  ],
  "monsters": [
    {
      "name": "Awakened Shrubs",
      "number": 3,
      "disposition": "protective",
      "strategy": "These animated plants guard the cottage and respond to Morvath's will, attacking only if the Keeper is threatened or his hospitality abused."
    }
  ],
  "lootTable": [
    "Potion of greater healing (offered as a gift if Morvath is pleased)",
    "Wand of secrets (hidden on a shelf amongst curious trinkets)",
    "Scout Elen's journal (containing her observations about the keep and Sir Garran)",
    "Ancient key with skull motif (opens a specific door in the keep)"
  ],
  "plotHooks": [
    "Morvath reveals he guided Scout Elen toward the keep after she helped him gather rare herbs, and he fears for her safety.",
    "The Keeper offers to create a protective charm against the keep's influence, but requires a personal sacrifice from each party member.",
    "Among Morvath's possessions is a portrait of a younger Sir Garran Vael, suggesting the Keeper knew him before his corruption."
  ],
  "dmInstructions": "Keeper Morvath serves as both guide and gatekeeper to the keep. He offers hospitality (food, rest, and information) but tests the party through cryptic conversations. Players who show respect, offer assistance, or demonstrate genuine concern for Scout Elen earn his favor (and gifts). Those who threaten or dismiss him face hostility. Morvath can provide directions to the keep and warnings about specific dangers, but he speaks in riddles that require Insight checks (DC 14) to fully understand.",
  "doors": [
    {
      "name": "Cottage Door",
      "description": "A heavy wooden door carved with protective symbols and fitted with iron hinges.",
      "type": "regular",
      "locked": false,
      "lockDC": 0,
      "breakDC": 15,
      "keyname": "",
      "trapped": false,
      "trap": ""
    },
    {
      "name": "Cellar Trapdoor",
      "description": "A well-hidden trapdoor in the floor leading to a root cellar filled with strange ingredients.",
      "type": "hidden",
      "locked": true,
      "lockDC": 16,
      "breakDC": 18,
      "keyname": "Morvath's bone key",
      "trapped": true,
      "trap": "Releases poisonous spores if forced open, DC 14 Constitution save or take 2d6 poison damage"
    }
  ],
  "traps": [],
  "dcChecks": [
    "Insight DC 14: Interpret Morvath's riddles and discern his true intentions.",
    "Perception DC 15: Notice Scout Elen's journal among Morvath's possessions.",
    "Nature DC 13: Identify the rare and useful plants in Morvath's garden.",
    "History DC 16: Recognize symbols suggesting Morvath's connection to the ancient order that originally bound the shadow relic."
  ],
  "accessibility": "Small cottage with step at entrance; cramped interior with many obstacles.",
  "dangerLevel": "Medium",
  "features": [
    {
      "name": "Hearth and Cauldron",
      "description": "A stone fireplace with a bubbling cauldron emitting aromatic steam with mild hallucinogenic properties."
    },
    {
      "name": "Herb Racks",
      "description": "Walls lined with drying plants, fungi, and stranger organic materials used in Morvath's concoctions."
    },
    {
      "name": "Scrying Bowl",
      "description": "A wide ceramic bowl filled with dark liquid that occasionally shows visions of the forest and keep."
    }
  ],
  "encounters": [],
  "adventureSummary": ""
}