{
  "locationId": "B03",
  "name": "The Withered Shrine",
  "type": "shrine",
  "description": "A bleak clearing dominated by toppled stone pillars and cracked altars adorned with faded runes and neglected offerings such as wilted flowers and tarnished trinkets. The atmosphere is thick with damp moss and residual incense scents, faintly illuminated by drifting blue witchlight. Fresh bootprints and a scrap of blue fabric belonging to Scout Elen are found near the largest altar, which bears half-obscured glyphs revealing faded prayers of protection and warnings about shadows contained only by the warded circle. A roughly carved map on the altar points north toward the Spectral Clearing and Lost Ward Circle--key ritual sites for restoring the forest's ancient protections.",
  "coordinates": "X1Y2",
  "connectivity": [
    "B01",
    "B05",
    "B06"
  ],
  "areaConnectivity": [],
  "areaConnectivityId": [],
  "npcs": [
    {
      "name": "The Lingering Spirit",
      "description": "A translucent, flickering spirit appearing as a hooded forest guardian. It conveys a grave warning about failing wards and escaping shadows, urging restoration of the rites to prevent darkness from overwhelming the forest. It gestures toward the altar, offerings, and a faint trail heading north, signaling the next direction of the party's quest.",
      "attitude": "Neutral, urgent and seeking aid to restore protections"
    }
  ],
  "monsters": [
    {
      "name": "Twig Blights",
      "quantity": {
        "min": 2,
        "max": 4
      }
    }
  ],
  "lootTable": [
    "Tarnished silver amulet (once used in blessing rituals, 10 gp value)",
    "Ceremonial dagger with wooden handle (potential focus for ward rituals)",
    "Small pouch of fragrant dried herbs (can be used for healing poultice, equivalent to healing potion)",
    "Stone tablet fragment with partial ritual instructions",
    "Ration wrapper",
    "Strip of blue cloth torn from Elen's uniform"
  ],
  "plotHooks": [
    "The Lingering Spirit warns that the shrine's binding is failing and shadows are escaping their chains.",
    "Recent bootprints and a scrap of blue fabric belonging to Scout Elen indicate her recent passage and link the party's quest to her disappearance.",
    "Map etched into the altar points north to the Spectral Clearing and Lost Ward Circle, locations key to restoring the wards.",
    "Ritual carvings on the altar provide faded instructions for a binding ritual requiring offerings of earth, flame, and living memory."
  ],
  "dmInstructions": "The Lingering Spirit appears after players investigate the altar and reveals the failing ward. It communicates through fragmented phrases, gestures, and emotional impressions. A DC 13 Religion check helps interpret the spirit's warnings about the failing ward ritual. Players who offer respect or perform minor restorative actions may receive a blessing granting advantage on saves against fear for 24 hours. Emphasize the urgency conveyed by the spirit and the importance of investigating the northern trail.",
  "doors": [],
  "traps": [],
  "dcChecks": [
    "Religion DC 13: Interpret the spirit's warnings and understand the shrine's original purpose and failing ward.",
    "Arcana DC 14: Identify traces of recent dark magic performed at the altar.",
    "Perception DC 12: Notice the twig blights before they attack.",
    "Investigation DC 15: Discover the map carved into the altar's base and faded ritual instructions."
  ],
  "accessibility": "Open clearing with soft, uneven ground; altar has several steps leading up to it.",
  "dangerLevel": "Medium",
  "features": [
    {
      "name": "Cracked Altar",
      "description": "A massive stone altar split down the middle, stained with fresh blood and etched with a rough map pointing toward key ritual sites."
    },
    {
      "name": "Circle of Moss-Covered Stone Pillars",
      "description": "Ancient pillars inscribed with faded prayers, surrounding the clearing and emanating faint magical energy."
    },
    {
      "name": "Offering Bowls",
      "description": "Stone bowls at the altar's base, some containing old offerings, others stagnant water."
    },
    {
      "name": "Discarded Items",
      "description": "Ration wrapper and a strip of blue cloth torn from Elen's uniform found on the ground."
    }
  ],
  "encounters": [
    {
      "encounterId": "B03-E1",
      "summary": "In the Withered Shrine clearing, Norn faced two hostile twig blights emerging from the undergrowth. The first twig blight initiated combat, but missed its initial attack, while the second successfully struck Norn for 4 piercing damage. Norn responded with a decisive longsword strike, dealing 8 slashing damage to the second blight, which was then defeated. The first blight counterattacked, hitting Norn with 6 piercing damage. Norn focused on the first blight, landing another 8 damage blow that splintered it to death. The surviving blight missed its next attack, and Norn finished the fight with a final 7 damage longsword strike, destroying the last twig blight. Both foes were left defeated as cracked wooden bodies on the forest floor. The encounter ended with Norn at 22 out of 36 hit points. Experience points awarded for the encounter are not yet provided.",
      "impact": "The blights were defeated from the area",
      "worldConditions": {
        "year": 1492,
        "month": "Ches",
        "day": 1,
        "time": "17:47:00"
      }
    }
  ],
  "adventureSummary": "In the Withered Shrine clearing, Norn faced two hostile twig blights emerging from the undergrowth. The first twig blight initiated combat, but missed its initial attack, while the second successfully struck Norn for 4 piercing damage. Norn responded with a decisive longsword strike, dealing 8 slashing damage to the second blight, which was then defeated. The first blight counterattacked, hitting Norn with 6 piercing damage. Norn focused on the first blight, landing another 8 damage blow that splintered it to death. The surviving blight missed its next attack, and Norn finished the fight with a final 7 damage longsword strike, destroying the last twig blight. Both foes were left defeated as cracked wooden bodies on the forest floor. The encounter ended with Norn at 22 out of 36 hit points. Experience points awarded for the encounter are not yet provided."
}