{
  "locationId": "R01",
  "name": "Witchlight Trailhead",
  "type": "trail",
  "description": "The narrow path leading from Harrow's Hollow into the Gloamwood is marked by weathered stone pillars inscribed with faded warnings. Pale blue lights—part natural phosphorescence, part otherworldly illumination—drift along the trail. The air is thick with mist and the smell of damp earth and decay. Small offerings—coins, trinkets, and dried flowers—have been placed at the base of the markers by superstitious villagers seeking safe passage.",
  "coordinates": "X2Y1",
  "connectivity": [
    "R02",
    "R03"
  ],
  "areaConnectivity": [
    "Harrow's Hollow East Gate"
  ],
  "areaConnectivityId": [
    "HH001"
  ],
  "npcs": [],
  "monsters": [
    {
      "name": "Shadow",
      "number": 3,
      "disposition": "hostile",
      "strategy": "These shadows lurk near the trailhead, attacking anyone who lingers too long after sunset. They attempt to separate weaker party members, focusing attacks on one target at a time."
    }
  ],
  "lootTable": [
    "Silver pendant (protection charm, 5 gp value)",
    "Broken lantern (once belonged to a lost traveler)",
    "Small leather pouch with 3d6 sp scattered among the offerings",
    "Half-burned map showing part of the forest trail"
  ],
  "plotHooks": [
    "An inscription on one of the markers reads: 'Walk with light, for shadows hunger in the wood.'",
    "Fresh footprints indicate someone recently entered the forest, possibly Scout Elen.",
    "A tattered journal page pinned to a tree describes hearing 'whispers that know your name' deeper in the woods."
  ],
  "dmInstructions": "This location serves as the transition from Harrow's Hollow to the Gloamwood. As night falls, the shadows become active (if the party hasn't moved on). A DC 12 Perception check reveals fresh bootprints matching Scout Elen's description (small, with a distinctive star pattern on the heel). Players who make offerings at the markers gain advantage on their first saving throw in the forest.",
  "doors": [],
  "traps": [],
  "dcChecks": [
    "Perception DC 12: Notice fresh bootprints and signs of recent passage, likely Scout Elen's.",
    "Religion DC 14: Recognize the markers as ancient wards against spirits, now weakened.",
    "Survival DC 13: Identify which path shows signs of Scout Elen's passage."
  ],
  "lighting": "Dim (day), Dark (night)",
  "accessibility": "Narrow trail with occasional rough terrain; reasonable for most travelers.",
  "dangerLevel": "Medium",
  "features": [
    {
      "name": "Warning Markers",
      "description": "Stone pillars carved with protective runes and symbols, now weathered and cracked."
    },
    {
      "name": "Witchlights",
      "description": "Soft blue-green lights that hover just above the path, providing minimal illumination."
    },
    {
      "name": "Offering Shrine",
      "description": "A small alcove in the central marker where travelers leave offerings for safe passage."
    }
  ],
  "encounters": [
    {
      "encounterId": "G001-R01-E1",
      "summary": "As travelers enter the Gloamwood, the mist thickens and the ambient sounds of the forest—birds, insects, rustling leaves—gradually fade to an unnatural silence. Players who linger after dark encounter shadows that seem to peel away from the trees, attacking without warning.",
      "impact": "Establishes the supernatural danger of the forest and creates urgency to reach shelter before nightfall. Success means understanding the forest's dangers; failure could result in injury or worse before the adventure properly begins."
    }
  ],
  "adventureSummary": "The party approached the foreboding entrance to Gloamwood Forest, marked by ancient stone pillars covered with faded warnings and modest offerings from superstitious villagers. Pale blue witchlights drifted eerily along the path ahead, illuminating the thick mist that hung between twisted trees. A careful examination of the trail revealed fresh bootprints matching the description of Scout Elen's distinctive boots, confirming she had indeed ventured this way recently. As daylight began to wane, they noted the unnatural silence of the forest—no birds called, no insects chirped—creating an atmosphere of mounting dread. Deciding not to linger until nightfall when shadows were known to hunt, the party pressed onward, following the trail deeper into the misty woods toward either the Abandoned Ranger Outpost to the east or The Withered Shrine to the west."
}