{
  "locationId": "A03",
  "name": "East Gate and Guardhouse",
  "type": "gate",
  "description": "The East Gate stands open, flanked by a well-kept stone guardhouse with wooden roofing and ready lanterns. The towering palisade of Harrow's Hollow looms above, guarding the muddy road that leads eastward along the Witchlight Trail. The atmosphere is one of cautious optimism as villagers resume their daily routines and sentries maintain vigilant yet hopeful watch over the gate.",
  "coordinates": "X2Y3",
  "connectivity": [
    "A01"
  ],
  "areaConnectivity": [
    "Witchlight Trailhead"
  ],
  "areaConnectivityId": [
    "G001"
  ],
  "npcs": [
    {
      "name": "Joran",
      "description": "A broad-shouldered militia watchman, armed with a spear, friendly and knowledgeable about local happenings. He conveys gratitude from Elder Mirna and offers assistance to travelers.",
      "attitude": "Welcoming and cautiously hopeful after recent troubles."
    },
    {
      "name": "Old Marna",
      "description": "An elder villager who holds the key to the side door granting access to the palisade and East Gate. She is cooperative and supportive of the party's efforts.",
      "attitude": "Helpful and approving."
    }
  ],
  "monsters": [],
  "lootTable": [
    "Town gate key (now held by Old Marna)",
    "Guard's whistle",
    "Small pouch with 12 cp",
    "Town patrol schedule (handwritten, with notes about recent disturbances near the keep)"
  ],
  "plotHooks": [
    "Await the arrival of the merchant wagon mentioned by Joran.",
    "Assist villagers in rebuilding security and prosperity after the curse lifts.",
    "Venture beyond the gate to explore the Witchlight Trail and the wilderness beyond.",
    "Seek out Elder Mirna in the town square for recognition and further quests."
  ],
  "dmInstructions": "Joran serves as a friendly militia watchman who can provide information on local events and the state of affairs. Old Marna holds the key to the palisade's side door and can grant access. There are no traps or threats in the immediate area. The atmosphere reflects the village's recovery, encouraging interactions that emphasize hope and cautious optimism.",
  "doors": [
    {
      "name": "Main Gate",
      "description": "Double heavy wooden gates, open now, iron-banded and weathered but sturdy.",
      "type": "heavy",
      "locked": false,
      "lockDC": 15,
      "breakDC": 18,
      "keyname": "Town gate key",
      "trapped": false,
      "trap": ""
    },
    {
      "name": "Guardhouse Door",
      "description": "A narrow, iron-banded door set into the stone guardhouse, unlocked for party access.",
      "type": "regular",
      "locked": false,
      "lockDC": 0,
      "breakDC": 13,
      "keyname": "",
      "trapped": false,
      "trap": ""
    },
    {
      "name": "Side Door to Palisade",
      "description": "A wooden side door in the palisade, recently unlocked with Old Marna's key to grant party passage.",
      "type": "wooden",
      "locked": false,
      "lockDC": 12,
      "breakDC": 15,
      "keyname": "Side door key",
      "trapped": false,
      "trap": ""
    }
  ],
  "traps": [],
  "dcChecks": [
    "Investigation DC 14: Discover faint footprints and broken brush leading toward the haunted keep.",
    "Persuasion DC 13: Convince militia to share information or allow after-hours travel."
  ],
  "accessibility": "Accessible via a side lane and main road; guarded but welcoming during daylight hours.",
  "dangerLevel": "Low",
  "features": [
    {
      "name": "Watch Bell",
      "description": "A large bronze bell used to sound alarms; can be heard across town."
    },
    {
      "name": "Patrol Roster",
      "description": "A chalkboard inside the guardhouse listing names and shifts, with Elen's name circled in chalk."
    },
    {
      "name": "Gate Mechanism",
      "description": "A stout bar and iron lock securing the gates, currently disengaged as the gate stands open."
    }
  ],
  "encounters": [
    {
      "encounterId": "A03-E1",
      "summary": "The party meets Joran and Old Marna at the East Gate and Guardhouse, gaining information about local conditions and receiving permission to pass through the side door.",
      "impact": "The gate is open and accessible, the party has the key to the side door, and local militia shows cautious optimism reflecting the village's recovery.",
      "worldConditions": {
        "year": 1492,
        "month": "Ches",
        "day": 1,
        "time": "12:29:00"
      }
    }
  ],
  "adventureSummary": "At the East Gate and Guardhouse on 1492 Ches 1, 12:29:00, the party encountered militia watchman Joran and elder Old Marna. They learned of the village's cautious recovery from recent troubles, received thanks from Elder Mirna, and were granted access through the side door with Old Marna's key. The gate stands open, with no traps or threats present. The party now contemplates their next steps, including awaiting a merchant wagon or venturing along the Witchlight Trail."
}