{
  "locationId": "R04",
  "name": "Lost Ward Circle",
  "type": "ritual",
  "description": "An ancient ritual site consisting of seven stone monoliths arranged in a perfect circle. Each stone bears worn carvings of protective symbols and runes that once glowed with powerful magic. Now, several stones have toppled, and the remaining ones are cracked and covered in moss. The center of the circle contains a raised dais with a shallow bowl-like depression. Ghostly blue energy occasionally flickers between the stones like dying lightning, and the ground within the circle is barren of all plant life. The boundary between worlds feels thin here, with whispers and distant wails drifting on the wind.",
  "coordinates": "X3Y2",
  "connectivity": [
    "R02",
    "R07"
  ],
  "areaConnectivity": [],
  "areaConnectivityId": [],
  "npcs": [],
  "monsters": [
    {
      "name": "Specters",
      "number": 2,
      "disposition": "hostile",
      "strategy": "These are the spirits of failed guardians who now attack anyone attempting to repair the ward circle. They phase through stones for cover and target spellcasters first."
    },
    {
      "name": "Will-o'-Wisp",
      "number": 1,
      "disposition": "neutral, then hostile",
      "strategy": "Initially appears helpful, trying to lure party members away from the group before attacking the isolated target."
    }
  ],
  "lootTable": [
    "Ward stone fragment (key component for potential ritual)",
    "Scroll of protection from evil and good",
    "Pouch containing 5 runestones (focus items for ritual magic)",
    "Silver ritual dagger with moonstone pommel (25 gp value)",
    "Tattered ritual book with instructions for renewing the wards"
  ],
  "plotHooks": [
    "The ritual book contains instructions for temporarily strengthening the wards, which could weaken the keep's influence.",
    "One of the fallen stones has a message etched on its inner face: 'The knight's heart remains, buried beneath his hatred.'",
    "Evidence suggests Scout Elen attempted a ritual here but fled when something went wrong."
  ],
  "dmInstructions": "This location offers a significant side quest opportunity. Players can attempt to restore the ward circle with a successful Arcana check (DC 15) and appropriate components (ward stone, runestones, and either blood or powerful magic). Success temporarily weakens undead in the forest (they have disadvantage on attacks for 24 hours) and reveals a clearer path to the keep. Failure attracts additional specters. The will-o'-wisp initially appears as a helpful spirit guide but turns hostile if followed away from the group.",
  "doors": [],
  "traps": [],
  "dcChecks": [
    "Arcana DC 15: Understand how to perform the warding ritual.",
    "Religion DC 14: Identify the original purpose of the ward stones (containing the keep's influence).",
    "Perception DC 13: Notice disturbed earth and footprints suggesting Scout Elen was here recently.",
    "Insight DC 14: Sense the will-o'-wisp's malicious intent despite its seemingly helpful appearance."
  ],
  "accessibility": "Relatively flat clearing with seven large standing stones; one must step over fallen stones to reach the center.",
  "dangerLevel": "High",
  "features": [
    {
      "name": "Standing Monoliths",
      "description": "Seven large stone pillars in various states of disrepair, carved with faded magical runes."
    },
    {
      "name": "Central Dais",
      "description": "A raised stone platform with a bowl-like depression, possibly for offerings or ritual components."
    },
    {
      "name": "Ward Energy",
      "description": "Faint blue energy that occasionally arcs between the stones, remnants of once-powerful protection magic."
    }
  ],
  "encounters": [],
  "adventureSummary": ""
}