{
  "entries": [
    {
      "date": "1492 Ches 1",
      "time": "08:10:00",
      "location": "Harrow's Hollow General Store",
      "summary": "Journal Entry – Day 17 at Harrow’s Hollow\n\nToday, our party made its way to the Harrow’s Hollow General Store, a small yet inviting establishment that stood as the village’s main supply hub. Upon entering, we were greeted by a warmly cluttered space: shelves laden with dried herbs, preserved foods, basic tools, and an assortment of curious trinkets — some seemingly mundane, others hinting at local lore. The air smelled faintly of pine and aged wood, giving the place an oddly comforting atmosphere despite the underlying tension we sensed in the village.\n\nBehind the counter stood Elder Mirna, a middle-aged woman whose lined face bore the marks of both weariness and hope. She regarded us with a cautious, yet grateful demeanor, immediately acknowledging our presence. We exchanged greetings, and she soon opened up about the village’s recent troubles. Harrow’s Hollow had been living under a shadow of fear since Scout Elen, a young and reliable tracker, disappeared while investigating strange occurrences near the ruined keep. Villagers whispered of nocturnal spirits haunting the outskirts, and many had suffered from restless nightmares.\n\nOur eyes were drawn to a cluttered notice board adjacent to the counter. It displayed a variety of postings: a reward offered for the return of missing livestock, a plea for assistance with repairing fences, and notably, warnings about strange lights seen flickering near the ruined keep after nightfall. The notices painted a picture of a community anxious and on edge.\n\nAs we prepared to inquire further, a curious glint caught my eye beneath the counter. Partially hidden in the shadows lay a small bronze key, its surface worn and bearing a faded raven sigil. Bringing it to Mirna's attention, I asked about its origin. She dismissed it casually as an old relic left behind when the store changed ownership. However, the slight hesitation in her voice and the way her eyes lingered on the key suggested she knew more than she let on.\n\nSeizing the moment, we expressed our intent to assist the village in resolving its troubles. At this, Mirna visibly relaxed. She revealed that our previous actions—lifting the curse that had plagued Harrow’s Hollow—had already made a profound difference. The nightmares tormenting the villagers ceased, the ominous lights at the ruined keep vanished, and most hearteningly, the local children’s joyful laughter had returned after days of fear. She spoke on behalf of the community in conveying deep thanks for our help.\n\nIn gratitude, Mirna offered us a small pouch of coins. Though modest in amount, the gift was clearly a sincere token of the villagers’ appreciation. Without hesitation, she then pressed the bronze key firmly into our possession. She explained that, in recognition of our deeds, we had earned the right to hold a piece of the town’s history — a symbol linking us to the ongoing mysteries of Harrow’s Hollow. She hinted that the ruined keep still held secrets and that dangers might yet lurk within the village’s borders. Her words were both a warning and an invitation to rest here, among allies, before continuing our journey.\n\nAs we prepared to leave, Mirna invited us to join the village celebration taking place in the town square. Stepping outside, we found grateful villagers and curious children gathered around a modest bonfire, their faces alight with smiles and laughter. The sense of community was palpable, a stark contrast to the unease that had gripped them days before.\n\nWe decided to partake in the festivities, eager to bolster the village’s renewed spirit and gather any information from the locals. When we finally departed the general store, our party felt a renewed sense of purpose and camaraderie. The bronze key, warm in my hand, served as a tangible reminder of our connection to Harrow’s Hollow and the adventures still unfolding here.\n\nParty Status: Morale high; minor scrapes from recent travels healed; supplies restocked modestly from the store’s offerings; spirits lifted by villagers’ gratitude. Ready to press on after a night of celebration and rest.\n\nEnd of entry."
    },
    {
      "date": "1492 Ches 1",
      "time": "08:02:00",
      "location": "Harrow's Hollow General Store",
      "summary": "Journal Entry: Visit to Harrow’s Hollow General Store\n\nAs dawn broke over the village of Harrow’s Hollow, our party made our way to the local general store, the first stop in resupplying before continuing our journey. The building itself bore the comforting hallmark of familiarity—a well-worn wooden structure that exuded a homely aroma of wax and aged leather. The morning light filtered through the front windows, casting a warm glow over neatly arranged shelves lined with various supplies: lanterns with polished brass fittings, tightly packed rations, coils of sturdy rope, and an assortment of exotic trinkets whose origins were not immediately clear.\n\nBehind the counter stood Elder Mirna Harrow, a woman whose presence commanded quiet respect. Her silver hair framed a face marked by wrinkles of experience and sharp, watchful eyes. She greeted us with a mixture of warmth and a no-nonsense demeanor, suggesting a long history of managing this establishment and interacting with travelers passing through.\n\nAs our eyes scanned the room, a bronze key caught our attention, hanging discreetly on a hook behind Mirna. The key was ornate, bearing a faded raven sigil that spoke of some local significance or family crest. Nearby, several notices were pinned to the wall: a flyer seeking a missing pet, a faded letter requesting aid with an unspecified task, and cautionary warnings about strange lights observed in the nearby woods. These hints of the village’s quiet mysteries lingered in the air but remained unaddressed for the moment.\n\nWe engaged Elder Mirna in conversation to inquire about basic provisions. Our primary need was for rations to sustain us on the road ahead. Mirna responded with practiced efficiency, offering a day’s pack consisting of dried meat, hard tack biscuits, and a honeyed oatcake. The price was five silver pieces per pack. She also mentioned additional items suitable for travelers—durable waterskins, leather pouches, and ropes—should we require them. Her brisk manner made it clear she was accustomed to travelers’ needs and preferences, efficiently balancing hospitality with business.\n\nThroughout our interaction, Mirna neither shared nor solicited gossip about the key or the cryptic notices, and we chose not to press her for details. The back storeroom door was closed firmly, reinforcing the sense that certain aspects of the store’s inventory or village affairs were kept private or protected.\n\nNo threats or hostilities arose during our visit. The atmosphere remained calm and professional. After finalizing our purchase—securing enough rations for the next several days and a few extra waterskins for good measure—we bid Elder Mirna farewell and exited the general store.\n\nAs we stepped out into the bustling morning air of Harrow’s Hollow, our bundles restocked and spirits steady, we set our sights on the town square. Our stop at the general store had been fruitful and uneventful, a brief yet necessary pause before the next chapter of our journey.\n\nParty Status Upon Departure: All members in good health and morale, adequately provisioned with food and water supplies, and mentally prepared for the tasks ahead. No new leads pursued regarding local rumors or the bronze raven key at this time."
    },
    {
      "date": "1492 Ches 1",
      "time": "09:09:00",
      "location": "Harrow’s Hollow Town Square",
      "summary": "Journal Entry – Arrival at Harrow’s Hollow\n\nDate: [Insert in-game date]\n\nOur party arrived at the quaint village of Harrow’s Hollow as dawn broke, the air crisp with morning chill. The village, nestled amid rolling hills and dense woodlands, immediately felt alive with the low hum of daily activity. Our first stop was the general store, a sturdy wooden building adorned with faded hand-painted signs. Inside, we were warmly welcomed by Elder Mirna Harrow, a kindly woman whose silver-streaked hair and gentle smile radiated a sense of calm authority.\n\nMirna greeted us cheerfully, expressing gratitude for our recent efforts in lifting the curse that had plagued the nearby wilds. She offered us supplies, presenting an assortment of rations, basic adventuring gear, and local wares. We inquired specifically about purchasing rations, weighing the options on quantity and quality, but ultimately decided to delay our purchase. Feeling the pull of the village’s energy and our need for information, we thanked Mirna and proceeded toward the bustling town square.\n\nThe square was alive with the morning bustle. Villagers milled about near the ancient stone well at its center, chatting animatedly or attending to their daily tasks. Several market stalls displayed simple goods: freshly baked bread, dried herbs, woven baskets, and pottery. Nearby, a contingent of militia clad in leather armor and bearing spears stood watchful, their eyes scanning the crowd with quiet vigilance.\n\nAs we moved through the square, villagers recognized us, their whispers drifting through the air. They spoke of our recent deeds—lifting a terrible curse in the wilds beyond the village boundaries. Gratitude was mingled with an air of curiosity, as though our presence sparked both hope and questions about what might come next.\n\nSeeking more concrete leads, we approached Old Tommen, a thin, elderly man with a weathered face etched deep by time and many stories. He was seated on a wooden bench, surrounded by a clowder of cats that seemed to adore him. Tommen greeted us with a knowing smile, clearly aware of our reputation.\n\nUpon our prompting, Tommen acknowledged our heroic role and eagerly shared what he knew. He spoke of rumors circulating regarding a wandering spirit haunting the outskirts of the village. When we asked about Scout Elen, who had gone missing recently, Tommen’s expression darkened. He revealed that Elen vanished two nights ago after investigating strange ghostly lights appearing near the old keep. The scout was last seen in the Wyrd Lantern inn, conversing with a woman named Cira before heading out toward the old moor, a place steeped in local superstition and believed to be cursed.\n\nThe villagers’ voices we’d overheard were confirmed: there was genuine concern for Elen’s safety. Many noted that she had been visibly exhausted in recent days, burdened by the belief that the curse on the keep might be stirring anew. Tommen advised us to seek out Cira at the inn for more insight and to carefully investigate the east gate area, warning that the moor harbored unknown dangers that had best be approached with caution.\n\nWith this knowledge, we chose not to linger further in the town square. Instead, we returned to the general store, intent on securing supplies before pursuing these new leads. As we departed, a sense of mystery thickened the air — the fate of Scout Elen and the ominous nature of the moor now pressing heavily on our minds.\n\nStatus of the party upon leaving:\n- Spirits cautiously hopeful, alert to the village’s undercurrents of fear\n- Equipped with basic knowledge of local geography and key NPCs: Elder Mirna Harrow, Old Tommen, and Cira at the Wyrd Lantern\n- Prepared to investigate the east gate and old moor with an understanding of potential supernatural threats ahead\n\nEnd of entry."
    },
    {
      "date": "1492 Ches 1",
      "time": "08:00:00",
      "location": "Harrow's Hollow General Store",
      "summary": "Journal Entry – Day 7, Early Afternoon\n\nAfter our morning’s march through the damp, fog-laden streets of Harrow’s Hollow, we made our way to the village general store, a modest wooden structure nestled at the crossroads that seemed to serve as the heart of this small community. Upon entering, the slight creak of the aged wooden floorboards announced our arrival, and we found Elder Mirna Harrow standing behind the counter. She appeared visibly worn—her once-bright eyes shadowed with fatigue, her hands marked by toil—yet her demeanor was unexpectedly warm and welcoming. It was clear the recent troubles had taken their toll on her, but her spirit remained resilient.\n\nAs we took in the interior, our eyes were drawn to a cluttered notice board mounted on the wall adjacent to the counter. It was plastered with various pinned papers: several notices about missing livestock—mostly sheep and a few cows—warned locals to be cautious, especially along the old east trail, a once-commonly traveled route now fraught with danger. Another paper offered a reward for any clues pertaining to the recent disappearances of villagers and travelers. These notices set a grim backdrop, hinting at the unease plaguing Harrow’s Hollow despite the recent lifting of the curse that had long haunted the region.\n\nOn the counter lay an intriguing object that caught our attention: a bronze key etched with a finely detailed raven sigil. We inquired about it, and Mirna brushed it off initially as a trivial relic, an old trinket with little importance. However, upon pressing gently, she revealed that the key was tied to the Greymont family—a once-prominent lineage whose ancestral keep now lies in ruin on the outskirts of the village. Mirna suggested that the key might unlock hidden chambers or secrets within the Greymont estate, though she admitted none in Harrow’s Hollow had dared to explore it deeply since the curse’s shadow first fell.\n\nSeizing the opportunity to aid the village, we offered our assistance in uncovering the truth behind the Greymont family’s affairs and the village's lingering unrest. Mirna’s eyes softened with gratitude, and she entrusted us with this task, cautioning that old wounds still fester beneath the surface—mysteries left unresolved and possibly dangerous. She did not press us for immediate answers but emphasized the importance of discretion, implying that the village’s fragile peace depended on what we discovered.\n\nNo hostilities or threats emerged during our visit; the atmosphere remained tense but peaceful. We chose not to delve further into the store’s wares or press Mirna for additional information, recognizing that some matters required time and trust to unravel. With a renewed sense of purpose, we departed the general store, setting our sights on finding Tommen, hoping he might shed more light on the village’s enigmas.\n\nAs we left, the weight of the bronze key in my pack served as a tangible reminder of the secrets waiting to be unearthed and the challenges that lie ahead. Our party remained intact and resolute, spirits steadied by Mirna’s trust and the knowledge that our journey into Harrow’s Hollow’s deeper mysteries was only just beginning."
    },
    {
      "date": "1492 Ches 1",
      "time": "08:05:00",
      "location": "Harrow's Hollow General Store",
      "summary": "Journal Entry – Day 7 in Harrow’s Hollow\n\nToday, our party made our way to the Harrow’s Hollow General Store, a modest establishment situated near the village center. Upon entering, we were met by Elder Mirna Harrow herself, an elderly woman with a measured demeanor that balanced cautiousness and warmth. She immediately acknowledged our arrival, her eyes reflecting both hope and lingering concern. Mirna inquired about our progress concerning the recent troubling events that have unsettled the town—specifically the broken curse that has plagued the area and the still-pervading fears among the villagers.\n\nAs we spoke, our attention was drawn to an intriguing object on the counter: an old bronze key adorned with a faded raven sigil. Mirna’s posture shifted subtly when we noticed it—she instinctively positioned herself closer to the key, her fingers brushing over it in a protective manner. This silent gesture hinted at deeper secrets tied to the key and its significance within the town’s troubled history, though she offered no immediate explanation.\n\nExpressing our intent to assist the people of Harrow’s Hollow, Mirna advised us to engage with the townsfolk directly, noting that many were still frightened and reluctant to speak openly. She directed us to the village’s notice board, which was plastered with reports of missing livestock and villagers—evidence that the threat, while reduced, remained persistent. The board offered a tangible lead and underscored the ongoing anxiety present despite the curse’s supposed end.\n\nThroughout our conversation, Mirna offered her support, promising access to supplies and counsel as we continue our investigations. Her willingness to aid us helped to establish a foundation of trust, vital for any further cooperation in this tight-knit community.\n\nNo combat or immediate dangers arose within the general store; the encounter was peaceful and focused entirely on intelligence gathering and relationship-building. As we prepared to leave, we resolved to pursue a promising lead: seeking out a villager named Tommen, who may possess valuable information about recent disappearances and the residual effects of the curse.\n\nWe departed the store with a clearer understanding of the village’s precarious situation and a renewed sense of purpose. Our party remains cautious but determined, ready to navigate the delicate social fabric of Harrow’s Hollow and uncover the truths hidden beneath its surface.\n\nState of the party upon leaving:\n- Spirits were lifted slightly by Mirna’s warm reception and offer of support.\n- Equipped with knowledge from the notice board highlighting ongoing threats.\n- Motivated to seek out Tommen, setting the next destination and objective.\n- No injuries sustained; party remains at full strength and prepared for forthcoming challenges."
    }
  ]
}