{
  "campaign": "Keep_of_Doom",
  "entries": [
    {
      "date": "1492 Ches 1",
      "time": "08:08:00",
      "location": "Harrow's Hollow General Store",
      "summary": "Upon entering Harrow's Hollow General Store, the party encountered Elder Mirna Harrow, the village leader standing behind the wooden counter amid neatly arranged supplies such as coils of rope, dried herbs, and well-used tools. The atmosphere was quiet save for the ticking clock and distant crow calls, with lamplight casting a warm glow on a notice board crowded with various announcements, including cryptic warnings and a reward poster. The party noticed a tarnished bronze key bearing a faded raven sigil resting beside a sealed pouch on the counter. When Norn expressed a desire to help with the recent disappearances, Elder Mirna responded with gratitude and grave concern, recounting that several villagers--including the miller Jarrek, the tanner's boy, two trappers, and the scout Elen--had vanished mysteriously after dark in different locations. She mentioned rumors of spirits from nearby ruins and a growing fear among the villagers, advising the party to seek out Cira at the Wyrd Lantern Inn or Old Tommen by the town square for more information. Though Mirna hinted at concealed knowledge related to the bronze key, she did not elaborate further. After this exchange, the party concluded their business in the general store and proceeded toward the town square to speak with Old Tommen, marking a progression in their investigation of the village's troubling disappearances."
    },
    {
      "date": "1492 Ches 1",
      "time": "09:10:00",
      "location": "Harrow's Hollow General Store",
      "summary": "Journal Entry - Arrival at Harrow's Hollow and Initial Investigation\n\nDate: Early Morning, Misty Dawn\n\nAs the pale morning mist clung to the earth, our party entered Harrow's Hollow, a small, somber village nestled in a shallow valley. Our first stop was the Harrow's Hollow General Store, a sturdy wooden building exuding an air of quiet resilience. The store was well-stocked with a variety of goods--dried herbs, simple tools, and household necessities--arranged neatly on wooden shelves. A large notice board stood near the entrance, covered with handwritten announcements and warnings relevant to the village.\n\nBehind the counter stood Elder Mirna Harrow, a woman of middle age with sharp eyes that contrasted her gentle demeanor. She greeted us with a nod, her voice steady but carrying an undertone of concern. Mirna recognized our arrival immediately, stating that while the village rarely required supplies, what they desperately needed was news--something to pierce the veil of uncertainty and fear that had settled over the community.\n\nAs we introduced ourselves and offered assistance with the recent spate of disappearances, Mirna's expression darkened. She shared grim details: over the past several weeks, several villagers had vanished under mysterious circumstances after nightfall. Among the missing were Jarrek, the local miller, the tanner's boy, two experienced trappers, and most troubling of all, Scout Elen--a skilled and brave young woman known for her keen tracking abilities. The villagers whispered about spirits or curses tied to the ruins of an old keep nearby, though no one truly knew what caused these disappearances.\n\nMirna advised that further insight might be gained from two other locals: Cira, who runs the Wyrd Lantern Inn, and Old Tommen, a reclusive elder who often lingers near the town square's stone well. She gestured toward a curious item resting on the counter--an old bronze key adorned with a raven sigil. Mirna hinted that this key could unlock hidden secrets within the village, though she offered no explanation of its origin or use.\n\nTaking our leave from the store, the party ventured toward the town square. The air grew heavier, laden with unspoken fear and memories. There, we found Old Tommen seated beside the central stone well. He was a wiry old man, his wild beard tangled and patched clothing faded from years of wear. His wary eyes scrutinized us with suspicion, but he invited us to sit and speak, warning us to respect the village's lore and not dismiss the stories that had been passed down.\n\nThe encounter with Tommen was tense but civil. He did not offer new concrete information immediately but suggested that we tread carefully and listen closely to the village's undercurrents.\n\nNo hostile encounters or combat arose during our visits. We departed from the square with valuable knowledge: the identities and timelines of the missing villagers, leads on where to seek further information, and the mysterious bronze key as a tangible clue. Our party is currently in good condition--unharmed and mentally alert--ready to continue probing the dark shadows enveloping Harrow's Hollow. Next steps will involve visiting Cira at the Wyrd Lantern Inn and investigating the significance of the raven-key to unravel the village's mounting mysteries."
    },
    {
      "date": "1492 Ches 1",
      "time": "09:15:00",
      "location": "Harrow's Hollow Town Square",
      "summary": "In Harrow's Hollow Town Square, the party encountered Old Tommen, an elderly villager who provided crucial information about the missing scout, Elen. The square was noticeably quiet, with only faint sounds of hammering and distant dogs breaking the silence. Old Tommen recounted that Scout Elen had ventured east to investigate strange lights near the mill and old stones by Blackberry Hollow but never returned. He mentioned that Elen was last seen arguing with a tanner's boy, who had also gone missing. Tommen suggested that while some blamed wolves or bandits, the area might be haunted by spirits, curses, or old grudges, emphasizing that the woods themselves were ominous, especially the east trail where shadows seemed to move unnaturally. He advised the party to search Blackberry Hollow for tracks or to inquire at the inn, where a woman named Cira kept informed of local happenings. Tommen's warnings and guidance led to an update in the party's ongoing investigation, marking the plot point of Elen's disappearance as active and providing a supernatural angle to the mystery. Following this encounter, the party considered their next move, including the general store adjacent to the square, signaling their intent to explore further leads within Harrow's Hollow before moving on."
    },
    {
      "date": "1492 Ches 1",
      "time": "10:18:00",
      "location": "Harrow's Hollow Town Square",
      "summary": "Journal Entry - Day 7 in Harrow's Hollow\n\nToday the party made significant strides in uncovering the mystery surrounding the disappearance of Scout Tommen. Our journey led us first to the Town Square of Harrow's Hollow, a modest but bustling area that serves as the heart of the village. The air was thick with a palpable tension, as if the townsfolk carried invisible burdens.\n\nOur initial contact was with Old Tommen, an elderly local whose weather-beaten face tells stories of many harsh winters. Upon recognizing our interest in the missing scout, he shared what little he knew. Scout Elen, a fellow scout and close companion of Tommen, had gone eastward days ago to investigate reports of strange, flickering lights near a place called Blackberry Hollow. She never returned. Old Tommen recalled that the last anyone saw of Elen, she was near the edge of the woods, engaged in a heated argument with the tanner's boy - a young man from the village who is now also missing. This detail struck us as crucial, possibly holding the key to what transpired.\n\nOld Tommen's tone grew grave as he warned us of the supernatural dangers that plague the woods--he spoke of restless spirits, ancient curses, and secrets buried beneath the forest floor. He advised caution, recommending either a direct investigation of Blackberry Hollow or a visit to Cira, the innkeeper, who might possess additional information. He particularly cautioned us about \"moving shadows\" seen along the east trail, hinting at unseen, possibly malevolent forces at work.\n\nInstead of venturing immediately into the woods, the party decided prudence was wise and we returned to the town's general store for further inquiry. There, we were greeted by Elder Mirna, a middle-aged woman whose calm demeanor belied the undercurrent of anxiety evident in the shop. She welcomed us warmly and offered her assistance. As we scanned the dimly lit store, our eyes were drawn to two notable items resting on the counter: a bronze key emblazoned with a raven sigil and a sealed leather pouch. Both appeared untouched for some time, possibly connected to the recent troubles.\n\nThroughout our time in the store, the atmosphere remained tense and hushed, underscoring the unease that grips Harrow's Hollow. The villagers' reluctance to speak openly suggests fear and possibly other unknown factors at play.\n\nArmed with Old Tommen's warnings, the revelations about Elen and the tanner's boy, and the mysterious artifacts in the general store, the party ended the day deliberating our next steps. The choice to investigate Blackberry Hollow directly or seek a meeting with Cira at the inn weighs heavily on us. The shadow of the woods looms large, and we prepare ourselves for what dangers may lie ahead.\n\nState of the party as we leave: cautious but resolute, with renewed focus and a growing sense of the supernatural threats that surround Harrow's Hollow. We carry the bronze key and leather pouch as potential keys to unlocking the mystery, alongside the vital knowledge gained from our encounters thus far."
    },
    {
      "date": "1492 Ches 1",
      "time": "10:20:00",
      "location": "Harrow's Hollow General Store",
      "summary": "Upon entering Harrow's Hollow General Store, the party encountered Elder Mirna, who was meticulously arranging jars behind the counter. When questioned about Elen, Mirna recalled the morning Elen had left, describing how Elen had come in early to purchase a length of strong hempen rope, a fresh oilskin for her journal, a fine lantern, flint, tinder, and a charm consisting of a sprig of dried rowan and a tin amulet believed to ward off ill fortune. Mirna noted Elen's determined demeanor and her intent to follow tracks near Blackberry Hollow, refusing accompaniment despite Mirna's offer to send a young villager, Callum. Mirna expressed hope for Elen's safe return and mentioned no other items missing from the shelves, emphasizing Elen's honesty in always paying her due. The interaction took place in the well-lit, modest general store, with shelves displaying various goods, including similar amulets hanging from chipped nails. After acquiring this information, the party decided to leave the store and head toward the Wyrd Lantern Inn, concluding their time at the general store without triggering any traps or additional encounters."
    },
    {
      "date": "1492 Ches 1",
      "time": "11:25:00",
      "location": "Harrow's Hollow General Store",
      "summary": "Journal Entry -- Day 14 in Harrow's Hollow\n\nToday, our party made our way to the Harrow's Hollow General Store to inquire about supplies purchased recently by Elen, the missing villager we have been searching for. Upon entering, we were greeted by Elder Mirna, the store's silver-haired shopkeeper. Mirna seemed cautious but welcoming, her eyes reflecting a deep concern beneath her calm exterior.\n\nWe asked about Elen's last purchases, hoping to uncover clues about her intentions. Mirna recalled clearly that Elen had bought a strong hempen rope, which could be crucial for traversing rough terrain or climbing. She also purchased an oilskin cover for her journal -- a sign that she intended to keep records or notes despite the wet conditions here. Additionally, Elen had selected a fine lantern, flint and tinder for fire-starting, and intriguingly, a sprig of dried rowan along with a small tin amulet. Mirna explained that the rowan and amulet were believed to ward off ill fortune, suggesting Elen feared some danger on her path.\n\nDuring our conversation, Mirna shared that Elen was adamant about following the tracks near Blackberry Hollow. Despite young Callum's offer to escort her, Elen declined, insisting on facing whatever lay ahead alone. This resolve worried Mirna deeply. She asked us to promise that if Elen was found, the villagers still hoped for her safe return. There was a somber weight to her request, underscoring the growing fear in the village.\n\nWe carefully inspected the general store but found no signs of recent combat or struggle. The shelves were orderly, and no other special items or clues stood out. This suggested that any danger Elen faced likely occurred deeper in the wilderness, away from the village center.\n\nAfter thanking Mirna for her time and information, we left the store and passed through the village square. There, we noticed Old Tommen murmuring quietly near the well, his expression troubled. Several townsfolk paused as we walked by, their eyes filled with a mixture of hope and dread. The atmosphere was tense, underscoring how Elen's disappearance had unsettled the entire community.\n\nWe continued on to the Wyrd Lantern Inn, a cozy establishment run by a woman named Cira. Upon entering, Cira greeted us with visible relief and eagerness, inviting us to sit and share a mug of cider. She urged us to ask questions before rumors and fear had a chance to further unsettle the village. Her warm demeanor and willingness to assist hinted that she might be a valuable source of information going forward.\n\nAs we concluded our visit to the inn, we felt the weight of the villagers' hopes resting on our shoulders. Armed now with knowledge of Elen's supplies and her determined route toward Blackberry Hollow, we prepared ourselves to delve deeper into the surrounding wilds. The path ahead remains uncertain, but with each step, we draw closer to uncovering what has befallen Elen.\n\nParty Condition: Spirits steady but cautious; well equipped with the knowledge gained today. No injuries sustained. Supplies remain sufficient as we ready ourselves for the journey ahead."
    }
  ]
}