{
  "areaId": "NCW001",
  "areaName": "Northern Corrupted Woods",
  "areaType": "wilderness",
  "areaDescription": "Black-needled pines twist upward from a ground quilted in ashen moss, their trunks leaking rivulets of dark sap that shimmer with unnatural life; the air crackles with a sharp, metallic tang, and every step is answered by the low, distant chittering of unseen things that watch from the shifting gloom.",
  "dangerLevel": "high",
  "recommendedLevel": 2,
  "climate": "tropical",
  "terrain": "swamp",
  "map": {
    "mapId": "MAP_5",
    "mapName": "Wilderness Map",
    "totalRooms": 5,
    "rooms": [
      {
        "id": "R01",
        "type": "cave",
        "connections": [
          "R02",
          "R03"
        ],
        "coordinates": "X2Y2",
        "name": "Gloomsap Cavern"
      },
      {
        "id": "R02",
        "type": "grove",
        "connections": [
          "R01",
          "R04",
          "R05"
        ],
        "coordinates": "X1Y2",
        "name": "Twisted Briar Grove"
      },
      {
        "id": "R03",
        "type": "cave",
        "connections": [
          "R01",
          "R04"
        ],
        "coordinates": "X2Y3",
        "name": "Hollow Shade Den"
      },
      {
        "id": "R04",
        "type": "campsite",
        "connections": [
          "R02",
          "R03"
        ],
        "coordinates": "X1Y3",
        "name": "Forsaken Hearth Encampment"
      },
      {
        "id": "R05",
        "type": "hilltop",
        "connections": [
          "R02"
        ],
        "coordinates": "X1Y1",
        "name": "Shrouded Sentinel Rise"
      }
    ],
    "layout": [
      [
        "R05",
        "   "
      ],
      [
        "R02",
        "R01"
      ],
      [
        "R04",
        "R03"
      ]
    ]
  },
  "locations": [
    {
      "locationId": "R01",
      "name": "Gloomsap Cavern",
      "type": "cave",
      "description": "Nestled beneath the misshapen pines, a jagged crack in the earth descends into dripping shadow. The air is thick with the scent of decay. Veins of black sap glisten along the stone, and ill light flickers where clusters of glowing fungi sprout between damp stalactites. Near the rear, a still underground pool mirrors the ceiling’s eerie, shifting lights.",
      "coordinates": "X2Y2",
      "connectivity": [
        "R02",
        "R03"
      ],
      "areaConnectivity": [],
      "areaConnectivityId": [],
      "npcs": [],
      "monsters": [
        {
          "name": "Corrupted Woodland Creatures",
          "description": "Animals twisted by the woods' dark influence—elongated limbs, slavering maws, and unnatural aggression.",
          "type": "Beast (Corrupted)",
          "number": "2 giant rats (with black sap veins), 1 corrupted wolf"
        }
      ],
      "lootTable": [
        "Vial of Black Sap (can be studied for clues or ingredients)",
        "Obsidian Arrowheads (6, deal +1 damage vs. plant creatures)",
        "Cracked Silver Locket (contains a faded family portrait; sentimental, worth 5 gp)",
        "Patch of Glowing Fungi (can be harvested, glows for 1 hour, faint restorative properties, DC 10 Medicine to use successfully)"
      ],
      "plotHooks": [
        "The corrupted creatures bear sigils burned into their hides—investigating reveals a link to the recent bandit attacks and the wider corruption.",
        "Studying the pool and sap yields evidence that a larger entity is poisoning the woods’ heart."
      ],
      "dmInstructions": "This is a tense, shadowy cave best for low-light encounters. The party may need to avoid or confront corrupted beasts; finding and studying the sap or pool provides clues about the nature and source of the corruption. Use the fungi for environmental effects (dimming or quick healing). Adjust encounter difficulty if the party is already wounded.",
      "doors": [
        {
          "name": "Cavern Mouth",
          "description": "A jagged, moss-fringed stone archway. No door, but partially obscured by tangled roots.",
          "type": "regular",
          "locked": false,
          "lockDC": 0,
          "breakDC": 10,
          "keyname": "",
          "trapped": false,
          "trap": ""
        }
      ],
      "traps": [
        {
          "detectDC": 13,
          "disableDC": 13,
          "triggerDC": 12,
          "damage": "1d6 poison (brushing against certain roots releases toxic sap)"
        }
      ],
      "dcChecks": [
        "Nature DC 12: Identify the glowing fungi as mildly restorative.",
        "Investigation DC 14: Discover the beast corpses have ritual sigils carved after death.",
        "Medicine DC 10: Safely collect and use glowing fungi as a minor healing salve (1d4 HP)."
      ],
      "accessibility": "Entrance partially hidden by roots, but a clear (if slippery) descent leads inside. Moderate risk of slipping; see trap.",
      "dangerLevel": "High",
      "features": [
        {
          "name": "Stalactites",
          "description": "Damp, jagged formations—some hang low enough to threaten the unwary."
        },
        {
          "name": "Glowing Fungi",
          "description": "Blue-green, bioluminescent clusters that pulse softly and can be harvested."
        },
        {
          "name": "Underground Pool",
          "description": "A motionless pool, rimmed with black sap, that reflects the cavern eerily."
        }
      ],
      "encounters": [
        "Corrupted woodland creatures attack intruders or lurk near the pool, defending their territory.",
        "Studying the pool or fungi may trigger a second, environmental hazard (toxic vapors or a sudden swarm of corrupted insects)."
      ],
      "adventureSummary": "A lair of corrupted beasts and evidence of the woods’ infection. Vital for uncovering the corruption’s cause and possible remedies."
    },
    {
      "locationId": "R02",
      "name": "Twisted Briar Grove",
      "type": "grove",
      "description": "A small clearing choked by thorny briars and drooping, sap-leaking trees. Circles of strange mushrooms thrive in the perpetual gloom, and the faint sound of distant, warped birdsong echoes between sickly trunks. The earth is uneven, riddled with hidden roots and soft, ashen moss.",
      "coordinates": "X1Y2",
      "connectivity": [
        "R01",
        "R04",
        "R05"
      ],
      "areaConnectivity": [],
      "areaConnectivityId": [],
      "npcs": [],
      "monsters": [
        {
          "name": "Animated Vines",
          "description": "Briars ensorcelled by the corruption. They lash at trespassers, attempting to entangle and drain life.",
          "type": "Plant (Hazard/Monster)",
          "number": "1 animated mass (as Vine Blight), 2 swarms of biting thorn sprites (use Swarm of Insects stats, deal slashing instead of piercing)"
        }
      ],
      "lootTable": [
        "Briar-Touched Ring (grants minor resistance to poison for 1 hour, once)",
        "Small Pouch of Unidentified Seeds (arcana or nature check to determine use)",
        "Moss-Covered Bandolier (holds 3 small vials; 1 empty, 1 with sticky sap, 1 with dried orange spores)",
        "Bundle of Black Feather Talismans (each feather vibrates faintly near magic)"
      ],
      "plotHooks": [
        "Investigating the mushroom circles reveals they are recent—part of a spreading blight. Destroying or sanctifying them may slow the corruption.",
        "The feathers and seeds may match clues found at other bandit or beast attack sites."
      ],
      "dmInstructions": "The grove is an environmental hazard—animated vines and thorn swarms attack anyone disturbing the mushrooms or crossing the clearing. Use the birdsong to hint at nearby dangers or safe paths. Clever use of fire or area-of-effect spells may control the battle, but risk spreading the blight.",
      "doors": [],
      "traps": [
        {
          "detectDC": 12,
          "disableDC": 14,
          "triggerDC": 12,
          "damage": "Restrained for 1 round (no damage) if caught by animated briars; DC 12 Strength or Acrobatics to escape."
        }
      ],
      "dcChecks": [
        "Nature DC 13: Identify mushrooms as unnatural, not native to the region.",
        "Survival DC 12: Find a safe path through, avoiding most hazards.",
        "Arcana DC 14: Detect lingering necromantic or fey energy in the feather talismans."
      ],
      "accessibility": "Dense undergrowth and thorns make passage slow unless a safe route is found. Easy to enter, hard to traverse quickly.",
      "dangerLevel": "High",
      "features": [
        {
          "name": "Unusual Plants",
          "description": "Sickly, dark-leafed shrubs with bulbous yellow berries. Some are mildly toxic."
        },
        {
          "name": "Mushroom Circles",
          "description": "Three rings of fat, gray mushrooms—stepping inside triggers the animated vines."
        },
        {
          "name": "Birdsong",
          "description": "Strange, echoing calls periodically rise and fall, sometimes in reverse—signals for woodland denizens."
        }
      ],
      "encounters": [
        "Animated vines lash out if mushroom rings are approached or disturbed.",
        "A swarm of thorn sprites bursts from a hollow log if the party lingers more than 10 minutes."
      ],
      "adventureSummary": "A dangerous passage and a source of clues about the growing corruption. Investigation here can slow the blight or arm the party with vital knowledge."
    },
    {
      "locationId": "R03",
      "name": "Hollow Shade Den",
      "type": "cave",
      "description": "Just beyond a curtain of drooping black-needle pines, this shallow, stony den seeps with cold mist. The entrance is barely wide enough for a crouching humanoid. Stalactites hang like jagged teeth above a small, circular chamber, where animal bones and feather clumps litter the floor.",
      "coordinates": "X2Y3",
      "connectivity": [
        "R01",
        "R04"
      ],
      "areaConnectivity": [],
      "areaConnectivityId": [],
      "npcs": [
        {
          "name": "The Withered Hart",
          "description": "A spectral, antlered fey spirit with matted fur and hollow, burning eyes. Speaks in riddles and warns of the corruption spreading from deeper within the woods. May aid or hinder the party depending on their respect for the woods.",
          "attitude": "Wary but curious; becomes helpful if shown respect for nature or if the party offers a token of goodwill."
        }
      ],
      "monsters": [
        {
          "name": "Corrupted Owl",
          "description": "A large, emaciated owl with black sap oozing from its eyes and beak. It attacks intruders and protects the spectral hart.",
          "type": "Beast (Corrupted)",
          "number": "1"
        }
      ],
      "lootTable": [
        "Antler Talisman (grants advantage on saves vs. charm and fear, once)",
        "Fey-Inscribed Pebble (can cast Druidcraft once per day)",
        "Bundle of Feathers and Bones (useful for rituals or bartering with forest spirits)"
      ],
      "plotHooks": [
        "The Withered Hart can whisper secrets about the source of the corruption and provide cryptic clues to its undoing.",
        "The den contains ritual markings that tie the spectral hart’s fate to the health of the woods."
      ],
      "dmInstructions": "Roleplay The Withered Hart as enigmatic and otherworldly. If the party is respectful, it offers advice, a magical boon, or a non-combat resolution. The Corrupted Owl attacks only if the party is aggressive or disturbs the bones. Investigating the markings and items can reveal more about the woods’ spirit.",
      "doors": [
        {
          "name": "Curtain of Pines",
          "description": "A thick, low-hanging tangle of pine branches and needles concealing the den’s mouth.",
          "type": "secret",
          "locked": false,
          "lockDC": 0,
          "breakDC": 8,
          "keyname": "",
          "trapped": false,
          "trap": ""
        }
      ],
      "traps": [],
      "dcChecks": [
        "Nature DC 12: Recognize the bones as belonging to predators and prey alike—unnatural for a single den.",
        "Religion DC 14: Understand the ritual markings as protective wards, now mostly faded.",
        "Insight DC 12: Sense The Withered Hart’s true motives."
      ],
      "accessibility": "Easily missed unless searched for; accessible to Small/Medium creatures with some squeezing.",
      "dangerLevel": "High",
      "features": [
        {
          "name": "Stalactites",
          "description": "Sharp, dripping stalactites hang over the den’s center."
        }
      ],
      "encounters": [
        "The Withered Hart appears if the party enters quietly or with offerings.",
        "Corrupted Owl attacks if the Hart is threatened or the den is desecrated."
      ],
      "adventureSummary": "A haunted den, home to a powerful spirit and a dangerous animal guardian. Interaction here may shift the party’s fortunes in the woods."
    },
    {
      "locationId": "R04",
      "name": "Forsaken Hearth Encampment",
      "type": "campsite",
      "description": "Once a ranger’s outpost, now deserted and half-consumed by moss. The central firepit is cold and filled with gray ash. Odd, angular structures of woven wood and stone offer some shelter. Dust motes drift in listless shafts of sickly light, and the silence is oppressive.",
      "coordinates": "X1Y3",
      "connectivity": [
        "R02",
        "R03"
      ],
      "areaConnectivity": [],
      "areaConnectivityId": [],
      "npcs": [],
      "monsters": [
        {
          "name": "Blighted Bandit Remnants",
          "description": "Two dead bandits, risen as shambling husks by the woods’ dark power.",
          "type": "Undead",
          "number": "2 (use Zombie stats, but immune to poison and resistant to nonmagical slashing)"
        }
      ],
      "lootTable": [
        "Scorched Map Fragment (shows part of Northern Corrupted Woods, with a hidden symbol marking Gloomsap Cavern)",
        "Ranger’s Lucky Coin (can reroll a single failed Perception check, once)",
        "Ashen Bandit Mask (intimidation advantage once, but faintly cursed—draws minor attention from corrupted creatures)"
      ],
      "plotHooks": [
        "The map fragment points the party toward the Gloomsap Cavern and hints at a hidden cache.",
        "Remnants of correspondence describe strange dreams, a missing comrade, and a plea for help from a hermit deeper in the woods."
      ],
      "dmInstructions": "Use this as a somber place for investigation and rest—with risk. Searching the tents or firepit may disturb the undead. The scorched map is a clear clue, and the correspondence can spark further exploration.",
      "doors": [
        {
          "name": "Collapsed Shelter Door",
          "description": "A warped wooden door hanging by a single hinge on the largest shelter.",
          "type": "regular",
          "locked": false,
          "lockDC": 0,
          "breakDC": 8,
          "keyname": "",
          "trapped": false,
          "trap": ""
        }
      ],
      "traps": [],
      "dcChecks": [
        "Investigation DC 12: Locate the scorched map fragment beneath firepit ashes.",
        "Perception DC 10: Notice the odd fungal patterns on tent walls.",
        "History DC 12: Recall that the 'forsaken hearth' is a local name for lost ranger camps."
      ],
      "accessibility": "Overgrown but readily visible from nearby trails. Some structures at risk of collapse.",
      "dangerLevel": "High",
      "features": [
        {
          "name": "Dust",
          "description": "Thick gray dust covers every surface, swirling at the slightest movement."
        },
        {
          "name": "Interesting Architecture",
          "description": "Shelters are crafted from woven pine branches and river stones in geometric patterns."
        }
      ],
      "encounters": [
        "Disturbing the firepit or ruined shelters animates the undead bandits.",
        "Careful investigation yields clues and rest opportunities, but lingering risks further attacks."
      ],
      "adventureSummary": "A melancholy camp with clues to the corruption, opportunities for rest and discovery, and risks of undead attack."
    },
    {
      "locationId": "R05",
      "name": "Shrouded Sentinel Rise",
      "type": "hilltop",
      "description": "Atop a steep, moss-choked hill, ancient stones form a broken circle. The rise is perpetually wreathed in thin mist. From here, the whole of the Northern Corrupted Woods sprawls below, shrouded in gloom. The stones are etched with faded runes and black sap veins, and thick dust swirls at the center.",
      "coordinates": "X1Y1",
      "connectivity": [
        "R02"
      ],
      "areaConnectivity": [],
      "areaConnectivityId": [],
      "npcs": [],
      "monsters": [
        {
          "name": "Sap-Soaked Wisp",
          "description": "A small, flickering mass of ghostly light, trailing black sap. Drawn to magic and life, it seeks to drain vitality from the living.",
          "type": "Undead/Fey spirit",
          "number": "1 (use Will-o'-Wisp stats, poison damage instead of lightning)"
        }
      ],
      "lootTable": [
        "Runestone Fragment (can be matched with runes elsewhere to unlock a warding ritual)",
        "Old Ranger’s Spyglass (grants advantage on distant Perception checks)",
        "Packet of Ashen Moss (smoking it reveals brief glimpses of the woods’ history; minor one-use divination effect)"
      ],
      "plotHooks": [
        "The runestone fragment is part of a set needed to perform a ritual to contain or purge the corruption.",
        "Views from the rise allow the party to spot movement at both the Gloomsap Cavern and Forsaken Hearth Encampment (helpful for tracking or planning)."
      ],
      "dmInstructions": "This is a vantage point and a spiritual nexus. If the party conducts a ritual or spends an hour here, they may receive a vision or guidance from ancient spirits (or draw the attention of hostile ones). The wisp is drawn to magical activity and will become aggressive if disturbed.",
      "doors": [],
      "traps": [],
      "dcChecks": [
        "Arcana DC 13: Decipher the runes and identify their purpose.",
        "Perception DC 10: Notice faint tracks leading down toward Twisted Briar Grove.",
        "Religion DC 12: Sense the lingering presence of ancient warding magic, now mostly faded."
      ],
      "accessibility": "Steep, muddy climb; possible to slip or become winded, but no special equipment required.",
      "dangerLevel": "High",
      "features": [
        {
          "name": "Interesting Architecture",
          "description": "Broken stone circle etched with rune fragments, some now corrupted by black sap."
        },
        {
          "name": "Dust",
          "description": "A thick, almost silvery dust covers the summit and swirls in the mist."
        }
      ],
      "encounters": [
        "The sap-soaked wisp attacks if the party attempts to take the runestone or performs a potent ritual.",
        "Calling out to the spirits or studying the runes may grant brief visions or cryptic warnings."
      ],
      "adventureSummary": "A windswept hilltop offering strategic and mystical insights, a piece of a larger ritual, and a dangerous fey spirit."
    }
  ],
  "randomEncounters": [
    {
      "roll": "1-10",
      "encounter": "monster pack",
      "description": "A monster pack appropriate for level 2 parties"
    },
    {
      "roll": "11-20",
      "encounter": "enemy squad",
      "description": "A enemy squad appropriate for level 2 parties"
    },
    {
      "roll": "21-30",
      "encounter": "dangerous predator",
      "description": "A dangerous predator appropriate for level 2 parties"
    },
    {
      "roll": "31-40",
      "encounter": "enemy squad",
      "description": "A enemy squad appropriate for level 2 parties"
    },
    {
      "roll": "41-50",
      "encounter": "dangerous predator",
      "description": "A dangerous predator appropriate for level 2 parties"
    },
    {
      "roll": "51-60",
      "encounter": "monster pack",
      "description": "A monster pack appropriate for level 2 parties"
    }
  ],
  "areaFeatures": [
    "animal dens",
    "ancient trees",
    "rock formations"
  ],
  "notes": "Weather and terrain should affect travel times. Random encounters keep exploration tense."
}