{
  "areaId": "TW001",
  "areaName": "Thornwood Wilds",
  "areaType": "dungeon",
  "areaDescription": "Beneath a canopy of clawed branches, the Thornwood Wilds unravel in a maze of moss-choked corridors and root-latticed shadows, where the air hums with the restless stir of unseen wildlife and the faint, sweet rot of bruised berries underfoot. Subtle trails vanish beneath tangled underbrush, and each whispering gust carries the promise of both hidden passage and sudden peril.",
  "dangerLevel": "medium",
  "recommendedLevel": 1,
  "climate": "controlled - cool and damp",
  "terrain": "stone corridors and chambers",
  "map": {
    "mapId": "MAP_5",
    "mapName": "Dungeon Map",
    "totalRooms": 5,
    "rooms": [
      {
        "id": "R01",
        "type": "hall",
        "connections": [
          "R02",
          "R04"
        ],
        "coordinates": "X2Y2",
        "name": "Thorn-Root Gallery"
      },
      {
        "id": "R02",
        "type": "entrance",
        "connections": [
          "R01",
          "R03",
          "R05"
        ],
        "coordinates": "X3Y2",
        "name": "Brambleshade Approach"
      },
      {
        "id": "R03",
        "type": "treasure room",
        "connections": [
          "R02",
          "R04"
        ],
        "coordinates": "X3Y1",
        "name": "Bandit's Hidden Vault"
      },
      {
        "id": "R04",
        "type": "shrine",
        "connections": [
          "R01",
          "R03"
        ],
        "coordinates": "X2Y1",
        "name": "Shrine of the Gloaming Hunt"
      },
      {
        "id": "R05",
        "type": "corridor",
        "connections": [
          "R02"
        ],
        "coordinates": "X3Y3",
        "name": "Shadowbriar Corridor"
      }
    ],
    "layout": [
      [
        "R04",
        "R03"
      ],
      [
        "R01",
        "R02"
      ],
      [
        "   ",
        "R05"
      ]
    ]
  },
  "locations": [
    {
      "locationId": "R01",
      "name": "Thorn-Root Gallery",
      "type": "hall",
      "description": "A dim, vaulted corridor beneath tightly interwoven branches and roots. Pale sunlight patterns the mossy floor through small cracks above, while thick columns of twisted wood rise unevenly along the walls, their bark carved with old, faded symbols. In several alcoves, once-grand chandeliers woven from antlers and vines sway gently, hung with shattered bits of colored glass. The air is cool and damp, carrying the faint scent of bruised berries and leaf mold. Shadows pool in the high ceiling’s crags, and every sound echoes oddly in the gallery’s depths.",
      "coordinates": "X2Y2",
      "connectivity": [
        "R02",
        "R04"
      ],
      "areaConnectivity": [],
      "areaConnectivityId": [],
      "npcs": [
        {
          "name": "Wounded Scout Neris",
          "description": "A lightly armored half-elf scout slumped against a support column, her leg wrapped in a bloodied bandage. She is alert but exhausted, clutching her bow and whispering warnings about unseen dangers deeper in the wilds.",
          "attitude": "Cautious and grateful, but wary of sudden movements. She appreciates medical help and is willing to share information about the dangers ahead."
        }
      ],
      "monsters": [],
      "lootTable": [
        "Scout’s Satchel (contains a partially completed Thornwood map, 2 healing potions, and a silver whistle)",
        "Pouch of trail rations",
        "Elven carving knife (minor sentimental value)"
      ],
      "plotHooks": [
        "Scout Neris warns of a bandit presence deeper in the Wilds and mentions strange, corrupted wildlife stalking the shrine.",
        "She offers to point out a hidden shortcut if aided."
      ],
      "dmInstructions": "Wounded Scout Neris is hiding and may not reveal herself unless the party is quiet or calls out. A successful DC 11 Wisdom (Perception) or DC 13 Wisdom (Survival) check spots her hiding or her subtle signs (blood, scuffed earth). She is too hurt to proceed, but her intel is valuable.",
      "doors": [
        {
          "name": "West Gallery Door",
          "description": "A thick, root-wrapped wooden door engraved with faded leaf patterns.",
          "type": "regular",
          "locked": false,
          "lockDC": 0,
          "breakDC": 13,
          "keyname": "",
          "trapped": false,
          "trap": ""
        },
        {
          "name": "East Gallery Door",
          "description": "A battered wooden door flanked by brambles. The bottom edge is notched as if gnawed.",
          "type": "regular",
          "locked": false,
          "lockDC": 0,
          "breakDC": 10,
          "keyname": "",
          "trapped": false,
          "trap": ""
        }
      ],
      "traps": [],
      "dcChecks": [
        "Medicine DC 12: Properly treat Neris's wound, gaining her gratitude and a map fragment.",
        "Perception DC 11: Notice dried blood and drag marks leading to the alcove.",
        "Investigation DC 10: Discover a concealed compartment in one support column (contains 1 healing potion)."
      ],
      "accessibility": "Normal access from adjoining corridors; the uneven floor and scattered roots slow movement.",
      "dangerLevel": "Medium",
      "features": [
        {
          "name": "Support Columns",
          "description": "Thick natural wood columns, carved with faded symbols and hollowed alcoves."
        },
        {
          "name": "Chandeliers",
          "description": "Shattered chandeliers made of antlers and vines, some still holding faintly glowing moss."
        },
        {
          "name": "High Ceiling",
          "description": "A vaulted, root-webbed ceiling where shadows gather and faint animal sounds echo."
        }
      ],
      "encounters": [],
      "adventureSummary": "Serves as a transitional zone, a place for the party to gather information from Scout Neris, patch wounds, and prepare for deeper threats."
    },
    {
      "locationId": "R02",
      "name": "Brambleshade Approach",
      "type": "entrance",
      "description": "An overgrown arch of tangled brambles, their thorns forming a narrow, twisting passage into the heart of Thornwood. The ground here is churned, showing fresh tracks and a faint trail of dropped coins. Shafts of dappled light flicker through the thick leaves, illuminating a cleverly hidden opening in the thicket that leads to a side path. The air is thick with the buzz of insects and an uncanny, watchful silence.",
      "coordinates": "X3Y2",
      "connectivity": [
        "R01",
        "R03",
        "R05"
      ],
      "areaConnectivity": [],
      "areaConnectivityId": [],
      "npcs": [],
      "monsters": [
        {
          "name": "Corrupted Woodland Creatures",
          "description": "A pair of twisted foxes with unnatural, fungal growths and glowing eyes, lurking in the brush. They defend their lair aggressively.",
          "attitude": "Hostile; attack anything that threatens their territory or disturbs their nest."
        }
      ],
      "lootTable": [
        "Bundle of tangled coins (12 silver, 8 copper)",
        "Blackened fox pelt (strange, but valuable to certain collectors)",
        "Small vial of fungal spores (potential alchemical ingredient)"
      ],
      "plotHooks": [
        "Tracks indicate someone was dragged deeper into the Wilds.",
        "The corrupted creatures are not native: a DC 12 Nature check reveals unnatural malice at work."
      ],
      "dmInstructions": "A skirmish with the corrupted foxes signals to the party that not all is right in Thornwood. Their mutations offer clues to the Wilds’ corruption. The hidden opening (DC 13 Investigation) allows the party to bypass some hazards, leading to a quicker route to the Bandit's Vault.",
      "doors": [
        {
          "name": "Brambleshade Gate",
          "description": "A living curtain of vines and brambles with a barely perceptible gap.",
          "type": "regular",
          "locked": false,
          "lockDC": 0,
          "breakDC": 12,
          "keyname": "",
          "trapped": false,
          "trap": ""
        },
        {
          "name": "Hidden Opening",
          "description": "A cleverly concealed gap in the underbrush, just wide enough for a person to squeeze through.",
          "type": "secret",
          "locked": false,
          "lockDC": 0,
          "breakDC": 14,
          "keyname": "",
          "trapped": false,
          "trap": ""
        }
      ],
      "traps": [],
      "dcChecks": [
        "Survival DC 11: Follow tracks deeper into the wilds.",
        "Nature DC 12: Identify corruption in creature remains.",
        "Investigation DC 13: Locate the hidden side opening."
      ],
      "accessibility": "Narrow, thorny passageways slow progress and can snag clothing, but no special impediments beyond the natural hazards.",
      "dangerLevel": "Medium",
      "features": [
        {
          "name": "Narrow Passage",
          "description": "A winding, thorn-walled trail barely wide enough for single file movement."
        },
        {
          "name": "Hidden Opening",
          "description": "A disguised side path, obscured by brambles and leaf litter."
        }
      ],
      "encounters": [
        {
          "type": "Combat",
          "description": "Corrupted foxes ambush intruders, using the underbrush for cover."
        }
      ],
      "adventureSummary": "The first true danger in the Wilds, setting the tone for the supernatural threats to come and rewarding players who investigate carefully."
    },
    {
      "locationId": "R03",
      "name": "Bandit's Hidden Vault",
      "type": "treasure room",
      "description": "A cramped, root-cracked chamber with moldy sacks and scattered chests. Dust hangs thick in the air, lit by a single shaft of sunlight from a hole in the ceiling. The remnants of bandit occupation are everywhere: a broken camp stove, discarded boots, bloodstains, and a crude map scrawled on the wall. In one corner, a battered iron-bound chest sits atop a layer of old furs.",
      "coordinates": "X3Y1",
      "connectivity": [
        "R02",
        "R04"
      ],
      "areaConnectivity": [],
      "areaConnectivityId": [],
      "npcs": [
        {
          "name": "Rescued Merchant Lira",
          "description": "A middle-aged human merchant, bound and gagged but alert, locked in the vault as ransom. She is quick-witted, dressed in now-tattered merchant garb.",
          "attitude": "Relieved but cautious. Extremely grateful to rescuers, she offers trade goods and information about recent bandit movements if freed."
        }
      ],
      "monsters": [],
      "lootTable": [
        "Ironbound chest (locked): 25 gold pieces, 2 small gems, and a set of thieves’ tools",
        "Merchant’s strongbox (locked): merchant documents, a silver brooch, trade ledgers",
        "Bandit’s stash: 1 healing potion, set of loaded dice, flask of oil"
      ],
      "plotHooks": [
        "Lira knows the bandits were spooked by something in the shrine, fleeing in a hurry.",
        "A crude map on the wall points toward the Shrine of the Gloaming Hunt."
      ],
      "dmInstructions": "Lira is tied up but unharmed; the locks on the chests can be picked. If questioned, she describes bandit talk of a 'spirit in the old shrine.' Footprints indicate some bandits fled toward the Shadowbriar Corridor.",
      "doors": [
        {
          "name": "Vault Door",
          "description": "A reinforced wooden door with rusted iron bands and a sturdy latch.",
          "type": "heavy",
          "locked": true,
          "lockDC": 15,
          "breakDC": 17,
          "keyname": "Bandit’s Vault Key",
          "trapped": false,
          "trap": ""
        }
      ],
      "traps": [],
      "dcChecks": [
        "Sleight of Hand DC 15: Pick the vault door’s lock.",
        "Perception DC 13: Notice a loose stone concealing a small pouch (holds 10 silver).",
        "Insight DC 10: Lira is trustworthy and eager to help if freed."
      ],
      "accessibility": "Accessible only via locked door; the chest and strongbox also require lockpicking or keys.",
      "dangerLevel": "Medium",
      "features": [
        {
          "name": "Interesting Architecture",
          "description": "Root-cracked walls, ceiling partially collapsed, giving a view of the forest above."
        },
        {
          "name": "Signs Of Age",
          "description": "Moss growing on ancient stones, and weathered, crumbling crates."
        },
        {
          "name": "Dust",
          "description": "Thick, undisturbed dust except where the merchant and bandits struggled."
        }
      ],
      "encounters": [
        {
          "type": "Roleplay/Rescue",
          "description": "Rescuing Merchant Lira, learning about the bandits’ flight and the shrine’s dangers."
        }
      ],
      "adventureSummary": "A rewarding exploration site with clues about both mundane and supernatural threats, and a grateful rescuee who can provide further aid."
    },
    {
      "locationId": "R04",
      "name": "Shrine of the Gloaming Hunt",
      "type": "shrine",
      "description": "A shadow-laced chamber dominated by a rough-hewn altar of dark stone, encircled by roots and crowned with antlers. Ancient religious symbols, half-consumed by moss and lichen, decorate the walls. The air vibrates with a faint, unearthly energy. A pressure plate is set before the altar, camouflaged by fallen leaves and twigs. Flickers of movement play at the edge of vision, and the whole room has a reverent, yet haunted, stillness.",
      "coordinates": "X2Y1",
      "connectivity": [
        "R01",
        "R03"
      ],
      "areaConnectivity": [],
      "areaConnectivityId": [],
      "npcs": [
        {
          "name": "Spirit-Touched Hermit Maelo",
          "description": "A gaunt, wild-eyed human hermit clad in ragged furs, standing near the altar and mumbling prayers. He has an unmistakable air of otherworldly connection, his voice echoing with strange resonance.",
          "attitude": "Cryptic and uneasy, driven by visions. Will warn the party of the forest’s corruption and the approach of the Withered Hart. May aid those who show respect for the shrine."
        }
      ],
      "monsters": [
        {
          "name": "The Withered Hart",
          "description": "A spectral, antlered stag with tattered hide and ghostly eyes, haunting the shrine’s shadows. It appears if the altar is disturbed or if Maelo is threatened.",
          "attitude": "Fiercely protective of the shrine; confronts intruders who dishonor its sanctity."
        }
      ],
      "lootTable": [
        "Ceremonial antler circlet (worth 15 gp)",
        "Old prayer book (contains clues about the forest’s corruption)",
        "Vial of sanctified water"
      ],
      "plotHooks": [
        "Maelo warns of a spreading corruption and hints at a hidden passage beneath the roots.",
        "Clues on the altar describe a ritual that may pacify or repel the forest’s curse."
      ],
      "dmInstructions": "If the party disturbs the altar or threatens Maelo, The Withered Hart manifests and attacks. Maelo can offer cryptic guidance, describe what he’s seen of the bandits and the corrupted creatures, and suggest a ritual for cleansing.",
      "doors": [
        {
          "name": "Shrine Door",
          "description": "A plain wooden door, slightly warped by damp, marked with faded religious symbols.",
          "type": "regular",
          "locked": false,
          "lockDC": 0,
          "breakDC": 11,
          "keyname": "",
          "trapped": false,
          "trap": ""
        }
      ],
      "traps": [
        {
          "name": "Simple Pressure Plate",
          "description": "A hidden pressure plate camouflaged by leaves; steps on it trigger concealed spikes.",
          "detectDC": 13,
          "disableDC": 15,
          "triggerDC": 12,
          "damage": "1d6 piercing damage from hidden spikes"
        }
      ],
      "dcChecks": [
        "Religion DC 12: Interpret the altar’s runes and ritual clues.",
        "Perception DC 13: Detect the hidden pressure plate before the altar.",
        "Persuasion DC 11: Calm Maelo and gain his help."
      ],
      "accessibility": "Normal access from adjoining areas; the pressure plate trap may impede careless intruders.",
      "dangerLevel": "Medium",
      "features": [
        {
          "name": "Altar",
          "description": "A rough-hewn, antler-crowned altar of black stone, etched with ancient runes."
        },
        {
          "name": "Religious Symbols",
          "description": "Moss-covered animal motifs and ritual markings adorn the walls."
        }
      ],
      "encounters": [
        {
          "type": "Social/Combat",
          "description": "Maelo may be reasoned with, but disturbing the altar or acting aggressively triggers a fight with The Withered Hart."
        }
      ],
      "adventureSummary": "The spiritual heart of the Wilds, featuring an opportunity for parley, revelation, and a potentially dramatic confrontation with the guardian spirit."
    },
    {
      "locationId": "R05",
      "name": "Shadowbriar Corridor",
      "type": "corridor",
      "description": "A narrow, winding corridor split by jagged cracks and overgrown with spiny briars. The walls are slick with moisture and faint sounds echo—a distant animal call, or the snap of a twig—from deeper passages. Old sconces are set into the walls, some still holding guttering, mossy candles. The floor is uneven, forcing travelers to step carefully.",
      "coordinates": "X3Y3",
      "connectivity": [
        "R02"
      ],
      "areaConnectivity": [],
      "areaConnectivityId": [],
      "npcs": [],
      "monsters": [],
      "lootTable": [
        "Crumpled bandit note (mentions shrine and vault)",
        "Set of old iron keys (fit the Vault Door, among others)",
        "Bundle of dried herbs (minor healing properties)"
      ],
      "plotHooks": [
        "The note hints at a secret path near the altar in the shrine.",
        "Keys offer easier access to the vault for less stealthy parties."
      ],
      "dmInstructions": "This corridor may be used as a fallback route by fleeing bandits. Perceptive characters can gather clues to the bandit's passage and the locations of hidden doors.",
      "doors": [
        {
          "name": "Corridor Entry",
          "description": "A simple, bramble-choked wooden door hanging loosely on its hinges.",
          "type": "regular",
          "locked": false,
          "lockDC": 0,
          "breakDC": 10,
          "keyname": "",
          "trapped": false,
          "trap": ""
        }
      ],
      "traps": [],
      "dcChecks": [
        "Investigation DC 10: Find the crumpled note wedged in a crack.",
        "Perception DC 11: Hear faint movement (can foreshadow encounters in adjacent areas)."
      ],
      "accessibility": "Normal access, but uneven footing and thick undergrowth make fast movement difficult.",
      "dangerLevel": "Medium",
      "features": [
        {
          "name": "Echoing Sound",
          "description": "Sounds carry oddly, sometimes amplifying distant movements."
        },
        {
          "name": "Cracks In Walls",
          "description": "Deep fissures expose tangled roots and sometimes hide clues or lost objects."
        },
        {
          "name": "Sconces",
          "description": "Old iron sconces, some with mossy candles providing faint light."
        }
      ],
      "encounters": [],
      "adventureSummary": "A transitional space rich with clues and minor loot, allowing for regrouping or stealthy approaches to other chambers."
    }
  ],
  "randomEncounters": [
    {
      "roll": "1-10",
      "encounter": "hostile creature",
      "description": "A hostile creature appropriate for level 1 parties"
    },
    {
      "roll": "11-20",
      "encounter": "territorial beast",
      "description": "A territorial beast appropriate for level 1 parties"
    },
    {
      "roll": "21-30",
      "encounter": "hostile creature",
      "description": "A hostile creature appropriate for level 1 parties"
    },
    {
      "roll": "31-40",
      "encounter": "territorial beast",
      "description": "A territorial beast appropriate for level 1 parties"
    },
    {
      "roll": "41-50",
      "encounter": "territorial beast",
      "description": "A territorial beast appropriate for level 1 parties"
    },
    {
      "roll": "51-60",
      "encounter": "bandit patrol",
      "description": "A bandit patrol appropriate for level 1 parties"
    }
  ],
  "areaFeatures": [
    "ancient murals",
    "mysterious mechanisms",
    "forgotten shrines"
  ],
  "notes": "Consider lighting sources and trap placement. Underground areas may have limited resources."
}