{
  "areaId": "MRV001",
  "areaName": "Marrow's Rest Village",
  "areaType": "town",
  "areaDescription": "Mist curls between weathered gravestones and thatched rooftops in Marrow's Rest Village, where evenings carry the faint, comforting scent of peat fires and the rhythmic chime of bone wind-clatters hung by superstitious hands. Villagers swap tales beneath creaking lanterns, casting long shadows that twist across cobbled lanes, their laughter mingling with the soft hush of the marsh beyond.",
  "dangerLevel": "low",
  "recommendedLevel": 4,
  "climate": "temperate",
  "terrain": "urban streets and buildings",
  "map": {
    "mapId": "MAP_6",
    "mapName": "Town Map",
    "totalRooms": 6,
    "rooms": [
      {
        "id": "AD01",
        "type": "tavern",
        "connections": [
          "AD02",
          "AD06"
        ],
        "coordinates": "X2Y2",
        "name": "The Black Lantern Hearth"
      },
      {
        "id": "AD02",
        "type": "barracks",
        "connections": [
          "AD01",
          "AD03",
          "AD05"
        ],
        "coordinates": "X2Y1",
        "name": "Shroudwatch Garrison"
      },
      {
        "id": "AD03",
        "type": "barracks",
        "connections": [
          "AD02",
          "AD04"
        ],
        "coordinates": "X2Y0",
        "name": "Salt-Scoured Bunks"
      },
      {
        "id": "AD04",
        "type": "barracks",
        "connections": [
          "AD03",
          "AD05"
        ],
        "coordinates": "X3Y0",
        "name": "Drowned Warden Quarters"
      },
      {
        "id": "AD05",
        "type": "temple",
        "connections": [
          "AD02",
          "AD04",
          "AD06"
        ],
        "coordinates": "X3Y1",
        "name": "Sanctum of Sable Flames"
      },
      {
        "id": "AD06",
        "type": "gate",
        "connections": [
          "AD01",
          "AD05"
        ],
        "coordinates": "X3Y2",
        "name": "Tideworn Gate"
      }
    ],
    "layout": [
      [
        "AD03",
        "AD04"
      ],
      [
        "AD02",
        "AD05"
      ],
      [
        "AD01",
        "AD06"
      ]
    ]
  },
  "locations": [
    {
      "locationId": "AD01",
      "name": "The Black Lantern Hearth",
      "type": "tavern",
      "description": "The heart of Marrow's Rest Village, this peat-scented tavern glows with the warmth of a black-iron hearth. Bone wind-chimes dangle above the low beams, and dog-eared tables crowd beneath the glow of smoky lanterns. The atmosphere is lively by dusk, as villagers gather to swap tales and drown their worries in briny ale.",
      "coordinates": "X2Y2",
      "connectivity": [
        "AD02",
        "AD06"
      ],
      "areaConnectivity": [
        "Sanctum of Silent Kings"
      ],
      "areaConnectivityId": [
        "Z06"
      ],
      "npcs": [
        {
          "name": "Elder Dorun, wary village leader",
          "description": "An aging, canny figure with a measured gaze and salt-and-pepper beard, Dorun presides over village matters and often sits in a corner booth, listening more than speaking.",
          "attitude": "Cautiously welcoming, protective of villagers and suspicious of outsiders."
        },
        {
          "name": "Captain Merek, a traumatized shipwreck survivor",
          "description": "A gaunt, wild-eyed man clutching a flask, Merek's haunted stories draw uneasy attention from the regulars.",
          "attitude": "Jumpy, fatalistic, eager to warn newcomers of the sea's unnatural dangers."
        }
      ],
      "monsters": [],
      "lootTable": [
        "Silver tankard engraved with a faded lighthouse motif (10 gp)",
        "Set of bone-carved dice (3 gp)",
        "Small pouch containing 15 sp and a lucky hagstone"
      ],
      "plotHooks": [
        "Captain Merek raves about lights seen at the ruined abbey and ships lost to the black flame.",
        "Elder Dorun discreetly seeks help investigating disappearances near the marsh."
      ],
      "dmInstructions": "The Black Lantern Hearth is both a social hub and the best place for the party to gather rumors. Players can meet Elder Dorun for village introductions, and Captain Merek for cryptic warnings. Keep the mood welcoming but tinged with unease. Some villagers may subtly test the party's intentions.",
      "doors": [
        {
          "name": "Main Entrance",
          "description": "Heavy oak door, scratched by years of salt air, iron-bound with a carved lantern sigil.",
          "type": "regular",
          "locked": false,
          "lockDC": 0,
          "breakDC": 15,
          "keyname": "",
          "trapped": false,
          "trap": ""
        },
        {
          "name": "Cellar Hatch",
          "description": "A low wooden hatch behind the bar, often bolted from the inside.",
          "type": "regular",
          "locked": true,
          "lockDC": 13,
          "breakDC": 14,
          "keyname": "Tavern Cellar Key",
          "trapped": false,
          "trap": ""
        }
      ],
      "traps": [],
      "dcChecks": [
        "Insight DC 13: Notice that Elder Dorun is hiding deeper concerns.",
        "Perception DC 12: Spot a faded map of the coast tacked behind the bar."
      ],
      "accessibility": "Normal access via the main street. Cellar hatch is usually kept locked.",
      "dangerLevel": "Low",
      "features": [
        {
          "name": "Tables And Chairs",
          "description": "Rough-hewn tables and mismatched chairs, each scratched with initials, local runes, and old stains."
        },
        {
          "name": "Hearth",
          "description": "A deep, soot-blackened hearth, above which hangs a cracked ship's bell and bundles of drying marsh herbs."
        },
        {
          "name": "Bar Counter",
          "description": "Sturdy plank counter lined with worn flagons and a row of bottles, some with mysterious floating objects."
        },
        {
          "name": "Bone Wind-Chimes",
          "description": "Dangling over the entrance, these softly clattering charms are said to keep away restless spirits."
        }
      ],
      "encounters": [],
      "adventureSummary": "A place to gather rumors, meet key NPCs, and pick up early hooks about the curse or disappearances."
    },
    {
      "locationId": "AD02",
      "name": "Shroudwatch Garrison",
      "type": "barracks",
      "description": "This squat stone building sits near the edge of the central square, its walls blackened by ancient fires. Weapons and battered shields hang from hooks, and a brittle air of vigilance lingers among the bunks and drill-yard.",
      "coordinates": "X2Y1",
      "connectivity": [
        "AD01",
        "AD03",
        "AD05"
      ],
      "areaConnectivity": [],
      "areaConnectivityId": [],
      "npcs": [
        {
          "name": "Brother Lintar, a desperate cultist acolyte",
          "description": "Sallow-faced and twitchy, Lintar wears the uniform of a watchman but clutches a hidden prayer token, eyes darting nervously with guilt and fear.",
          "attitude": "Secretive, anxious, and liable to slip away if threatened."
        }
      ],
      "monsters": [],
      "lootTable": [
        "Bundle of serviceable spears and short swords",
        "Tarnished badge bearing the village crest (2 gp)",
        "Hidden pouch containing cultist prayer beads"
      ],
      "plotHooks": [
        "Brother Lintar can be persuaded to reveal what he knows about strange goings-on, but seems torn between loyalty and terror.",
        "Old records in a locked cabinet hint at disturbances near the abbey ruins."
      ],
      "dmInstructions": "Brother Lintar is present most evenings, trying to appear useful to the town guard while secretly serving the cult. If the party investigates, a DC 13 Insight or Perception check may reveal his agitation. Lintar may offer information in return for protection.",
      "doors": [
        {
          "name": "Front Door",
          "description": "Reinforced wooden door with a faded shield sigil.",
          "type": "regular",
          "locked": false,
          "lockDC": 0,
          "breakDC": 15,
          "keyname": "",
          "trapped": false,
          "trap": ""
        },
        {
          "name": "Armory Closet",
          "description": "Narrow iron-bound door, locked and marked with a warning rune.",
          "type": "regular",
          "locked": true,
          "lockDC": 14,
          "breakDC": 16,
          "keyname": "Garrison Armory Key",
          "trapped": false,
          "trap": ""
        }
      ],
      "traps": [],
      "dcChecks": [
        "Investigation DC 14: Find hidden cultist paraphernalia in Lintar's footlocker.",
        "Insight DC 13: Notice Lintar's furtive glances and nervousness."
      ],
      "accessibility": "Normal access; armory is kept locked and only senior staff have keys.",
      "dangerLevel": "Low",
      "features": [
        {
          "name": "Dust",
          "description": "Pervasive film of dust covers less-used weapons and unused bunks, hinting at diminished numbers."
        },
        {
          "name": "Training Yard",
          "description": "A patch of muddy ground behind the barracks, with straw dummies and battered targets."
        },
        {
          "name": "Notice Board",
          "description": "Wooden board displaying patrol rosters, faded sketches of missing villagers, and scribbled warnings."
        }
      ],
      "encounters": [],
      "adventureSummary": "A source of local defense and gossip; holds a cultist NPC with knowledge of the curse."
    },
    {
      "locationId": "AD03",
      "name": "Salt-Scoured Bunks",
      "type": "barracks",
      "description": "Low, timbered ceilings and warped wooden floors give this sleeping hall its nickname. The briny tang of coastal air is ever-present, and the bunks creak with the weight of long, sleepless nights.",
      "coordinates": "X2Y0",
      "connectivity": [
        "AD02",
        "AD04"
      ],
      "areaConnectivity": [],
      "areaConnectivityId": [],
      "npcs": [],
      "monsters": [],
      "lootTable": [
        "Waterproofed sailor's cloak (4 gp)",
        "Small wooden box of sea salt and dried kelp",
        "Bundle of letters describing eerie dreams"
      ],
      "plotHooks": [
        "A stash of letters from villagers describes nightmares of drowning and black flames.",
        "A careful search uncovers a symbol matching that in the abbey's stained glass."
      ],
      "dmInstructions": "This is a resting place for the town's guards and a good spot for the party to overhear snatches of gossip or notice patterns in the villagers' shared dreams. Opportunity for investigation and clue gathering.",
      "doors": [
        {
          "name": "Main Hall Door",
          "description": "Simple plank door, slightly warped and sticks in the frame.",
          "type": "regular",
          "locked": false,
          "lockDC": 0,
          "breakDC": 12,
          "keyname": "",
          "trapped": false,
          "trap": ""
        }
      ],
      "traps": [],
      "dcChecks": [
        "Perception DC 12: Notice recurring symbols woven into blankets.",
        "Investigation DC 13: Find a hidden compartment under a bunk."
      ],
      "accessibility": "Normal access; rarely locked and easily entered during village hours.",
      "dangerLevel": "Low",
      "features": [
        {
          "name": "Interesting Architecture",
          "description": "Ceiling beams carved with old mariner runes to ward off nightmares."
        },
        {
          "name": "Dust",
          "description": "Fine salt dust everywhere, especially in corners and under beds."
        }
      ],
      "encounters": [],
      "adventureSummary": "A place for investigation and uncovering subtle clues about the curse's psychological effects."
    },
    {
      "locationId": "AD04",
      "name": "Drowned Warden Quarters",
      "type": "barracks",
      "description": "This somber, stone-walled chamber is adorned with faded banners and polished shells. A shrine to lost wardens occupies one corner, and the air feels thick with unspoken grief.",
      "coordinates": "X3Y0",
      "connectivity": [
        "AD03",
        "AD05"
      ],
      "areaConnectivity": [],
      "areaConnectivityId": [],
      "npcs": [
        {
          "name": "Echoes of lost villagers (restless spirits)",
          "description": "Wispy, sorrowful apparitions linger near the shrine, sometimes glimpsed in the corner of the eye or heard whispering old prayers.",
          "attitude": "Melancholy, yearning for closure, not overtly hostile unless disturbed."
        }
      ],
      "monsters": [
        {
          "name": "Restless Spirit",
          "type": "undead",
          "description": "Spectral remnants of drowned villagers, flickering with faint blue phosphorescence.",
          "quantity": 1
        }
      ],
      "lootTable": [
        "Warden's signet ring (8 gp)",
        "Scrap of parchment with a riddle about the abbey",
        "Small shell reliquary containing a dried flower"
      ],
      "plotHooks": [
        "The spirits can be communicated with by those offering respectful prayers (Religion DC 13); they warn of a 'dark tide rising'.",
        "A riddle left on a scrap of parchment hints at a secret beneath the abbey ruins."
      ],
      "dmInstructions": "If the shrine is respected, the spirits may offer guidance on the curse or mention Mira Tidewise. If disturbed, they may attempt to frighten or ward off the party.",
      "doors": [
        {
          "name": "Shrine Door",
          "description": "An old, whitewashed door adorned with shell inlays.",
          "type": "regular",
          "locked": false,
          "lockDC": 0,
          "breakDC": 12,
          "keyname": "",
          "trapped": false,
          "trap": ""
        }
      ],
      "traps": [],
      "dcChecks": [
        "Religion DC 13: Appease the spirits for information.",
        "Perception DC 12: Notice cold spots and faint whispers."
      ],
      "accessibility": "Normal access, though the air grows colder near the shrine.",
      "dangerLevel": "Low",
      "features": [
        {
          "name": "Dust",
          "description": "Dust motes drift slowly in the faint light, disturbed only by the restless spirits."
        },
        {
          "name": "Interesting Architecture",
          "description": "Stone arches carved with abstract wave patterns and ancient warding sigils."
        },
        {
          "name": "Shrine of the Wardens",
          "description": "A modest altar to those lost at sea, decorated with shells and flickering candles."
        }
      ],
      "encounters": [
        {
          "name": "Spirit Manifestation",
          "description": "Echoes of lost villagers coalesce if the shrine is disturbed or a hostile act is committed."
        }
      ],
      "adventureSummary": "Exploration and roleplay with the spirits can provide warnings, guidance, or a minor haunting encounter."
    },
    {
      "locationId": "AD05",
      "name": "Sanctum of Sable Flames",
      "type": "temple",
      "description": "This looming, candle-lit sanctuary is devoted to sea and flame. Black candles flicker in alcoves, and the altar is draped with weathered nets. The air is thick with incense and whispered prayers.",
      "coordinates": "X3Y1",
      "connectivity": [
        "AD02",
        "AD04",
        "AD06"
      ],
      "areaConnectivity": [],
      "areaConnectivityId": [],
      "npcs": [
        {
          "name": "Sister Hela, the abbey's last remaining priestess",
          "description": "A gaunt woman in sea-blue vestments, Sister Hela tends the altar and offers comfort to the fearful, her voice trembling with suppressed dread.",
          "attitude": "Gravely kind, desperate to keep hope alive but clearly anxious about her failing faith."
        }
      ],
      "monsters": [],
      "lootTable": [
        "Vial of sanctified salt (acts as holy water)",
        "Prayer book with cryptic marginalia about the black flame",
        "Bundle of black ritual candles"
      ],
      "plotHooks": [
        "Sister Hela requests help finding Abbess Miralda, last seen near the lighthouse.",
        "A cryptic passage in the prayer book alludes to a hidden chamber beneath the abbey."
      ],
      "dmInstructions": "Sister Hela is a source of blessings and critical guidance. She may grant the party a token of protection or a cryptic prophecy. If pressed, she hints at her own doubts and deep worries about the spiritual rot afflicting the village.",
      "doors": [
        {
          "name": "Front Sanctuary Door",
          "description": "Tall double doors carved with wave and flame motifs.",
          "type": "heavy",
          "locked": false,
          "lockDC": 0,
          "breakDC": 17,
          "keyname": "",
          "trapped": false,
          "trap": ""
        },
        {
          "name": "Altar Trapdoor",
          "description": "A cleverly concealed trapdoor beneath a tattered altar cloth.",
          "type": "secret",
          "locked": true,
          "lockDC": 16,
          "breakDC": 18,
          "keyname": "Sanctum Trapdoor Key",
          "trapped": false,
          "trap": ""
        }
      ],
      "traps": [],
      "dcChecks": [
        "Religion DC 14: Decipher the ritual inscriptions on the altar.",
        "Investigation DC 15: Discover the secret trapdoor beneath the altar."
      ],
      "accessibility": "Normal access; the sanctuary is always open to villagers, but the altar trapdoor is well hidden.",
      "dangerLevel": "Low",
      "features": [
        {
          "name": "Offering Space",
          "description": "An alcove filled with tokens and offerings for the sea's favor: shells, coins, and tiny boats."
        },
        {
          "name": "Religious Symbols",
          "description": "Painted murals show a lighthouse wreathed in black flame, and a goddess calming tumultuous waves."
        },
        {
          "name": "Ritual Candles",
          "description": "Numerous black candles, some burned down to stubs, drip wax onto the stone floor."
        }
      ],
      "encounters": [],
      "adventureSummary": "A source of spiritual aid, lore, and a potential secret entrance to further adventure."
    },
    {
      "locationId": "AD06",
      "name": "Tideworn Gate",
      "type": "gate",
      "description": "This ancient, barnacle-studded gateway marks the village's outermost edge, its arch inscribed with faded blessings. Beyond lie the marshes and the winding road to distant ruins.",
      "coordinates": "X3Y2",
      "connectivity": [
        "AD01",
        "AD05"
      ],
      "areaConnectivity": [
        "Abbey Ruins & Lighthouse"
      ],
      "areaConnectivityId": [
        "ARL001"
      ],
      "npcs": [
        {
          "name": "Finn Caster, a superstitious fisherman",
          "description": "A weathered, wiry man with an ever-present bundle of charms and amulets, Finn keeps watch for ill omens and warns travelers of the marsh's dangers.",
          "attitude": "Nervous, talkative, eager to make pacts for luck and protection."
        }
      ],
      "monsters": [],
      "lootTable": [
        "Pouch of lucky charms (driftwood, hagstones, teeth)",
        "Worn fishing net (2 gp)",
        "Crude map showing safe paths through the marsh"
      ],
      "plotHooks": [
        "Finn offers to guide the party toward the abbey ruins, but warns of 'bone-bitten' spirits at night.",
        "Strange footprints near the gate suggest something crossed from the marsh recently."
      ],
      "dmInstructions": "Finn is the last villager the party encounters before leaving for the marsh or ruins. He can provide maps, guidance, and warnings about local dangers. Players may overhear villagers discussing disappearances from near this gate.",
      "doors": [
        {
          "name": "Iron Grate",
          "description": "Rusty iron portcullis, heavy but usually raised except during storms.",
          "type": "heavy",
          "locked": true,
          "lockDC": 14,
          "breakDC": 20,
          "keyname": "Gatekeeper's Lever",
          "trapped": false,
          "trap": ""
        }
      ],
      "traps": [],
      "dcChecks": [
        "Survival DC 13: Follow recent tracks into the marsh.",
        "Perception DC 12: Notice Finn's lucky charms twitch when spirits are near."
      ],
      "accessibility": "Normal access in fair weather; during storms or at night, the gate may be locked and watched.",
      "dangerLevel": "Low",
      "features": [
        {
          "name": "Signs Of Age",
          "description": "Stone pillars are deeply pitted by wind and salt, and barnacles cluster in the cracks."
        },
        {
          "name": "Interesting Architecture",
          "description": "Ancient carvings depict the founding of Marrow's Rest and legendary mariners."
        },
        {
          "name": "Charms and Amulets",
          "description": "Dozens of charms dangle from the gate, left by villagers for protection."
        }
      ],
      "encounters": [],
      "adventureSummary": "The threshold to the wild beyond; a place to gather final warnings, supplies, or a guide before venturing into danger."
    }
  ],
  "randomEncounters": [
    {
      "roll": "1-10",
      "encounter": "environmental hazard",
      "description": "A environmental hazard appropriate for level 4 parties"
    },
    {
      "roll": "11-20",
      "encounter": "lost traveler",
      "description": "A lost traveler appropriate for level 4 parties"
    },
    {
      "roll": "21-30",
      "encounter": "environmental hazard",
      "description": "A environmental hazard appropriate for level 4 parties"
    },
    {
      "roll": "31-40",
      "encounter": "wandering animal",
      "description": "A wandering animal appropriate for level 4 parties"
    },
    {
      "roll": "41-50",
      "encounter": "environmental hazard",
      "description": "A environmental hazard appropriate for level 4 parties"
    },
    {
      "roll": "51-60",
      "encounter": "lost traveler",
      "description": "A lost traveler appropriate for level 4 parties"
    },
    {
      "roll": "61-70",
      "encounter": "wandering animal",
      "description": "A wandering animal appropriate for level 4 parties"
    },
    {
      "roll": "71-80",
      "encounter": "environmental hazard",
      "description": "A environmental hazard appropriate for level 4 parties"
    },
    {
      "roll": "81-90",
      "encounter": "wandering animal",
      "description": "A wandering animal appropriate for level 4 parties"
    }
  ],
  "areaFeatures": [
    "guard posts",
    "market square",
    "local tavern"
  ],
  "notes": "NPCs should have daily routines. Political factions create roleplay opportunities."
}