{
  "moduleName": "Keep of Doom",
  "moduleDescription": "Adventurers must brave a haunted keep to confront a cursed knight and a sinister artifact, risking supernatural doom or unleashing darkness upon the land.",
  "moduleMetadata": {
    "author": "DM Assistant",
    "version": "1.0.0",
    "levelRange": {
      "min": 1,
      "max": 3
    },
    "estimatedPlayTime": "4-6 sessions",
    "moduleType": "adventure",
    "_srd_attribution": "Portions derived from SRD 5.2.1, CC BY 4.0"
  },
  "mainPlot": {
    "mainObjective": "Uncover the truth behind the cursed noble and the malevolent artifact haunting the keep, then decide whether to destroy the artifact—risking catastrophic magical backlash—or bind its power, shaping the fate of Shadowvale and its people.",
    "antagonist": "Sir Garran Vael, the once-honorable lord of the keep, now a tormented undead knight bound by a sentient shadow relic that feeds on despair. Driven mad by centuries of isolation and the artifact’s whispers, Sir Garran seeks to break his curse—even if it means unleashing the relic’s dark power upon Shadowvale.",
    "plotStages": [
      {
        "stageName": "Shadows Over the Village",
        "stageDescription": "The adventurers arrive in the fearful border village beneath the keep. They learn of the nightly moans, missing livestock, and rumors of a cursed noble. The village elder hires the party to investigate, offering what little aid they can spare. The party must gather information, win the trust of suspicious villagers, and prepare for the journey through the haunted woods.",
        "requiredLevel": 1,
        "keyNPCs": [
          "Elder Mirna Harrow (village elder)",
          "Old Tommen (superstitious herdsman)",
          "Cira the Innkeeper"
        ],
        "majorEvents": [
          "Party is hired to investigate the keep",
          "Strange omens and attacks escalate",
          "Clues point to the keep's tragic history"
        ]
      },
      {
        "stageName": "Through the Haunted Woods",
        "stageDescription": "The party treks through the shadowed forest separating the village from the keep. They must navigate shifting trails, spectral illusions, and lurking undead. Along the way, they encounter remnants of old wards and evidence of past tragedies, hinting at the keep’s grim legacy.",
        "requiredLevel": 1,
        "keyNPCs": [
          "Wandering Shade (restless spirit)",
          "Scout Elen (missing villager, possibly rescued)"
        ],
        "majorEvents": [
          "Ambushed by Shadows (spectral guardians)",
          "Discover a lost warding talisman",
          "Rescue or learn the fate of a missing villager"
        ]
      },
      {
        "stageName": "The Forsaken Keep",
        "stageDescription": "The adventurers infiltrate the crumbling keep, navigating ancient traps and haunted halls. They uncover journals and clues revealing Sir Garran Vael’s tragic fall and the artifact’s sinister influence. The keep’s spectral defenders test their resolve, and glimpses of the cursed knight foreshadow the final confrontation.",
        "requiredLevel": 2,
        "keyNPCs": [
          "Sir Garran Vael (cursed knight)",
          "Spectral Scribe (ghostly historian)",
          "The Shadow Relic (sentient artifact, communicates telepathically)"
        ],
        "majorEvents": [
          "Bypass or disarm ancient traps",
          "Face waves of spectral defenders",
          "Uncover Sir Garran’s journals and the artifact’s history"
        ]
      },
      {
        "stageName": "Confronting the Cursed Knight",
        "stageDescription": "The party reaches the heart of the keep—a desecrated throne room where Sir Garran Vael awaits, tormented by the shadow relic. A tense battle and negotiation unfold as the knight’s tragic motives come to light. The adventurers must overcome or persuade him, then choose how to deal with the artifact’s power.",
        "requiredLevel": 3,
        "keyNPCs": [
          "Sir Garran Vael",
          "The Shadow Relic"
        ],
        "majorEvents": [
          "Climactic battle or negotiation with Sir Garran",
          "Revelation of the artifact’s true nature",
          "Moral choice: destroy or bind the relic"
        ]
      },
      {
        "stageName": "Aftermath and New Shadows",
        "stageDescription": "The party’s decision ripples through Shadowvale, reshaping the fate of the keep and the surrounding lands. Destroying the artifact risks a magical backlash and vengeful spirits; binding it preserves the threat but offers new power. The village responds with gratitude, suspicion, or fear, and ominous signs hint at greater dangers awakened by the adventurers’ actions.",
        "requiredLevel": 3,
        "keyNPCs": [
          "Elder Mirna Harrow",
          "Agents of the Black Banner (optional future threat)"
        ],
        "majorEvents": [
          "Consequences of the party’s choice unfold",
          "Village and regional powers react",
          "Hints of future threats or module hooks revealed"
        ]
      }
    ]
  },
  "factions": [
    {
      "factionName": "The Order of the Silver Vigil",
      "factionDescription": "A zealous order of knights and clerics dedicated to rooting out undead and dark magic across Shadowvale. Their methods are strict and sometimes heavy-handed, but they are often the region’s best hope against supernatural threats.",
      "alignment": "lawful good",
      "goals": [
        "Eradicate undead in the region",
        "Destroy or secure dangerous magical artifacts",
        "Restore order and faith in the borderlands"
      ],
      "keyMembers": [
        "Dame Elira Dawnsworn",
        "Brother Jorlan",
        "Sergeant Mara Feld"
      ]
    },
    {
      "factionName": "The Black Banner",
      "factionDescription": "A secretive cabal of spies, thieves, and warlocks exploiting Shadowvale’s fear and chaos for personal gain. They manipulate events from the shadows, seeking profit and forbidden secrets, sometimes sabotaging both sides of a conflict.",
      "alignment": "neutral evil",
      "goals": [
        "Acquire and sell forbidden relics",
        "Destabilize local authorities",
        "Recruit desperate villagers and outcasts"
      ],
      "keyMembers": [
        "Varek the Shade",
        "Mistress Ilyra",
        "Garrik Two-Fingers"
      ]
    },
    {
      "factionName": "Council of Eldermere",
      "factionDescription": "A pragmatic assembly of merchants and minor nobles from the Free Cities of Eldermere. Focused on trade and mutual defense, they approach the hauntings as a threat to commerce and regional stability, preferring negotiation and subtle influence to open conflict.",
      "alignment": "lawful neutral",
      "goals": [
        "Reopen and secure trade routes",
        "Broker alliances with local powers",
        "Contain supernatural threats diplomatically"
      ],
      "keyMembers": [
        "Magister Corvin Leth",
        "Lady Mirielle d'Ashe",
        "Envoy Torric"
      ]
    },
    {
      "factionName": "Circle of the Wild Heart",
      "factionDescription": "A reclusive circle of druids and rangers who protect the forests and wild creatures of Shadowvale. They distrust outsiders but can be powerful allies—or obstacles—depending on how the adventurers treat the land and its spirits.",
      "alignment": "chaotic good",
      "goals": [
        "Preserve the balance of nature",
        "Prevent the spread of undead corruption",
        "Safeguard ancient woodland sites"
      ],
      "keyMembers": [
        "Druidess Halwen",
        "Ranger Branik",
        "Feyfriend Lirael"
      ]
    }
  ],
  "worldMap": [
    {
      "regionName": "Harrow's Hollow",
      "regionDescription": "A mist-shrouded border village crouching at the edge of the haunted woods. Simple folk eke out a living under the looming shadow of the old keep, tormented by nightly terrors and vanishing livestock. The villagers are wary but desperate for aid.",
      "mapId": "HH001",
      "dangerLevel": "low",
      "recommendedLevel": 1,
      "levels": [
        {
          "name": "Village Green",
          "id": "HH001-A",
          "description": "The communal heart of Harrow's Hollow, where villagers gather for news, trade, and rumor."
        },
        {
          "name": "The Crooked Mare Inn",
          "id": "HH001-B",
          "description": "A battered inn offering food, warmth, and the latest whispers about the haunted keep."
        },
        {
          "name": "Elder Mirna’s Cottage",
          "id": "HH001-C",
          "description": "The modest but sturdy home of the village elder, cluttered with family relics and warding charms."
        },
        {
          "name": "Abandoned Farmstead",
          "id": "HH001-D",
          "description": "A derelict farm at the village’s edge, its fields choked with weeds and an air of lingering sorrow."
        }
      ]
    },
    {
      "regionName": "Gloamwood",
      "regionDescription": "A dense, brooding forest where sunlight rarely pierces the canopy. Ethereal mists swirl between ancient oaks, and spirits of the restless dead prowl the trails. Travelers risk losing both their way and their lives.",
      "mapId": "G001",
      "dangerLevel": "medium",
      "recommendedLevel": 1,
      "levels": [
        {
          "name": "Witchlight Path",
          "id": "G001-A",
          "description": "The main trail winding through the Gloamwood, marked by flickering, unnatural lights."
        },
        {
          "name": "The Withered Shrine",
          "id": "G001-B",
          "description": "A crumbling altar to forgotten gods, overgrown and haunted by a lingering spirit."
        },
        {
          "name": "Lost Ward Circle",
          "id": "G001-C",
          "description": "A hidden grove where ancient stones once held back evil, now cracked and powerless."
        },
        {
          "name": "The Sunken Hollow",
          "id": "G001-D",
          "description": "A boggy depression in the woods, rumored to swallow the unwary and home to spectral predators."
        }
      ]
    },
    {
      "regionName": "Shadowfall Keep",
      "regionDescription": "A crumbling fortress perched atop a rocky hill, its towers broken and battlements thick with creeping ivy. Within, restless spirits and deadly traps await all who enter, and the cursed knight’s presence warps reality itself.",
      "mapId": "SK001",
      "dangerLevel": "high",
      "recommendedLevel": 2,
      "levels": [
        {
          "name": "Outer Courtyard",
          "id": "SK001-A",
          "description": "A weed-choked expanse ringed by toppled statues and cracked walls, watched by unseen eyes."
        },
        {
          "name": "The Ruined Chapel",
          "id": "SK001-B",
          "description": "A desecrated place of worship echoing with ghostly hymns and flickering shadows."
        },
        {
          "name": "The Fallen Barracks",
          "id": "SK001-C",
          "description": "Collapsed quarters haunted by the shades of long-dead soldiers."
        },
        {
          "name": "Vaulted Halls",
          "id": "SK001-D",
          "description": "Grand corridors lined with faded banners and sinister traps, leading deeper toward the heart of the keep."
        }
      ]
    },
    {
      "regionName": "The Cursed Dungeons",
      "regionDescription": "Beneath the keep, these ancient catacombs twist into darkness, suffused with the artifact’s malevolent power. Echoes of suffering and the undead linger in every shadowed cell and hidden chamber.",
      "mapId": "TCD001",
      "dangerLevel": "high",
      "recommendedLevel": 3,
      "levels": [
        {
          "name": "The Gaol",
          "id": "TCD001-A",
          "description": "Rows of rusted cells and shackles, haunted by the spirits of unjustly imprisoned souls."
        },
        {
          "name": "The Relic Vault",
          "id": "TCD001-B",
          "description": "A magically reinforced chamber where the shadow relic’s presence is strongest."
        },
        {
          "name": "The Forgotten Ossuary",
          "id": "TCD001-C",
          "description": "A bone-strewn crypt infested with the remains of failed heroes and unquiet dead."
        },
        {
          "name": "The Sealed Portal",
          "id": "TCD001-D",
          "description": "An ancient, rune-etched door rumored to lead into the Shadowfell itself."
        }
      ]
    },
    {
      "regionName": "The Blighted Marches",
      "regionDescription": "A desolate moor stretching beyond the keep, scarred by ancient battles and lingering curses. Strange lights drift over the bogs at night, and only the desperate or foolhardy dare to cross these lands.",
      "mapId": "TBM001",
      "dangerLevel": "extreme",
      "recommendedLevel": 5,
      "levels": [
        {
          "name": "The Sundered Causeway",
          "id": "TBM001-A",
          "description": "Cracked remnants of an old road, now half-swallowed by the marsh and haunted by spectral warriors."
        },
        {
          "name": "The Mire of Echoes",
          "id": "TBM001-B",
          "description": "A treacherous expanse of sucking mud and ghostly voices that lure travelers to their doom."
        },
        {
          "name": "The Black Banner Encampment",
          "id": "TBM001-C",
          "description": "A hidden camp where agents of the Black Banner plot and consort with restless spirits."
        },
        {
          "name": "The Cursed Barrow",
          "id": "TBM001-D",
          "description": "A massive, grass-covered tomb, its entrance sealed by ancient wards and rumors of vengeful dead."
        }
      ]
    }
  ],
  "timelineEvents": [
    {
      "eventName": "Night of Wailing Shadows",
      "eventDescription": "A surge of supernatural energy sweeps through Harrow's Hollow. Ghostly wails echo louder than ever, and several villagers are found in trances or missing by dawn.",
      "triggerCondition": "After the party spends their first night in the village or following their initial investigation.",
      "impact": "Fear and unrest grip the villagers, leading to curfews and calls for immediate action. The Order of the Silver Vigil sends a scout to investigate."
    },
    {
      "eventName": "The Wardstone Shatters",
      "eventDescription": "A centuries-old protective talisman hidden in the Gloamwood is destroyed, either by the party’s actions or by a malevolent force seeking to weaken the region's defenses.",
      "triggerCondition": "When the party discovers or interacts with the lost warding talisman, or if they fail to protect it from shadowy attackers.",
      "impact": "Undead activity increases in the woods and village. Spirits grow bolder, and the keep’s curse strengthens, making travel and rest more dangerous."
    },
    {
      "eventName": "Agents in the Dark",
      "eventDescription": "Members of the Black Banner arrive in the area, seeking to claim the shadow relic for their own. They attempt to contact or sabotage the party, spreading misinformation among the villagers.",
      "triggerCondition": "Once the party uncovers the artifact's true nature or draws attention with their actions in the keep.",
      "impact": "The Black Banner's interference complicates alliances and sows distrust. New rivalries and side plots emerge as the faction maneuvers for advantage."
    },
    {
      "eventName": "Veil Between Worlds Thins",
      "eventDescription": "The growing power of the shadow relic causes a rift between Shadowvale and the Shadowfell. Nightmares plague the living, and spectral phenomena intensify near the keep.",
      "triggerCondition": "If the relic is disturbed, empowered, or during the party's confrontation with Sir Garran Vael.",
      "impact": "Supernatural effects become more pronounced across the region. Lesser undead spawn spontaneously, and planar anomalies disrupt local magic."
    },
    {
      "eventName": "Judgment of the Silver Vigil",
      "eventDescription": "The Order of the Silver Vigil arrives in force, demanding the relic's surrender or destruction. They challenge the party’s decisions and threaten to take control of the keep and village.",
      "triggerCondition": "After the party resolves the artifact’s fate or if word of their actions spreads.",
      "impact": "Power struggles erupt between local factions, with the Order's presence altering political and social dynamics. The party may be hailed as heroes, viewed with suspicion, or forced into hiding, depending on their choices."
    }
  ],
  "moduleConflicts": [
    {
      "conflictName": "Order of Silver Vigil vs Local Autonomy",
      "description": "The Order of the Silver Vigil intensifies its crusade against undead and dark magic, clashing with local lords who resent their interference.",
      "scope": "regional",
      "impact": "Affects party relationships with both zealous knights and local authorities"
    },
    {
      "conflictName": "Black Banner Infiltration",
      "description": "Shadowy agents of the Black Banner sow chaos in rural villages, exploiting the fear of supernatural threats for their own gain.",
      "scope": "local",
      "impact": "Creates trust issues and spreads misinformation that the party must navigate"
    },
    {
      "conflictName": "Haunting Crisis Response",
      "description": "Villagers and petty nobles debate how to address the rising hauntings and disappearances near ancient ruins and the keep, with some advocating appeasement and others demanding armed intervention.",
      "scope": "local",
      "impact": "Directly affects module plot progression and NPC reactions to party actions"
    }
  ]
}