{
  "plotTitle": "Whispers Beneath Harrow's Hollow",
  "mainObjective": "Investigate the mysterious disappearances in Harrow's Hollow and discover the fate of Scout Elen.",
  "plotPoints": [
    {
      "id": "PP001",
      "title": "Shadows Over Harrow's Hollow",
      "description": "The party arrives in Harrow's Hollow, a small, anxious village gripped by fear. Elder Mirna Harrow asks the characters to investigate recent disappearances, including that of Scout Elen. Tensions run high as rumors of curses, spirits, and the haunted Keep of Doom swirl among the villagers. Players must gather information, win trust, and follow leads to piece together the mystery.",
      "location": "HH001",
      "nextPoints": [
        "PP002"
      ],
      "status": "completed",
      "plotImpact": "The party returns to Harrow's Hollow, victorious over the curse of Shadowfall Keep and ready to share their success and treasures with the village.",
      "sideQuests": [
        {
          "id": "SQ001",
          "title": "Superstition and Shadows",
          "description": "Old Tommen believes a wandering spirit haunts the village. If the party investigates, they may encounter the Wandering Shade—a restless ghost whose cryptic words offer hints about the keep and the missing villagers.",
          "involvedLocations": [
            "HH001"
          ],
          "status": "not started",
          "plotImpact": ""
        },
        {
          "id": "SQ002",
          "title": "Trouble at the Hearth",
          "description": "Cira the Innkeeper's cellar is plagued by minor poltergeist activity. Calming the spirit earns Cira's gratitude and a helpful clue about Scout Elen's last known movements.",
          "involvedLocations": [
            "HH001"
          ],
          "status": "completed",
          "plotImpact": "Eirik's holy light has freed the spirit haunting the cellar and revealed a hidden passage—likely Elen's path—along with a warning about the shadows in the keep. Cira's gratitude and a crucial clue are now earned."
        }
      ]
    },
    {
      "id": "PP002",
      "title": "The Road to Doom",
      "description": "Tracking clues and rumors, the party must brave the haunted forest and reach the Keep of Doom. Along the way, they navigate treacherous terrain, spectral ambushes, and lingering wards. The forest is alive with unnatural energies, and the party may encounter allies or enemies who help or hinder their journey.",
      "location": "G001",
      "nextPoints": [
        "PP003"
      ],
      "status": "completed",
      "plotImpact": "Eirik and Thane have followed Elen's trail through the smuggler's tunnel and emerged near the East Gate, gathering new clues and bypassing the tunnel's dangers. The road to the keep is now open, progressing the investigation into Harrow's Hollow's curse.",
      "sideQuests": [
        {
          "id": "SQ003",
          "title": "The Lost Ward Circle",
          "description": "An ancient protective ward circle in the forest has failed. Restoring it could weaken the keep's influence and protect the village from spectral incursions.",
          "involvedLocations": [
            "G001"
          ],
          "status": "completed",
          "plotImpact": "Eirik has successfully performed the strengthening ritual at the Lost Ward Circle, fully restoring its power. The keep's influence is significantly weakened, and the forest and Harrow's Hollow are protected from undead threats for the next day."
        },
        {
          "id": "SQ004",
          "title": "The Keeper's Warning",
          "description": "A mysterious hermit known as the Keeper dwells near the forest edge. They possess knowledge about the keep's curse but require assistance or convincing to share it.",
          "involvedLocations": [
            "G001"
          ],
          "status": "not started",
          "plotImpact": ""
        }
      ]
    },
    {
      "id": "PP003",
      "title": "Breach the Keep",
      "description": "The party must reach and enter the foreboding Keep of Doom. This quest completes when the party successfully enters the keep through any means.",
      "location": "SK001",
      "nextPoints": [
        "PP004"
      ],
      "status": "completed",
      "plotImpact": "The party has successfully entered and conquered the Keep of Doom, fulfilling the objective of breaching the keep. This opens the path to further adventures and resolves the quest thread.",
      "sideQuests": [
        {
          "id": "SQ005",
          "title": "The Black Banner Mercenaries",
          "description": "A band of mercenaries camps near the keep, seeking treasure. They may be allies, rivals, or obstacles depending on party interactions.",
          "involvedLocations": [
            "TBM001"
          ],
          "status": "not started",
          "plotImpact": ""
        }
      ]
    },
    {
      "id": "PP004",
      "title": "The Heart of Darkness",
      "description": "Within the keep's depths lies the source of the curse: the vengeful spirit of Lord Thaddeus Greymont, corrupted by dark magic. The party must confront him, either by combat, exorcism, or fulfilling his final wish to find peace.",
      "location": "TCD001",
      "nextPoints": [
        "PP005"
      ],
      "status": "completed",
      "plotImpact": "The party has uncovered the hidden vault beneath the Relic Chamber, claiming Sir Garran's sword and a deed to the keep, along with ancient lore and precious treasure.",
      "sideQuests": []
    },
    {
      "id": "PP005",
      "title": "Resolution and Rewards",
      "description": "Return to Harrow's Hollow after dealing with the shadow relic. This quest completes when the party returns to the village after defeating or destroying the shadow relic in the keep.",
      "location": "HH001",
      "nextPoints": [],
      "status": "completed",
      "plotImpact": "The party has returned to Harrow's Hollow after breaking the curse and rescuing Elen. The village's main threat is vanquished, and the story enters a new era of hope.",
      "sideQuests": []
    }
  ],
  "activeQuests": [],
  "completedQuests": [],
  "failedQuests": [],
  "worldEvents": [],
  "dmNotes": []
}
