{
  "areaId": "RO001",
  "areaName": "Rangers' Outpost",
  "areaType": "wilderness",
  "areaDescription": "Crisis transforms this frontier outpost from peaceful haven to fortress under siege. Weathered timber walkways now bear the scars of hasty fortification, while the clearing echoes with urgent voices and the clash of hastily prepared weapons. The spicy tang of pine sap mingles with smoke from signal fires and the metallic scent of fear. Rangers move with grim purpose between reinforced positions, their usual confidence replaced by the weight of impending catastrophe threatening to overwhelm their small garrison.",
  "dangerLevel": "low",
  "recommendedLevel": 1,
  "climate": "temperate",
  "terrain": "forest clearing",
  "map": {
    "mapId": "MAP_RO001",
    "mapName": "Rangers' Outpost Map",
    "totalRooms": 5,
    "rooms": [
      {
        "id": "RO01",
        "type": "crossroads",
        "connections": [
          "RO02",
          "RO03",
          "RO04"
        ],
        "coordinates": "X2Y2",
        "name": "Forked Trails Crossing"
      },
      {
        "id": "RO02",
        "type": "riverside",
        "connections": [
          "RO01"
        ],
        "coordinates": "X2Y3",
        "name": "Moonlit Waters Edge"
      },
      {
        "id": "RO03",
        "type": "ruins",
        "connections": [
          "RO01",
          "RO05"
        ],
        "coordinates": "X1Y2",
        "name": "Shattered Sentinel Stones"
      },
      {
        "id": "RO04",
        "type": "riverside",
        "connections": [
          "RO01"
        ],
        "coordinates": "X3Y2",
        "name": "Mistshadow Ford"
      },
      {
        "id": "RO05",
        "type": "cave",
        "connections": [
          "RO03"
        ],
        "coordinates": "X1Y1",
        "name": "Feral Hollow"
      }
    ],
    "layout": [
      [
        "RO05",
        "   ",
        "   "
      ],
      [
        "RO03",
        "RO01",
        "RO04"
      ],
      [
        "   ",
        "RO02",
        "   "
      ]
    ]
  },
  "locations": [
    {
      "locationId": "RO01",
      "name": "Rangers' Command Post",
      "type": "crossroads",
      "description": "The Rangers' Command Post stands shrouded in morning mist, the battered oak command table cluttered with blood-streaked maps beneath the silent silver bells, their magical resonance broken by recent sabotage. The atmosphere carries a tense but cautious optimism as rangers gather, exchanged whispers and watchful eyes fixed on the shackled bandit leader Rusk, whose fearful demeanor speaks volumes of the dark power behind the new enemy. Commander Elen directs operations with measured authority, briefing the party on the lost caravan, the threat of the sorcerer Malarok, and the urgent need to restore the bell network for early warnings. The outpost is now a hub of renewed purpose as preparations are underway to strike back and reclaim the safety of the Thornwood frontier.",
      "coordinates": "X2Y2",
      "accessibility": "Central hub with clear sight lines to all outpost approaches; currently partially impaired by sabotage and ongoing repairs but regaining function as efforts to restore the bell network progress.",
      "npcs": [
        {
          "name": "Ranger Elen",
          "description": "The steadfast commander of Thornwood Outpost, Elen bears the weight of protecting the frontier trade routes. As a military professional, she demonstrates clear tactical thinking: assess threats first, then plan defenses, then secure resources. Her eyes are sharp yet weary beneath mounting losses. She focuses on intelligence gathering first, then defensive measures such as restoring the bell network, and finally logistics.",
          "attitude": "Professional but concerned, testing the party's competence while revealing the burden of command. Now more hopeful after gaining critical intelligence from Rusk and seeing renewed determination among the rangers."
        },
        {
          "name": "Ranger Marcus",
          "description": "A grizzled veteran scout with weathered hands and keen eyes, Marcus speaks grimly of clever bandits leaving no survivors. He remains grim but helpful, sharing patrol knowledge and trail wisdom with those who prove themselves worthy of respect.",
          "attitude": "Gruff but helpful, willing to share patrol knowledge and trail wisdom with those who prove themselves worthy of respect."
        },
        {
          "name": "Scout Kira",
          "description": "A young, eager level 2 ranger who reports directly to Elen and frequently carries messages between outposts. Her wide-eyed reports of strange lights and aggressive wildlife hint at Malarok's corrupting influence spreading from the north. She has joined the party, eager to help with the thorn overgrowth in the East Tower.",
          "attitude": "Enthusiastic and determined, eager to join the party and help investigate the supernatural corruption affecting the wilderness. Ready to guide the party through the Thornwood and handle magical thorn overgrowth."
        },
        {
          "name": "Messenger Tom",
          "description": "A road-weary courier who rides between settlements carrying dispatches and news. His horse shows signs of hard travel, and he always seems to be either arriving from or departing for another urgent delivery.",
          "attitude": "Tired but reliable, grateful for a safe place to rest and always willing to share news from distant settlements in exchange for a hot meal."
        },
        {
          "name": "Rusk",
          "description": "Captured bandit leader with a broken arm, now terrified of his new master. Once a simple brigand, he speaks in hushed, fearful tones about the sorcerer Malarok who now commands the bandit forces. Under Eirik's compassionate care and cure wounds, Rusk has revealed the bandits' hidden camp location in a crumbling moss-covered watchtower and detailed Malarok's dark magic and sinister plans.",
          "attitude": "Fearful and broken, eager to cooperate in exchange for protection from Malarok's wrath. Provides vital intelligence about the sorcerer's operations and bandit camp defenses."
        }
      ],
      "monsters": [],
      "plotHooks": [
        "PRIMARY CRISIS: Elen urgently recruits the party - three caravans destroyed in five days with unnatural precision",
        "IMMEDIATE ACTION NEEDED: Captured bandit leader Rusk holds key intelligence about the enemy commander and main bandit camp location",
        "SECONDARY CONCERN (after intel): The silver bell network has been sabotaged, threatening communication and early warning capability",
        "EXPEDITION SUPPORT (after planning): Scout Kira is eager to join wilderness missions and assist with overcoming magical thorn overgrowth",
        "UPCOMING MISSION: Secure the North Tower to reactivate its bell before addressing the more dangerous East Tower",
        "SUPPLY LOGISTICS (when preparing): Strange reports suggest supernatural corruption - supplies and preparation will be crucial"
      ],
      "lootTable": [
        "Detailed regional map marking bandit activity",
        "Pouch of silver signal bells",
        "Ranger's field guide to local threats",
        "Horse and provisions for upcoming mission",
        "Gloves and salve to counter cursed brambles"
      ],
      "dmInstructions": "Elen now briefs the party with critical intelligence from Rusk about the bandit camp and sorcerer Malarok. Emphasize the shift from grim endurance to cautious optimism in the outpost. Scout Kira is present and ready to join the party for the expedition. Focus upcoming scenarios on restoring the silver bell network starting with the North Tower. Present challenges logically with urgency and tactical planning, highlighting the importance of the bell system and the threat of magical corruption.",
      "doors": [],
      "traps": [],
      "dcChecks": [
        "Insight DC 12: Notice Elen's concern about reports from distant regions, hinting at larger threats",
        "Investigation DC 10: Study the tactical maps to understand bandit movement patterns",
        "Perception DC 8: Hear the subtle signals from the silver bell network warning of approaching activity",
        "Investigation DC 15: Detect signs of magical corruption in the sabotaged silver bell network, indicating Malarok's agents used supernatural means"
      ],
      "connectivity": [
        "RO02",
        "RO03",
        "RO04"
      ],
      "areaConnectivity": [
        "Thornwood Wilds"
      ],
      "areaConnectivityId": [
        "TW001"
      ],
      "features": [
        {
          "name": "Command Table",
          "description": "A battered oak table bearing blood-smeared maps, dispatch scrolls, and tactical markers showing current threats and patrol routes."
        },
        {
          "name": "Sabotaged Silver Bell Network",
          "description": "Magical silver bells form the early warning system, their enchanted resonance disrupted by systematic sabotage. The bells hang silent where magical alerts once chimed across the network."
        },
        {
          "name": "Ranger Equipment Racks",
          "description": "Well-maintained racks holding spare bows, quivers, and survival gear for rangers heading out on patrol."
        },
        {
          "name": "Temporary Holding Area",
          "description": "A secured corner of the command post where captured bandit leader Rusk is held under guard. Heavy chains and vigilant rangers ensure the prisoner remains contained while still allowing for interrogation and information gathering."
        }
      ],
      "dangerLevel": "Medium",
      "encounters": [
        {
          "encounterId": "RO01-E1",
          "summary": "Initial briefing with Commander Elen and interrogation of bandit leader Rusk revealing critical intelligence about Malarok and the bandit camp.",
          "impact": "Provided the party with vital information on enemy leadership and camp location, shifting the party's mission focus and morale.",
          "worldConditions": {
            "year": 1492,
            "month": "Springmonth",
            "day": 1,
            "time": "08:45:00"
          }
        },
        {
          "encounterId": "RO01-E2",
          "summary": "Scout Kira officially joins the party, bringing news of magical corruption and thorn overgrowth threatening the East Tower.",
          "impact": "Added expert guidance and resources to the party for handling supernatural threats, enabling plans to restore the bell network and counter the cursed brambles.",
          "worldConditions": {
            "year": 1492,
            "month": "Springmonth",
            "day": 1,
            "time": "09:10:00"
          }
        },
        {
          "encounterId": "RO01-E3",
          "summary": "The party's arrival amid tense rangers and their preparation to secure the North Tower bell first, with Commander Elen outlining the strategic importance of restoring early warning capabilities.",
          "impact": "The command post's mood lightened as purpose replaced despair; the party earned respect and solidified their role in the Thornwood defense, setting the stage for upcoming missions.",
          "worldConditions": {
            "year": 1492,
            "month": "Springmonth",
            "day": 1,
            "time": "09:19:00"
          }
        }
      ],
      "adventureSummary": "At the Rangers' Command Post, the morning mist curled through the battered outpost, where tension hung thick alongside the scent of damp wood and worn leather. Blood-streaked maps cluttered the oak command table beneath silent silver bells, their mute presence a grim reminder of recent sabotage. The party arrived amid a gathering of rangers clustered tensely, their gazes flickering toward the pale, shackled bandit leader Rusk, who sat slumped and haunted in the holding corner under watchful eyes. Commander Elen, sharp-eyed and measured, briefed the party on the dire situation: another caravan had been lost overnight, rangers were stretched thin, and Rusk was broken by fear of a sorcerer known only as \"the master.\" Eirik approached Rusk with a calm, compassionate demeanor, casting cure wounds upon the bandit's shattered arm, an act that stirred a fragile hope and trust in the desperate man. Under Eirik's earnest assurance--though unable to guarantee Rusk's safety from Malarok's wrath--the captive revealed critical intelligence: the bandits' hidden camp lay in a crumbling, moss-covered watchtower in the Thornwood, guarded by traps and scouts; their new leader was the corrupting sorcerer Malarok, who wielded a sinister black stone and twisted his followers with dark magic, preparing a terrible ritual. This revelation shifted the outpost's mood from grim endurance to cautious optimism, with Commander Elen already plotting strikes and the other rangers murmuring renewed hope. After a brief respite, the party reconvened as Elen outlined the urgent need to restore the sabotaged silver bell network, vital for early warnings and coordination. With Scout Kira joining the party, equipped to handle the magical thorn overgrowth choking the East Tower, and sturdy gloves and salve provided to counter the cursed brambles, plans formed swiftly. Though the East Tower's vines were a pressing threat, the party chose to first secure the nearer North Tower to reactivate its bell, gaining critical warning capability. As they prepared to leave, the command post's atmosphere had lightened--purpose replacing despair--and with respect earned from the rangers, the party set forth from the Rangers' Command Post, their next steps poised to turn the tide in Thornwood's fraught frontier."
    },
    {
      "locationId": "RO02",
      "name": "Supply Depot",
      "type": "riverside",
      "description": "Wooden crates and canvas-wrapped supplies line the riverbank where merchant barges dock to resupply the outpost. Quartermaster Brann oversees the careful inventory, his weathered hands checking manifests against dwindling stores. The gentle lap of water against the dock mingles with the creak of rope and timber, while nervous traders eye the forest treeline.",
      "coordinates": "X2Y3",
      "connectivity": [
        "RO01",
        "RO04"
      ],
      "areaConnectivity": [],
      "areaConnectivityId": [],
      "npcs": [
        {
          "name": "Quartermaster Brann",
          "description": "A methodical dwarf with ink-stained fingers and a sharp eye for detail, Brann maintains the outpost's supplies with military precision. Recent shortages have made him increasingly cautious about who gets access to equipment and rations.",
          "attitude": "Businesslike and protective of supplies, but will warm to characters who prove their worth to the outpost."
        },
        {
          "name": "Dock Worker Finn",
          "description": "A burly human who handles the loading and unloading of supply barges at the riverside dock. His clothes are perpetually damp from river spray, and he knows every merchant barge captain who travels these waters.",
          "attitude": "Friendly and chatty, always eager to share river gossip and stories about the various merchants and their cargo."
        },
        {
          "name": "Merchant Vera",
          "description": "A nervous middle-aged trader whose own caravan was attacked two weeks ago. She lost most of her goods but escaped with her life, and now helps Brann with supply inventory while waiting for safe passage home.",
          "attitude": "Anxious but grateful for shelter, willing to share detailed accounts of bandit tactics and warning signs she noticed before her attack."
        },
        {
          "name": "Apprentice Jeb",
          "description": "Brann's young assistant, a well-meaning but clumsy human who handles the simpler supply tasks. He's eager to please but prone to dropping things and mixing up inventory counts.",
          "attitude": "Enthusiastic and helpful, though often apologetic about his mistakes. Looks up to the rangers and dreams of joining their ranks someday."
        }
      ],
      "monsters": [],
      "lootTable": [
        "Rope and climbing gear",
        "Trail rations for 3 days",
        "Waterproof supply manifest showing recent shortages"
      ],
      "plotHooks": [
        "Supply shortages suggest Malarok's agents are intercepting shipments for dark rituals",
        "Merchant barge arrivals have become increasingly irregular due to supernatural corruption fears",
        "Brann mentions unusual requests for iron and silver, materials that resist dark magic"
      ],
      "dmInstructions": "Brann can provide basic equipment and supplies to the party, but requires proof of their legitimacy. He's a good source for information about supply chain disruptions and suspicious merchant activity.",
      "doors": [],
      "traps": [],
      "dcChecks": [
        "Investigation DC 11: Examine supply manifests to notice patterns in missing shipments",
        "Persuasion DC 13: Convince Brann to share information about suspicious merchant requests",
        "Perception DC 9: Notice nervous behavior from traders docking at the depot"
      ],
      "accessibility": "Open dock area with clear river access for supply barges",
      "dangerLevel": "Low",
      "features": [
        {
          "name": "Supply Dock",
          "description": "A sturdy wooden dock extending into the river, designed for merchant barges to safely unload cargo."
        },
        {
          "name": "Inventory Ledgers",
          "description": "Detailed logs tracking all incoming and outgoing supplies, meticulously maintained by Quartermaster Brann."
        },
        {
          "name": "Storage Crates",
          "description": "Weatherproof crates and canvas-wrapped bundles containing essential supplies for the outpost's operations."
        }
      ]
    },
    {
      "locationId": "RO03",
      "name": "Trader's Rest",
      "type": "ruins",
      "description": "A frost-dusted clearing marked by dilapidated benches, a sagging sign, and empty, weathered trade stalls. The usual throng of merchants is absent, and an eerie silence hangs heavily over the quiet market. Signs of recent violence are evident, such as damage to the East Tower's silver bell and faint footprints, hinting at recent sabotage by hostile forces. Despite the tension, Trader Sila remains watchful by a locked chest, working to maintain order and warn the merchants of lurking threats.",
      "coordinates": "X1Y2",
      "connectivity": [
        "RO01",
        "RO05"
      ],
      "areaConnectivity": [],
      "areaConnectivityId": [],
      "npcs": [
        {
          "name": "Trader Sila",
          "description": "A wary woman in a patched green cloak who stands watch by a locked chest. Though guarded, she shows a cautious hope and trust towards the party after their assistance. She coordinates the merchant community and warns others to stay vigilant after dark.",
          "attitude": "Guarded but appreciative, cautiously hopeful and eager to spread warnings among the merchants. Should only approach the party with her quest when they're actively preparing for expeditions or gathering supplies - not during the initial crisis assessment phase."
        },
        {
          "name": "Merchant Gareth",
          "description": "A portly human trader who specializes in general goods and basic supplies. His wagon is currently being repaired after damage from a recent bandit encounter, and he's frustrated by the delays to his trading schedule.",
          "attitude": "Worried and impatient, constantly checking on his damaged wagon and eager to discuss the deteriorating safety of the trade routes."
        },
        {
          "name": "Trader Mila",
          "description": "An exotic goods merchant with items from distant lands, Mila has been stranded at the outpost longer than expected. She deals in rare spices, unusual trinkets, and has heard disturbing rumors about supernatural corruption.",
          "attitude": "Mysterious but helpful, willing to trade information about strange occurrences for protection or safe passage to her next destination."
        },
        {
          "name": "Caravan Guard Bex",
          "description": "A retired soldier turned caravan guard who now helps coordinate security for merchant groups. Her experience shows in her alert posture and the practical arrangement of her weapons and armor.",
          "attitude": "Professional and direct, focused on practical security matters and always assessing potential threats to merchant caravans."
        }
      ],
      "monsters": [],
      "lootTable": [
        "Assorted trade goods from various regions",
        "Merchant's ledger detailing recent attacks",
        "Map of regional trade routes with danger markings",
        "Parchment with Malarok's sigil - a twisted tree surrounded by dark energy"
      ],
      "plotHooks": [
        "Evidence of Malarok's magical corruption affecting the trading post",
        "Sila speaks of her stolen iron-banded chest taken by bandits to a nearby cache",
        "Fresh trail leads toward the Forgotten Waystation where Malarok's agents may have been active",
        "Magical thorny vines and other supernatural elements threaten merchant safety"
      ],
      "dmInstructions": "ACTIVATION TRIGGER: Only introduce Sila's quest (SQ002) when the party shows interest in supplies/preparation for wilderness expedition, OR after they've assessed the bell network situation. Sila should approach the party naturally when they're gathering resources, not as part of the initial crisis briefing. This represents the 'supply chain' phase of expedition planning, not an immediate crisis. The magically enhanced thorny vines on the East Tower are evidence of Malarok's corruption and should be mentioned when discussing the bell network restoration.",
      "doors": [],
      "traps": [],
      "dcChecks": [
        "Persuasion DC 12: Convince Sila to share detailed information about recent sabotage",
        "Investigation DC 14: Examine damaged bell tower and footprints for clues",
        "Perception DC 13: Spot subtle signs of recent movement near the trade stalls"
      ],
      "accessibility": "Open market clearing with weathered stalls and benches, accessible via main trade routes",
      "dangerLevel": "Medium",
      "features": [
        {
          "name": "Magically Enhanced Thorny Vines",
          "description": "Thick, unnatural vines with razor-sharp thorns that have grown over the East Tower's bell, clearly enhanced by Malarok's magic."
        },
        {
          "name": "Weathered Trade Stalls",
          "description": "Empty and battered stalls showing signs of recent disturbance and hurried departure."
        },
        {
          "name": "Locked Chest",
          "description": "Guarded by Trader Sila, containing merchant valuables and supplies."
        }
      ]
    },
    {
      "locationId": "RO04",
      "name": "Scout's Watch",
      "type": "riverside",
      "description": "A raised wooden platform overlooks the river crossing, providing clear sight lines across the water and into the forest beyond. Scout Neris maintains vigilant watch from this vantage point, her spyglass scanning for threats while signal mirrors catch the light for long-distance communication. The sound of flowing water masks quiet conversations about patrol routes and suspicious movement.",
      "coordinates": "X3Y2",
      "connectivity": [
        "RO01"
      ],
      "areaConnectivity": [],
      "areaConnectivityId": [],
      "npcs": [],
      "monsters": [],
      "lootTable": [
        "Spyglass with exceptional range",
        "Detailed wilderness maps with recent annotations",
        "Signal mirror for long-distance communication"
      ],
      "plotHooks": [
        "Neris has observed dark energy and unnatural corruption spreading from the northern forest",
        "Wildlife has been fleeing southward, some showing signs of magical corruption",
        "Malarok's agents have been spotted moving at night toward the Thornwood",
        "Communication with northern patrol posts has been disrupted by the sorcerer's influence"
      ],
      "dmInstructions": "Scout Neris provides reconnaissance intelligence and can guide the party to specific locations in the wilderness. She's the best source for information about the supernatural phenomena affecting the northern reaches.",
      "doors": [],
      "traps": [],
      "dcChecks": [
        "Perception DC 10: Spot distant movement or signals that Neris points out",
        "Survival DC 12: Understand the significance of wildlife migration patterns Neris describes",
        "Investigation DC 11: Study Neris's annotated maps to identify patterns in the strange phenomena"
      ],
      "accessibility": "Elevated watch platform accessible by wooden ladder",
      "dangerLevel": "Low",
      "features": [
        {
          "name": "Watch Platform",
          "description": "A sturdy wooden platform raised above the treeline, providing commanding views of the river crossing and forest approaches."
        },
        {
          "name": "Signal Equipment",
          "description": "Mirrors, flags, and other communication tools for coordinating with distant patrols and the main outpost."
        },
        {
          "name": "Observation Logs",
          "description": "Detailed written records of movements, weather patterns, and unusual sightings maintained by the scout."
        },
        {
          "name": "North Tower Bell (SQ001)",
          "description": "One of three silver bell towers in the communication network. The bell clapper has been stolen by Malarok's agents, leaving the bell silent and the network partially disabled."
        }
      ]
    },
    {
      "locationId": "RO05",
      "name": "Forgotten Waystation",
      "type": "ruins",
      "description": "Overgrown stone foundations mark where an old ranger messaging station once facilitated communication between outposts. Moss-covered relay towers and a partially collapsed signal platform hint at its former purpose. Recent activity has disturbed the undergrowth - fresh footprints, scattered equipment, and drag marks leading to a concealed cache suggest this abandoned site has found new, sinister purpose.",
      "coordinates": "X1Y1",
      "connectivity": [
        "RO03"
      ],
      "areaConnectivity": [],
      "areaConnectivityId": [],
      "npcs": [],
      "monsters": [
        {
          "name": "Wolf",
          "quantity": {
            "min": 2,
            "max": 2
          }
        }
      ],
      "lootTable": [
        "Crow's Hand supply cache with sabotage tools",
        "Coded correspondence revealing next targets",
        "Maps marking vulnerable points in the silver bell network",
        "Schedule showing caravan routes and ritual timing for Malarok",
        "Fragment of Malarok's spellbook containing corruption magic"
      ],
      "plotHooks": [
        "Fresh drag marks lead to a concealed cache of magical components for Malarok's rituals",
        "Coded messages reveal Malarok's plans to corrupt the northern woods completely",
        "Equipment suggests the sorcerer has been scrying on ranger operations",
        "Evidence points to Malarok's systematic corruption of the entire region"
      ],
      "dmInstructions": "This location serves as evidence of the Crow's Hand's organized campaign against the outpost. The cache reveals their systematic approach and provides clues about their next target (Scout's Watch). Use investigation checks to uncover layers of evidence showing this isn't random banditry but coordinated sabotage.",
      "doors": [],
      "traps": [],
      "dcChecks": [
        "Investigation DC 12: Follow drag marks to discover the hidden equipment cache",
        "Investigation DC 15: Decode partial messages to reveal next target locations",
        "Perception DC 13: Notice recently disturbed hiding spots and escape routes",
        "Survival DC 11: Determine how recently the site was occupied"
      ],
      "accessibility": "Abandoned ruins overgrown with vegetation, requires careful searching to find concealed evidence",
      "dangerLevel": "Low",
      "features": [
        {
          "name": "Moss-Covered Relay Towers",
          "description": "Ancient stone towers once used for signal fires and message relay between ranger outposts, now crumbling and overgrown."
        },
        {
          "name": "Collapsed Signal Platform",
          "description": "A partially destroyed wooden platform where signal mirrors and flags were once operated to communicate with distant posts."
        },
        {
          "name": "Concealed Equipment Cache",
          "description": "A hidden stash of sabotage tools, coded messages, and intelligence materials recently dragged here by Crow's Hand operatives."
        },
        {
          "name": "Disturbed Undergrowth",
          "description": "Fresh signs of activity including footprints, drag marks, and hastily concealed evidence of recent occupation."
        },
        {
          "name": "West Tower Bell (SQ001)",
          "description": "One of three silver bell towers in the communication network. The harmonic crystal has been shattered by Malarok's agents, requiring replacement to restore the tower's function."
        }
      ]
    }
  ],
  "randomEncounters": [
    {
      "roll": "1-10",
      "encounter": "wandering animal",
      "description": "A wandering animal appropriate for level 1 parties"
    },
    {
      "roll": "11-20",
      "encounter": "lost traveler",
      "description": "A lost traveler appropriate for level 1 parties"
    },
    {
      "roll": "21-30",
      "encounter": "environmental hazard",
      "description": "A environmental hazard appropriate for level 1 parties"
    },
    {
      "roll": "31-40",
      "encounter": "lost traveler",
      "description": "A lost traveler appropriate for level 1 parties"
    },
    {
      "roll": "41-50",
      "encounter": "environmental hazard",
      "description": "A environmental hazard appropriate for level 1 parties"
    },
    {
      "roll": "51-60",
      "encounter": "wandering animal",
      "description": "A wandering animal appropriate for level 1 parties"
    },
    {
      "roll": "61-70",
      "encounter": "lost traveler",
      "description": "A lost traveler appropriate for level 1 parties"
    },
    {
      "roll": "71-80",
      "encounter": "environmental hazard",
      "description": "A environmental hazard appropriate for level 1 parties"
    },
    {
      "roll": "81-90",
      "encounter": "wandering animal",
      "description": "A wandering animal appropriate for level 1 parties"
    },
    {
      "roll": "91-100",
      "encounter": "wandering animal",
      "description": "A wandering animal appropriate for level 1 parties"
    }
  ],
  "areaFeatures": [
    "water sources",
    "rock formations",
    "animal dens"
  ],
  "notes": "Weather and terrain should affect travel times. Random encounters keep exploration tense."
}