{
  "plotTitle": "Whispers Beneath Harrow's Hollow",
  "mainObjective": "Investigate the mysterious disappearances in Harrow's Hollow and discover the fate of Scout Elen.",
  "plotPoints": [
    {
      "id": "PP001",
      "title": "Shadows Over Harrow's Hollow",
      "description": "The party arrives in Harrow's Hollow, a small, anxious village gripped by fear. Elder Mirna Harrow asks the characters to investigate recent disappearances, including that of Scout Elen. Tensions run high as rumors of curses, spirits, and the haunted Keep of Doom swirl among the villagers. Players must gather information, win trust, and follow leads to piece together the mystery.",
      "location": "HH001",
      "nextPoints": [
        "PP002"
      ],
      "status": "in progress",
      "plotImpact": "Norn inspires the militia to heightened vigilance, bolstering Harrow's Hollow's defenses and morale as he prepares to confront the curse at the keep.",
      "sideQuests": [
        {
          "id": "SQ001",
          "title": "Superstition and Shadows",
          "description": "Old Tommen believes a wandering spirit haunts the village. If the party investigates, they may encounter the Wandering Shade—a restless ghost whose cryptic words offer hints about the keep and the missing villagers.",
          "involvedLocations": [
            "HH001"
          ],
          "status": "not started",
          "plotImpact": ""
        },
        {
          "id": "SQ002",
          "title": "Trouble at the Hearth",
          "description": "Cira the Innkeeper's cellar is plagued by minor poltergeist activity. Calming the spirit earns Cira's gratitude and a helpful clue about Scout Elen's last known movements.",
          "involvedLocations": [
            "HH001"
          ],
          "status": "not started",
          "plotImpact": ""
        }
      ]
    },
    {
      "id": "PP002",
      "title": "The Road to Doom",
      "description": "Tracking clues and rumors, the party must brave the haunted forest and reach the Keep of Doom. Along the way, they navigate treacherous terrain, spectral ambushes, and lingering wards. The forest is alive with unnatural energies, and the party may encounter allies or enemies who help or hinder their journey.",
      "location": "G001",
      "nextPoints": [
        "PP003"
      ],
      "status": "in progress",
      "plotImpact": "Morvath confirms that Elen most likely fled toward Shadowfall Keep. He warns Norn of the dangers ahead and hints that an old key or forest blessing may be needed to enter the keep, setting the next step of the quest.",
      "sideQuests": [
        {
          "id": "SQ003",
          "title": "The Lost Ward Circle",
          "description": "An ancient protective ward circle in the forest has failed. Restoring it could weaken the keep's influence and protect the village from spectral incursions.",
          "involvedLocations": [
            "G001"
          ],
          "status": "completed",
          "plotImpact": "Norn has completed the ancient ritual at the faerie circle, restoring the Lost Ward Circle. The spectral curse's influence is weakened, and protective magic now shields the Spectral Clearing and nearby paths."
        },
        {
          "id": "SQ004",
          "title": "The Keeper's Warning",
          "description": "A mysterious hermit known as the Keeper dwells near the forest edge. They possess knowledge about the keep's curse but require assistance or convincing to share it.",
          "involvedLocations": [
            "G001"
          ],
          "status": "in progress",
          "plotImpact": "Norn has reported the outcome of the ritual and spectral encounter to Keeper Morvath, confirming that Elen fled before finishing the ritual. The Keeper now seeks further details, hoping for any clue to Elen's fate."
        }
      ]
    },
    {
      "id": "PP003",
      "title": "Breach the Keep",
      "description": "The party reaches the foreboding Keep of Doom. They must find a way inside, dealing with traps, lingering magical defenses, and spectral guardians. Entry requires cunning, bravery, or the right key—perhaps obtained from earlier encounters.",
      "location": "SK001",
      "nextPoints": [
        "PP004"
      ],
      "status": "not started",
      "plotImpact": "",
      "sideQuests": [
        {
          "id": "SQ005",
          "title": "The Black Banner Mercenaries",
          "description": "A band of mercenaries camps near the keep, seeking treasure. They may be allies, rivals, or obstacles depending on party interactions.",
          "involvedLocations": [
            "TBM001"
          ],
          "status": "not started",
          "plotImpact": ""
        }
      ]
    },
    {
      "id": "PP004",
      "title": "The Heart of Darkness",
      "description": "Within the keep's depths lies the source of the curse: the vengeful spirit of Lord Thaddeus Greymont, corrupted by dark magic. The party must confront him, either by combat, exorcism, or fulfilling his final wish to find peace.",
      "location": "TCD001",
      "nextPoints": [
        "PP005"
      ],
      "status": "not started",
      "plotImpact": "",
      "sideQuests": []
    },
    {
      "id": "PP005",
      "title": "Resolution and Rewards",
      "description": "With the curse lifted, the party returns to Harrow's Hollow as heroes. Elder Mirna and the villagers celebrate their success. Rewards, both material and social, await. New opportunities and adventures may present themselves as the party's reputation spreads.",
      "location": "HH001",
      "nextPoints": [],
      "status": "not started",
      "plotImpact": "",
      "sideQuests": []
    }
  ],
  "activeQuests": [],
  "completedQuests": [],
  "failedQuests": [],
  "worldEvents": [],
  "dmNotes": []
}