{
  "plotTitle": "Shadows Over Greenwatch",
  "mainObjective": "Investigate the supernatural threats plaguing the Greenwatch region by uncovering the village conspiracy, cleansing the corrupted Verdantwood Wilds, and neutralizing the ancient vigilance of Watcher's Rise before these interconnected dangers overwhelm the area.",
  "plotPoints": [
    {
      "id": "PP001",
      "title": "Shadows Over Greenwatch",
      "description": "Upon arrival, the party finds Greenwatch Village shrouded in worry over recent disappearances. Elder Mirna reveals that strange disturbances affect not just the village, but the entire region—corruption in the Verdantwood Wilds and ominous activity at Watcher's Rise. The party must investigate the village conspiracy while preparing for the greater regional threats.",
      "location": "GV001",
      "nextPoints": [
        "PP002"
      ],
      "status": "not started",
      "plotImpact": "Sets up the entire regional threat and village conspiracy. Party choices determine their reputation and resources for the wilderness expedition.",
      "sideQuests": [
        {
          "id": "SQ001",
          "title": "Village Secrets",
          "description": "Investigating the village reveals evidence of cultist activity and collaboration. The party can expose conspirators, negotiate clemency, or use the information strategically.",
          "involvedLocations": [
            "GV001"
          ],
          "status": "not started",
          "plotImpact": "Affects village support and determines who can be trusted for information about the regional threats."
        },
        {
          "id": "SQ002",
          "title": "The Cleansing Bell",
          "description": "Mirna asks the party to help lead a dawn ritual with the communal bell, believed to banish evil. Success strengthens the village's defenses against corruption from the Wilds.",
          "involvedLocations": [
            "GV001"
          ],
          "status": "not started",
          "plotImpact": "Provides protective blessing for wilderness travel and may weaken corruption encountered later."
        }
      ],
      "areaId": "GV001"
    },
    {
      "id": "PP002",
      "title": "Into the Corrupted Wilds",
      "description": "The party ventures into the Verdantwood Wilds, where unnatural corruption spreads from an ancient source. They must navigate treacherous swamp terrain, deal with bandits exploiting the chaos, and confront Kella of the Glades, whose misguided attempts to awaken an ancient guardian threaten to make the corruption worse.",
      "location": "VW001",
      "nextPoints": [
        "PP003"
      ],
      "status": "not started",
      "plotImpact": "The party's approach to the corruption and their handling of Kella determines whether the Wilds become an ally or obstacle for the final confrontation.",
      "sideQuests": [
        {
          "id": "SQ003",
          "title": "Bandit Lieutenant Karsk",
          "description": "The party can negotiate with, fight, or outsmart Bandit Lieutenant Karsk, who seeks to bind the ancient guardian for his assault on Watcher's Rise. Their choice affects the final dungeon's defenses.",
          "involvedLocations": [
            "VW001"
          ],
          "status": "not started",
          "plotImpact": "Determines whether bandits become allies, enemies, or are eliminated before the final confrontation."
        },
        {
          "id": "SQ004",
          "title": "Spirit's Bargain",
          "description": "A swamp spirit offers aid in exchange for a promise to cleanse Watcher's Rise. The party's decision creates a powerful ally or dangerous enemy for the climax.",
          "involvedLocations": [
            "VW001"
          ],
          "status": "not started",
          "plotImpact": "Provides crucial assistance at Watcher's Rise or leads to additional complications if the promise is broken."
        }
      ],
      "areaId": "VW001"
    },
    {
      "id": "PP003",
      "title": "Approaching Watcher's Rise",
      "description": "With the Wilds situation resolved, the party approaches the source of the regional corruption—the ancient fortress of Watcher's Rise. Strange red mist and unnatural vigilance emanate from cyclopean statues. The party must solve the entrance puzzle and prepare for the dangers within, their previous actions affecting the magical defenses they face.",
      "location": "WR001",
      "nextPoints": [
        "PP004"
      ],
      "status": "not started",
      "plotImpact": "Entry method and preparation determine the party's advantages in the final confrontation. Previous choices affect the dungeon's hostility level.",
      "sideQuests": [
        {
          "id": "SQ005",
          "title": "The Silent Watcher's Warning",
          "description": "A damaged statue offers fragmented warnings about the Curator Below if the party can repair or commune with it, potentially providing crucial knowledge for negotiation.",
          "involvedLocations": [
            "WR001"
          ],
          "status": "not started",
          "plotImpact": "Grants vital information for bypassing traps or successfully negotiating with Caretaker Voss."
        }
      ],
      "areaId": "WR001"
    },
    {
      "id": "PP004",
      "title": "The Vigilant Curator",
      "description": "Deep within Watcher's Rise, the party confronts Caretaker Voss, the ageless guardian whose corruption has spread throughout the region. The Curator judges the party based on all their previous actions—their handling of the village conspiracy, their approach to the Wilds, and their intentions for ending the cycle of corruption. This final confrontation can be resolved through combat, negotiation, or a complex ritual, depending on the party's accumulated choices and allies.",
      "location": "WR001",
      "nextPoints": [
        "PP005"
      ],
      "status": "not started",
      "plotImpact": "The resolution determines whether the regional corruption is ended permanently, contained, or spreads further. All previous choices culminate here.",
      "sideQuests": [
        {
          "id": "SQ006",
          "title": "The Gemstone Bargain",
          "description": "Caretaker Voss may be persuaded to end the corruption peacefully if the party can prove their good intentions throughout the region, offering unique rewards or responsibilities.",
          "involvedLocations": [
            "WR001"
          ],
          "status": "not started",
          "plotImpact": "Enables peaceful resolution and potentially grants the party guardianship over the cleansed site."
        }
      ],
      "areaId": "WR001"
    },
    {
      "id": "PP005",
      "title": "The Ranger's Departure",
      "description": "With the regional threats addressed, the party returns to Greenwatch Village where they reunite with Elen, who has completed her surveillance mission. She reveals that the corruption they faced was part of a larger supernatural incursion. With Greenwatch secure, Elen must depart alone on a critical mission to investigate reports of similar disturbances near Harrow's Hollow and the ominous Keep of Doom. She thanks the party but notes this new threat requires her specialized skills. The party's reputation with the Rangers is established based on their choices throughout the adventure.",
      "location": "GV001",
      "nextPoints": [],
      "status": "not started",
      "plotImpact": "Concludes the adventure and sets up Elen's departure to investigate the Keep of Doom, establishing the connection to future adventures. Party reputation affects future Ranger interactions.",
      "sideQuests": [],
      "areaId": "GV001"
    }
  ]
}