{
  "plotTitle": "Shadows Over Greenwatch",
  "mainObjective": "Investigate the recent disappearances in Greenwatch Village and uncover who or what is behind them.",
  "plotPoints": [
    {
      "id": "PP001",
      "title": "A Quiet Panic in Greenwatch",
      "description": "Upon arrival, the party finds Greenwatch Village shrouded in worry. Locals quietly mourn recent disappearances, with daily routines disrupted. The party is approached by Mirna the Village Elder, who implores them to investigate. Initial clues point toward strange night-time disturbances near the herb gardens and villagers who seem to know more than they admit.",
      "location": "R01",
      "nextPoints": [
        "PP002"
      ],
      "status": "not started",
      "plotImpact": "Sets the mystery’s tone, introduces key NPCs, and provides early suspicions and social hooks.",
      "sideQuests": [
        {
          "id": "SQ001",
          "title": "Moss & Memory",
          "description": "Willow the Herbalist asks for help gathering rare moon-moss, which only grows in forgotten corners of the village at night. Gathering it may reveal hidden paths or overheard secrets from lurking villagers.",
          "involvedLocations": [
            "R05"
          ],
          "status": "not started",
          "plotImpact": "May provide the party a shortcut to later clues and Willow’s trust."
        },
        {
          "id": "SQ002",
          "title": "Lost Ledger",
          "description": "Old Fenwick the Tavernkeeper has lost his ledger and suspects petty theft might be linked to the greater disappearances. If found, it may reveal names of recently missing patrons and strange late-night transactions.",
          "involvedLocations": [
            "R02",
            "R06"
          ],
          "status": "not started",
          "plotImpact": "May offer new suspects or evidence, and grants Fenwick’s goodwill."
        }
      ]
    },
    {
      "id": "PP002",
      "title": "Secrets Beneath the Clover",
      "description": "Investigating the gardens and alleys reveals evidence of secretive nighttime gatherings—strange footprints, trampled clover, and fragments of river-grass banners. Social encounters with wary villagers and Torren the Merchant unravel rumors of a shadowy figure seen moving between homes. The party discovers a hidden entrance to ancient cellars beneath the village.",
      "location": "R05",
      "nextPoints": [
        "PP003"
      ],
      "status": "not started",
      "plotImpact": "Uncovers the physical path to the source of the disappearances and the involvement of certain villagers.",
      "sideQuests": [
        {
          "id": "SQ003",
          "title": "Clover’s Watch",
          "description": "A young villager pleads for help in locating their missing sibling, last seen playing near the willow arches. Searching these areas can reveal a piece of jewelry and a secret message carved into a willow trunk.",
          "involvedLocations": [
            "R07",
            "R08"
          ],
          "status": "not started",
          "plotImpact": "May provide an NPC ally later or critical hints for the cellar’s secret entrance."
        }
      ]
    },
    {
      "id": "PP003",
      "title": "The Hidden Cellars",
      "description": "Descending into the root-choked cellars, the party finds evidence of ritual activity: symbols in chalk, discarded herbs, and trembling captives. Exploration and combat ensue as the party confronts a cultist cell orchestrating the disappearances, overseen by an enigmatic figure tied to the village’s history.",
      "location": "R09",
      "nextPoints": [
        "PP004"
      ],
      "status": "not started",
      "plotImpact": "Resolves who is responsible, provides direct confrontation, and reveals the deeper motive for the disappearances.",
      "sideQuests": [
        {
          "id": "SQ004",
          "title": "Herb of Olden Tears",
          "description": "A captive offers information in exchange for a rare healing herb known only to local lore. Finding it involves navigating dangerous, overgrown cellar tunnels.",
          "involvedLocations": [
            "R10"
          ],
          "status": "not started",
          "plotImpact": "Reveals the cult’s true objective or a safe method of disabling ritual wards."
        }
      ]
    },
    {
      "id": "PP004",
      "title": "Dawn Over Greenwatch",
      "description": "With the cult exposed, the party must decide the village’s fate: expose all collaborators, negotiate for clemency, or cover up the conspiracy for the greater good. The village’s mood shifts as sunrise casts light on new beginnings or lingering scars.",
      "location": "R01",
      "nextPoints": ["PP005"],
      "status": "not started",
      "plotImpact": "Offers a meaningful choice that determines Greenwatch’s future and the party’s reputation in the region.",
      "sideQuests": [
        {
          "id": "SQ005",
          "title": "The Cleansing Bell",
          "description": "Mirna asks the party to help lead a dawn ritual with the communal bell, believed to banish evil. Success could heal rifts among villagers and lessen fear, while failure may breed resentment or future threats.",
          "involvedLocations": [
            "R03"
          ],
          "status": "not started",
          "plotImpact": "Affects the final mood and unity of Greenwatch, and may grant a blessing or future contacts."
        }
      ]
    },
    {
      "id": "PP005",
      "title": "The Ranger's Departure",
      "description": "With Greenwatch secure, Elen reveals her true mission: establishing surveillance of growing supernatural threats in the region. She thanks the party but must depart alone on this critical watch. Mirna notes the party's skill for future needs.",
      "location": "R01",
      "nextPoints": [],
      "status": "not started",
      "plotImpact": "Establishes Elen's unavailability and creates connection to future adventures.",
      "sideQuests": []
    }
  ]
}