{
  "myths": {
    "The Plague": {
      "d6": 1,
      "d12": 1,
      "quote": "Birthed in air, spread by stream, lurking in the blood\nThe terror of our time will see us all stuck in the mud",
      "omens": [
        "An old coot proclaims their dreams, where foul air was choking people in their sleep. Pleads for help spreading the word.",
        "Moaning in the mist. An ivy-cloaked shack, home to a dying old couple. Their daughter left to search for treatment.",
        "Jolly hunter and his son with mild symptoms, chasing a smiling fox up a tree. They don't believe in the Plague, but claim the fox is a harbinger of death. The smiling fox wants to witness a death.",
        "A self-important Knight and two Squires, returning to report the Plague to the Seat of Power. Demands escort from other Knights. They carry a grey lantern, its light only visible to the carrier.",
        "A clearing, bonfire embers. An infected crowd, close to death, full of anger. They swear a blood oath on the stump of a red oak, seeing visions of revenge. They attack any caught watching.",
        "An infected village, the root of the Plague. All are visibly infected. Two Purging Knights, charging to cleanse with flame."
      ],
      "cast": [
        {
          "name": "The Angry Infected",
          "stats": "VIG 8, CLA 6, SPI 5, 2GD",
          "equipment": "Logging axe (d8 long)",
          "notes": "Those directly exposed must pass a VIG Save to avoid infection. Causes d6 VIG loss daily. There are treatments but no cures."
        },
        {
          "name": "Jolly Hunter, Maccan",
          "stats": "VIG 14, CLA 12, SPI 15, 4GD",
          "equipment": "Shortbow (d6 long), handaxe (d6)",
          "notes": ""
        },
        {
          "name": "Purging Knights, Dirmad & Duncas",
          "stats": "VIG 12, CLA 10, SPI 7, 5GD",
          "equipment": "A3 (mail, helm, shield), Flail (d8 hefty), shield (d4), 3 firepots (d6 blast, sets area alight)",
          "notes": "Twins, hate each other."
        }
      ],
      "deathly_malady_table": {
        "1": {
          "symptom": "Bleeding",
          "transmission": "Skin contact"
        },
        "2": {
          "symptom": "Choking",
          "transmission": "Breath"
        },
        "3": {
          "symptom": "Swelling",
          "transmission": "Bodily fluids"
        },
        "4": {
          "symptom": "Wasting",
          "transmission": "Ingestion"
        },
        "5": {
          "symptom": "Lethargy",
          "transmission": "Rats"
        },
        "6": {
          "symptom": "Convulsion",
          "transmission": "Flies"
        }
      }
    },
    "The Wall": {
      "d6": 1,
      "d12": 2,
      "quote": "Cutting through the land, a wonder two storms tall\nGuarding from invasion, or built to cage us all",
      "omens": [
        "Crumbling outpost. A band of labourers sharing a meal on their way to begin work repairing the Wall. They think Knights are being sent to stop them.",
        "Two giant magpies, stealing shiny things. They nest in the trees that root among the Wall's oldest stones.",
        "Lonesome Wall Knight sat among colossal tree roots. She's strayed from the Wall, bored, in search of a little company.",
        "Pair of wardens, stuck at the bottom of a muddy slope. They search for a bandit who climbed the Wall. One is paranoid, eating from a pot of moonlit honey known to protect against illusions.",
        "A pair of furious refugees, heading to break the wall after being driven out of their home. They drank oil from the hidden giant's well, granting a terrible strength. They don't trust Knights.",
        "A distant army lies beyond the wall. A mercenary Warband heads to break an opening for them."
      ],
      "cast": [
        {
          "name": "Wall Wardens, Brin, Catrona & Elish",
          "stats": "VIG 11, CLA 8, SPI 7, 4GD",
          "equipment": "A1 (visored helm), Wallerhook (d8 long, +d10 vs targets below)",
          "notes": ""
        },
        {
          "name": "Wall Knight, Annick",
          "stats": "VIG 13, CLA 10, SPI 8, 5GD",
          "equipment": "A2 (old mail, helm), Longaxe (d10 long)",
          "notes": "Excessive curiosity"
        },
        {
          "name": "Giant Magpie, Silverseeker",
          "stats": "VIG 6, CLA 14, SPI 5, 3GD",
          "equipment": "Beak and talons (2d6, wounded targets are blinded until they rest)",
          "notes": ""
        },
        {
          "name": "Empowered Refugees, Mohan & Orla",
          "stats": "VIG 18, CLA 8, SPI 9, 2GD",
          "equipment": "Giant punches (2d10)",
          "notes": "Drank oil from hidden giant's well"
        }
      ]
    },
    "The Shadow": {
      "d6": 1,
      "d12": 3,
      "quote": "They wandered over here and there, groan and grief their guide\nKnowing in the strongest one a timid child does hide",
      "omens": [
        "Huge flatstones marbled with moss. Weeping winds. Tears from the skies, trees, some forming on your cheek.",
        "Ornate well, now stagnant. Sorrowful Knight, inconsolable, lashing at anyone who doesn't give him sympathy.",
        "Idealistic young alchemist collecting wind-tears found in the weeping winds. Tries to invoke sadness in all he meets.",
        "A strange nasal-toned flute, left with scraps of cloth. Playing stimulates sudden grief. Lose d6 SPI, dream of the Shadow.",
        "The Shadow, still, by a drowning-lake. They torment trespassers with visions of past sorrows. The water whispers, answering one question on behalf of the dead each day. At morning, a herd of grey deer visit the lake to show their respects.",
        "The Company find themselves in the Shadow's world. Islands in the mist of time. The mourned past can be seen as clear as the now. None can die here, but all who leave lose d12 SPI. The Shadows are only appeased by displays of grief."
      ],
      "cast": [
        {
          "name": "Mourning Shadow, Vestige of Sorrow",
          "stats": "VIG 3, CLA 15, SPI 17, 2GD",
          "equipment": "Despair-of-flesh (d8 blast, wounds cause SPI loss in place of VIG)",
          "notes": "Can only be harmed by weapons forged by a creator mourned by the wielder. Repelled by earth from a burial mound, or funerary imagery. Destroyed if entombed."
        },
        {
          "name": "Sorrowful Knight, Orwan",
          "stats": "VIG 12, CLA 8, SPI 6, 2GD",
          "equipment": "A3 (mail, greencloaked plate, helm), Hooked greatsword (2d10 long), oak necklace",
          "notes": ""
        },
        {
          "name": "Roaming Alchemist, Coalin",
          "stats": "VIG 7, CLA 10, SPI 11, 1GD",
          "equipment": "Dagger (d6), alchemical tools",
          "notes": ""
        }
      ]
    },
    "The River": {
      "d6": 1,
      "d12": 4,
      "quote": "Stream, fall, brook, and creek, flow along as one\nFamine, flood, friend and foe, all things beneath the sun",
      "omens": [
        "Six monks, appeasing the River with offerings of bread. Their apparent leader is annoyingly vivacious and optimistic about their work tending to the River.",
        "Lost fisherman washed up on the riverbank. A mighty newt is sniffing around the shaken man.",
        "A rocky outcropping, a lone dead tree at its peak. Three monks seek a blood offering for the River. They need an innocent animal or a sinful person.",
        "Pilgrims arguing with a Bridge Knight chasing a toll. The Knight knows one of the pilgrims has a coin from the City and will take it by force if necessary.",
        "The River bursts into a new stream. If travelling, the route is cut off. For the first few moments, water from the newborn stream can heal any ailment.",
        "A great flood as the River gives birth to a new lake. It claims the entire Hex and spreads to neighbouring Hexes tomorrow. A spawning of mighty newts bursts forth the next day."
      ],
      "cast": [
        {
          "name": "Mighty Newt, Slippery Starback",
          "stats": "VIG 16, CLA 14, SPI 5, 5GD",
          "equipment": "Crushing toothless bite (d8, drag into water)",
          "notes": "Flees if Wounded, regenerating quickly before seeking petty revenge. Feared by all venomous beasts."
        },
        {
          "name": "River Monks, led by Refton",
          "stats": "VIG 10, CLA 10, SPI 12, 2GD",
          "equipment": "Cudgels (d8 hefty), bread, mead barrels",
          "notes": ""
        },
        {
          "name": "Bridge Knight, Tog",
          "stats": "VIG 15, CLA 15, SPI 6, 6GD",
          "equipment": "A2 (ringmail, redshield), Hooksword (2d6 hefty), redshield (d4), heavy coffer of toll money",
          "notes": ""
        }
      ]
    },
    "The Wyvern": {
      "d6": 1,
      "d12": 5,
      "quote": "All jack-a-jaw and neck a knot'd string\nAll fess-a-wing and tail a bane'd sting",
      "omens": [
        "Crowned stag, crawling, poisoned. Its antlers are known to burn scaled beasts.",
        "A burial mound surrounded by a low stone wall. Much of it has been dug up, petty treasures scattered. The Wyvern screeches in the distance.",
        "The bloated body of a poisoned Knight, adoring Squire weeping at their side.",
        "Two foul eggs laid among battle carrion. The air feels sour. The poisonous young hatch at dark, share a feast, then lurch in opposite directions. A serrated blade forged with pain (2d6) lies with the dead.",
        "The Wyvern soars low, seeking revenge for a failed attack on its nest. The attackers have already fled. It clutches one of their silver shields (d6, A1), blessed by the iron willow.",
        "Fearing for its nest, the Wyvern lands to fight. If the situation is hopeless it flies to a neighbouring Realm, plotting revenge."
      ],
      "cast": [
        {
          "name": "The Wyvern, That Foul Twisted Reptile",
          "stats": "VIG 17, CLA 17, SPI 5, 12GD",
          "equipment": "A2 in flight, A4 on ground (cowering wings), Bite & throw (3d10, slow when grounded) or sting (d10, wound causes bloating death within an hour unless thoroughly washed out with fresh milk)",
          "notes": "Disgusted by the sound of a baby's cry. Fast but clumsy flyer."
        },
        {
          "name": "Its Poisonous Young",
          "stats": "VIG 5, CLA 10, SPI 2, 3GD",
          "equipment": "A1 (cold hide), Thrash (d8, carries its mother's poison)",
          "notes": ""
        }
      ]
    },
    "The Goblin": {
      "d6": 1,
      "d12": 6,
      "quote": "On toes it crept just out o' sight\nThe petty hoarder full o' spite",
      "omens": [
        "Weeping huntsman, cursing everyone. Looking for his lost bloodhound who tended to him during injury.",
        "A lost lad, full of stories. Claims a little old man called him into the woods.",
        "Oppressive branches, tripping roots. A cloaked old man calls out, lost. If alerted he cries out just before he is dragged into the ground, taken to the lost realm.",
        "The lost pets are running wild. If spotted they immediately run back toward the secret door to the lost realm. One drops a strange metallic bone, repellent to birds.",
        "A dark clearing. Any deals made here are bound by fate. The Goblin offers a trade. A valuable lost thing in return for a favour he can call in later.",
        "Suddenly dragged to the realm of lost things. Tunnels under piles of bric-a-brac. The Goblin gloats from atop his pile. Freedom is only granted for a binding favour, which the Goblin will enforce."
      ],
      "cast": [
        {
          "name": "Their Cleverness, the Goblin, Lord of all Lost Things",
          "stats": "VIG 7, CLA 16, SPI 15, 9GD",
          "equipment": "Bony needle (d6 +d10 to anybody indebted to the wielder), sack of favourite lost things",
          "notes": "Can only be harmed by objects that have lain lost for at least ninety-nine years. Can Focus."
        },
        {
          "name": "Lost Pets",
          "stats": "VIG 5, CLA 10, SPI 5, 2GD",
          "equipment": "Yapping, biting, and scratching (d6)",
          "notes": ""
        },
        {
          "name": "Lost Lad, Roth",
          "stats": "VIG 7, CLA 9, SPI 9, 3GD",
          "equipment": "Practice bow (d4, long)",
          "notes": ""
        }
      ]
    },
    "The Forest": {
      "d6": 1,
      "d12": 7,
      "quote": "Roots deeper than soil, farther than sea\nNo passage is swift, no figments believed",
      "omens": [
        "A Seer, beloved by her village, now trapped, inert in ironwood. Only the Fearmonger can break their binds.",
        "A winding path beneath blue songbirds. They sing so fiercely that some lie breathless on the ground. The winding path leads to a distant forest Hex.",
        "The mother tree. Six woodland guardians attack anybody who looks upon it. Foxes, wolves, and wildcats fight as one.",
        "The Fearmonger in horrific form, parts of owl, boar, and mouse. Lurking in the mist, they hurl a thorn spear (d10 hefty, cannot be taken from the Forest) before retreating to the branches.",
        "A circle of blackened tree stumps. Inside, metal weapons roar with burning heat unless dropped. Then come the three great guardians: stag, boar, and bear. The Fearmonger preys from within the mist.",
        "The Fearmonger shows their true, terrible form as live, writhing wood. If they cannot be subdued the Forest bursts forth into the rest of the Realm."
      ],
      "cast": [
        {
          "name": "The Fearmonger in Wood, Glaiburn",
          "stats": "VIG 17, CLA 16, SPI 12, 8GD",
          "equipment": "A2, A4 vs forged arms (rune-carved wood), Slash (d10 vs two targets) or grasp (2d10 slow) or spores (everyone in Blast loses their speech until they leave the Forest)",
          "notes": "Can Smite humans."
        },
        {
          "name": "Woodland Guardians, Fox, Wolf & Cat",
          "stats": "VIG 10, CLA 13, SPI 5, 3GD",
          "equipment": "Tooth and claw (2d6)",
          "notes": ""
        },
        {
          "name": "Great Guardians, Stag, Boar & Bear",
          "stats": "VIG 14, CLA 10, SPI 5, 5GD",
          "equipment": "A1 (thick hides), Tusk and maul (2d8)",
          "notes": ""
        }
      ],
      "verdy_maze_table": {
        "1": {
          "place": "Entwined wall of trunks and roots",
          "threat": "Riders approaching"
        },
        "2": {
          "place": "Descent into damp earth",
          "threat": "Frantic movement in the branches"
        },
        "3": {
          "place": "Mossy stone pile",
          "threat": "Twisting in the roots"
        },
        "4": {
          "place": "Leafy clearing",
          "threat": "Fading light"
        },
        "5": {
          "place": "Tree bridge",
          "threat": "Rising mist"
        },
        "6": {
          "place": "Trailway",
          "threat": "Watching eyes"
        }
      }
    },
    "The Child": {
      "d6": 1,
      "d12": 8,
      "quote": "When night met day, where water flame\nThey saw the child, rejoiced in name",
      "omens": [
        "Drunken worshippers of the Child, rejoicing that the first sign has arrived. Mistrustful of anybody that won't join in.",
        "3 Seeker Knights and their redmaw wolf, escorting a Seer in the hunt for the Child, who they believe to be the key to the City.",
        "Fog shrouded lake, no deeper than a foot throughout. A rogue Seeker Knight searches for the Child, who they believe must be sacrificed to an awful creature in order to put it to rest for good. You're either with them or against them.",
        "An abandoned shack, empty cradle. A snake fang rattle, known to repel the wicked dead. The Burning Mother cries out in the distance. Any who look upon her are attacked on sight.",
        "A silvery waterfall. Metal placed within is repaired. Distant cheering and crying as the second sign comes into effect.",
        "At last they are here. A cradle of mist, the Child within. d6 Seeker Knights are here to kill them, another d6 here to protect and take them back to their Realm."
      ],
      "cast": [
        {
          "name": "The Promised Child",
          "stats": "VIG 2, CLA 2, SPI 18, 1GD",
          "equipment": "",
          "notes": "No human can wilfully cause them harm."
        },
        {
          "name": "Seeker Knights, Feliz, Gornig & Tayley",
          "stats": "VIG 14, CLA 12, SPI 12, 5GD",
          "equipment": "A3 (halfshield, mail, helm), Morningstar (d8 hefty), halfshield (d4)",
          "notes": ""
        },
        {
          "name": "Redmaw Wolf, Greymender, Scartooth",
          "stats": "VIG 14, CLA 10, SPI 5, 5GD",
          "equipment": "A1 (matted fur), Stalk and bite (2d8)",
          "notes": "Can bite out a wound to restore d6 VIG"
        },
        {
          "name": "The Burning Mother",
          "stats": "VIG 10, CLA 16, SPI 17, 7GD",
          "equipment": "Body aflame (ignores metal and wood), Fire (d8 blast) or grasp (3d8, slow)",
          "notes": ""
        }
      ],
      "the_signs_table": {
        "1": {
          "first_sign": "Golden flowers",
          "second_sign": "Harvest of snakes"
        },
        "2": {
          "first_sign": "Violet sunrise",
          "second_sign": "Sudden winter"
        },
        "3": {
          "first_sign": "Singing swans",
          "second_sign": "Night terrors"
        },
        "4": {
          "first_sign": "Milk to honey",
          "second_sign": "Sleeping mist"
        },
        "5": {
          "first_sign": "Chimes from below",
          "second_sign": "Earthquake"
        },
        "6": {
          "first_sign": "Miraculous cures",
          "second_sign": "Burning graves"
        }
      }
    },
    "The Order": {
      "d6": 1,
      "d12": 9,
      "quote": "They were six in the circle, no first among them\nEach a knight and scholar, master and student",
      "omens": [
        "A forge carved into the rock. Blacksmiths complaining about the Order's mistreatment of them. They want justice.",
        "A Company of the Order, seizing supplies from local farmers. A frightened draft horse is bolting. The froth from its mouth causes a great frenzy if touched. A fight is about to break out.",
        "A dry clearing among boggy willow wood. The Order hold council, stood in a circle. Each must justify themselves to their peers, who can challenge any weakness. No spectators allowed.",
        "They are transporting a thief. The thief knows the burial place of a suit of silver plate (A1, immunity to weapons of inferior metal) and reveals this if freed.",
        "A Company rides on the trail of a monstrous beast. You're in their way.",
        "A Company leads an attack toward the nearest Holding. They have 3 Warbands alongside their retinue. They will lead the Realm into misrule or be driven beyond its borders."
      ],
      "cast": [
        {
          "name": "Scholar-Knight of the Order",
          "stats": "VIG 16, CLA 16, SPI 8, 9GD",
          "equipment": "A4 (mail, plate, towerhelm, shield), Thicksword (2d6 hefty), shield (d4), Crusher steed (4GD, A1, d10 trample)",
          "notes": ""
        },
        {
          "name": "Frightened Draft Horse",
          "stats": "VIG 15, CLA 6, SPI 2, 2GD",
          "equipment": "Kick (d6)",
          "notes": "Cannot be calmed by any carrying a weapon."
        }
      ]
    },
    "The Dead": {
      "d6": 1,
      "d12": 10,
      "quote": "Corpses wrent of soul, their resting spirit torn\nPulled by malice from their sleep to serve anew, unborn",
      "omens": [
        "Children playing \"the skeleton game\", wearing wooden skull-masks and throwing bones at passers-by.",
        "Terrified scout sisters, reporting wandering corpses on their patrol. Won't rest until taken seriously.",
        "Under Seer's orders, a graveyard is being burned as a precaution against the restless dead. Acolytes scatter dried herbs. Five great red vultures circle.",
        "A rotting corpse, mimicking its life as a forager. It is tethered to a nearby tree by a steel rope of impossible construction.",
        "Five skeletons, mocking bones, powered by hatred for the living, tormenting defenceless travellers. The travellers are artisans, known for their ability to make fine weapons out of certain woods.",
        "3 Warbands of rotting corpses and mocking bones, rising under a black banner, marching on the nearest Holding."
      ],
      "cast": [
        {
          "name": "A Rotting Corpse, Denied their Rest",
          "stats": "VIG 10, CLA 2, SPI 1, 1GD",
          "equipment": "A1 (tattered mail), Rusted glaive (d10 slow)",
          "notes": "Keeps fighting even after a Mortal Wound. Running water causes d12 Damage."
        },
        {
          "name": "Mocking Bones Conjured into Service",
          "stats": "VIG 6, CLA 10, SPI 1, 3GD",
          "equipment": "A1 (brass shield), Impair piercing attacks, Hook falx (d6), brass shield (d4)",
          "notes": "Running water causes d12 Damage."
        },
        {
          "name": "Great Red Vulture, Grizzlebird",
          "stats": "VIG 15, CLA 6, SPI 5, 3GD",
          "equipment": "Rip and tear (d8)",
          "notes": "Burned and ground feathers are known to charm vermin into obedience. Completely silent under moonlight."
        }
      ],
      "cost_of_unlife_table": {
        "1": {
          "raised_by": "Noble intentions",
          "the_cost": "Intolerance of sunlight"
        },
        "2": {
          "raised_by": "A paranoid castellan",
          "the_cost": "Hatred of plant life"
        },
        "3": {
          "raised_by": "An ambitious bandit",
          "the_cost": "Putrid stink"
        },
        "4": {
          "raised_by": "A deal with death",
          "the_cost": "Vulnerability to fire"
        },
        "5": {
          "raised_by": "A curious Seer",
          "the_cost": "Craven cowardice"
        },
        "6": {
          "raised_by": "A lonely apothecary",
          "the_cost": "Insatiable hunger"
        }
      }
    },
    "The Underworld": {
      "d6": 1,
      "d12": 11,
      "quote": "A place beneath our living world, but neither grave nor tomb\nA different path to places far, for those who brave the gloom",
      "omens": [
        "A huge stone archway, former temple. Stars flicker in the shadows. White ravens caw from the trees. An opening appears in the arch, dark but light at once. Then all is normal again.",
        "Lost Knight from a distant place. She claims to have fallen through a shadow. A Shrouded Guide follows, seeking the toll.",
        "Narrow, twisted cave. Clanging within. A shrouded smith is forging a coldsword (2d8 hefty, ignores metal armour). It shatters if unsheathed in daylight.",
        "Heavy black cloth woven with indigo. If hung, opens to a place you want to be. Within, a dozen hands in the darkness require a toll of silver or blood. They will take either by force if needed.",
        "Broad, lilac-leaved trees. No artificial light can shine beneath. Five Shrouded Guides seeking to claim an owed toll.",
        "A creeping darkness, then suddenly within the Underworld. A dark reflection of our world. Without a Shrouded Guide the only exit is into a distant Realm."
      ],
      "cast": [
        {
          "name": "Shrouded Guides, Hooded Ones",
          "stats": "VIG 5, CLA 18, SPI 15, 4GD",
          "equipment": "Coldsword (2d6 hefty, ignores metal armour), pale lantern (2d8 blast if thrown)",
          "notes": "If slain, two more emerge from the dark."
        },
        {
          "name": "Grasping Hands from the Dark",
          "stats": "VIG 10, CLA 10, SPI 2, 1GD",
          "equipment": "Cold grasp (d6, on a Wound lose d8 SPI)",
          "notes": ""
        },
        {
          "name": "Lost Knight, Valenta",
          "stats": "VIG 13, CLA 10, SPI 10, 5GD",
          "equipment": "A3 (mail, helm, shield), Jagged sword (2d8 hefty), shield (d4), locket",
          "notes": ""
        }
      ],
      "voice_in_darkness_table": {
        "6": {
          "voice": "Chattering in the cold",
          "effect": "Sow discontent"
        }
      }
    },
    "The Wurm": {
      "d6": 1,
      "d12": 12,
      "quote": "Callous, cruel, awful, and long\nFeasting far beyond its hunger, only happy in bloated rest",
      "omens": [
        "A leech-collector weeps. In a nearby swamp the colossal thing snatched her sister away with a bite. That bone-grinding noise haunts her.",
        "An argumentative sage complains. The balance of nature has been tipped. The birds aren't behaving correctly and there's not enough prey in the woods.",
        "A logging camp, crushed. Barrels of limeweed, a pungent appetite suppressor, left untouched. A Wurmshield surveys their master's work with unearned pride.",
        "A stinking grey salt-bog. Grinding laughter can be heard on the wind as the Wurm sleeps below, dreaming of the next feast. Two Wurmshields keep watch, arguing over who is more loyal.",
        "The Wurm lounges on smashed burial mounds of Seers. It speaks with four Wurmshields, loyal but poor company.",
        "The Wurm bursts from the ground, giving one opportunity for stimulating conversation before its great feast begins. It will not stop until bloated or dead."
      ],
      "cast": [
        {
          "name": "The Wurm, the Colossal Spite-Glutton",
          "stats": "VIG 18, CLA 8, SPI 5, 10GD",
          "equipment": "A3 (craggy hide), Writhe (d10 blast) or chew (3d10 slow) or shower with debris (d8 blast)",
          "notes": ""
        },
        {
          "name": "Wurmshields, Kermac, Cado, Zune, Shena, Marlo, Yazakel",
          "stats": "VIG 10, CLA 12, SPI 8, 2GD",
          "equipment": "A2 (helm, red halfshield), Spike mace (d8 hefty), red halfshield (d4)",
          "notes": "Repugnant personalities, always trying to make themselves even worse by mimicking the Wurm."
        }
      ]
    },
    "The Pack": {
      "d6": 2,
      "d12": 1,
      "quote": "Woods and moors or paddock and rein\nWolves alone chomp at the chains",
      "omens": [
        "Wailing shepherd. His sheepdogs have slaughtered their flock and fled. Crows feast on the gore. His family are hungry.",
        "A band of poets and scribes fight among themselves, unable to speak except snarling growls. The Pack watch from a nearby hill, scattering if disturbed. When they leave, the wanderers' voices return.",
        "A rival fighting the leader. 6 wolves guard against interruption. They favour the challenger. The leader is toying with him and tears his throat when he gets bored.",
        "The wind suddenly stops, then the sound of jaws lapping at air. Then the howl, rough and screeching. Countless howls join the call, air completely still. Soon the howl stops and the wind returns.",
        "An important trade road has been blockaded by savagely torn trees and heaps of soil wet with blood.",
        "The 13 wolf pack howls in their den, setting their sights on a nearby Dwelling or Holding, attacking the humans and their broken beasts in dark or mist."
      ],
      "cast": [
        {
          "name": "The Pack Leader, One-ear",
          "stats": "VIG 15, CLA 15, SPI 7, 8GD",
          "equipment": "A1 (scarred hide), Great jaws (2d8)",
          "notes": "Zero tolerance for civility"
        },
        {
          "name": "Pack Wolves, Scruff, Scrag, Scab, Runt",
          "stats": "VIG 10, CLA 12, SPI 3, 4GD",
          "equipment": "Jaws (d8)",
          "notes": "Loving hatred for their leader"
        },
        {
          "name": "Wailing Shepherd, Nayl",
          "stats": "VIG 10, CLA 10, SPI 6, 2GD",
          "equipment": "Crook (d6 hefty)",
          "notes": "Broken heart"
        },
        {
          "name": "Glutton Crow, Fatteth Rollybird",
          "stats": "VIG 6, CLA 16, SPI 5, 2GD",
          "equipment": "Beak (d6)",
          "notes": "Insatiable appetite, cannot eat grain or fruit"
        }
      ],
      "pack_fighting_tactics_table": {
        "1": {
          "tactic": "Target the strong",
          "special": "Slip into shadow"
        },
        "2": {
          "tactic": "Bite their legs",
          "special": "Drag one away"
        },
        "3": {
          "tactic": "Terrorise them",
          "special": "Never let them sleep"
        },
        "4": {
          "tactic": "Start a fire with claw and stone",
          "special": "Attack their intended destination instead"
        },
        "5": {
          "tactic": "Disarm them with jaw",
          "special": "Stay just out of reach"
        },
        "6": {
          "tactic": "Target the weak",
          "special": "Go and dig a pit trap"
        }
      }
    },
    "The Eye": {
      "d6": 2,
      "d12": 2,
      "quote": "The sight of the eye opened my own\nIn its gaze I am never alone",
      "omens": [
        "Nothing more than the hollow grunts of moon toads in the roots. When the Knights sleep they share a dream of a great eye sprouting from the ground.",
        "An elderly tanner has been banished from her home for sowing discord. She dreamt embarrassing truths about her neighbours and couldn't resist sharing.",
        "Grey birds watch from the branches. When scattered they flutter about in a spiralling circle before dispersing.",
        "Five acolytes march toward the nearest settlement. They aim to tear down walls so that all can be revealed to the Eye.",
        "A parade of dozens of acolytes, wheeling a wooden wagon carrying a boulder painted with a spiral eye. It is a peaceful parade, but they warn the ascent is coming.",
        "A rumbling below, then the Eye rises from the earth. Acolytes run to be near. It sprouts legs and begins to march toward the nearest Seer, aiming to devour them for their knowledge before returning to the earth."
      ],
      "cast": [
        {
          "name": "The Eye, Manifested in Stone",
          "stats": "VIG 18, CLA 3, SPI 15, 9GD",
          "equipment": "A4 (stone body), Trample (d10 blast) or devour (3d10 slow)",
          "notes": "Longs to devour the wise."
        },
        {
          "name": "Moon Toad, Silvertongue",
          "stats": "VIG 3, CLA 3, SPI 3, 1GD",
          "equipment": "Attractive floral aroma",
          "notes": "Any that lick the toad have their bite imbued with a sleeping sickness. The infusion and any sleep caused by a bite lasts until the biter next sleeps."
        },
        {
          "name": "Acolytes of the Eye",
          "stats": "VIG 10, CLA 10, SPI 12, 2GD",
          "equipment": "Club (d8 hefty), blacked-over eyes",
          "notes": "Gleeful anticipation"
        }
      ]
    },
    "The Blade": {
      "d6": 2,
      "d12": 3,
      "quote": "There it gleam'd as glore in meadow's sight\nThat star-forged blade amark of warborne plight",
      "omens": [
        "A booming voice singing in the distance. A travelling cook belts out songs about the Blade's previous owners, each reaching a tragic end (see opposite).",
        "A cliff-side village, ruined long enough to be overgrown with moss and thorns. In a ruined chapel an altar is inscribed with: Forsake in earth, unbroke by time / Afore first draw, that greedsome war",
        "Band of 5 cutthroats think the Knights have the Blade or know its whereabouts.",
        "Down a spiral of natural steps, a bloodied sharpening wheel screams on the wind. Can sharpen blades to a keen edge (+d8) but they break after their first Wound.",
        "A cave concealed by a steaming waterfall is the resting place of the Scabbard, which destroys any blade placed inside. The waterfall scalds (d10) anybody wielding a weapon, harmless to the unarmed.",
        "A louse-infested dead forest. The Blade lies within, but travellers are lured by visions of something they truly desire."
      ],
      "cast": [
        {
          "name": "The Blade, Sifrex, Ilglamvent",
          "stats": "2d8 hefty, wounded targets are utterly destroyed",
          "equipment": "The Blade's wielder loses d6 SPI after each Attack",
          "notes": ""
        },
        {
          "name": "Cutthroats, Colan, Fia, Elga, Ness, Ruac",
          "stats": "VIG 10, CLA 10, SPI 7, 2GD",
          "equipment": "Longknife (d6), 2 javelins (d6)",
          "notes": "Colan has a halfshield (d4, A1), angelic features, never sleeps, can Focus. He is truly bloodthirsty; the others less so."
        },
        {
          "name": "Granddad Louse, Rollyromple, Rockbug",
          "stats": "VIG 12, CLA 5, SPI 2, 5GD",
          "equipment": "A2, or A4 when rolled up (plated shell), Scuttering bite (2d6)",
          "notes": "Hungers for wooden items to hide in its lair and eat later. Fancy items appeal most."
        }
      ],
      "past_wielders_table": {
        "1": {
          "name": "Erdyg, Shamed Knight",
          "tragic_end": "Throat cut"
        },
        "2": {
          "name": "Belwin, River Bandit",
          "tragic_end": "Hanged from tree"
        },
        "3": {
          "name": "Gwelhelm, Butcher",
          "tragic_end": "Poisoned feast"
        },
        "4": {
          "name": "Ordrig, Tower Guard",
          "tragic_end": "Crushed by boulder"
        },
        "5": {
          "name": "Regan, Cup Knight",
          "tragic_end": "Lost underground"
        },
        "6": {
          "name": "Lervlin, Squire",
          "tragic_end": "Drowned in river"
        }
      }
    },
    "The Legion": {
      "d6": 2,
      "d12": 4,
      "quote": "Pitly ranks, fought and fell, returning stronger still\nTheir scars nae fade, their fear but grow, their war their only will",
      "omens": [
        "A field littered with martial detritus. Broken helms, shields, and bodies. The mud grabs at those passing over, groans on the wind. A lean horse is trying to pull its dead rider from the ground to no avail.",
        "A lone legionnaire deserter. Can only grunt in cowardice, scouring the land for a place to hide. A pack of 5 legionnaires are tracking them, minutes away.",
        "A local militia are camped, recovering from a clash with the Legion. Few are dead, but the wounded cry in agony. The lacerations of the Legion's barbed blades are as fresh as when they were cut.",
        "A Legion Warband on the horizon, firing their arrows at the farthest possible range. Break into retreat if approached.",
        "A new legionnaire pulling themselves from the earth. Pained, clutching rusted arms. Seeks the comfort of the Legion.",
        "Three Legion Warbands invade the nearest Holding. If defeated they return in greater ranks. The war only ends if they are driven into fire or water."
      ],
      "cast": [
        {
          "name": "Legionnaires, Born of Mud and Blood",
          "stats": "VIG 15, CLA 5, SPI 5, 3GD",
          "equipment": "A3 (rusted mail, helm, shield), Barbed blade (d8), shield (d4), bow (d6 long), all deal wounds that resist natural healing",
          "notes": "Fear of death. No purpose beyond war."
        },
        {
          "name": "Graveyard Horse, Greyveil",
          "stats": "VIG 10, CLA 10, SPI 5, 2GD",
          "equipment": "",
          "notes": "Instinctive reverence for the dead, always knows where they should be taken to."
        },
        {
          "name": "Local Militia, Untrained Serfs",
          "stats": "VIG 10, CLA 10, SPI 10, 2GD",
          "equipment": "Polearms (d10 long), patchwork uniforms",
          "notes": ""
        }
      ]
    },
    "The Imp": {
      "d6": 2,
      "d12": 5,
      "quote": "In scaldrine thrall we must endure\nNeath smoldant flame chained evermore",
      "omens": [
        "A trail, glittering dust on the surface. A moment later, a flash ignites five dancing white flames that torment the travellers. They vanish once they have caused pain.",
        "Smouldering heat can be felt from the shadows of looming trees. The darkness itself burns (d6 Damage) any within, but does not set things alight. The shadows return to normal after this Phase.",
        "A fluttering swarm of bats descend on the Knights. They are in the thrall of the Imp, flying to him after they have drawn blood.",
        "A feast is laid out on a grand table that shouldn't be here. If they partake he appears and plays some impish pranks. If they refuse he attacks with his black fire.",
        "The trail turns to a maze, smoke rolling in, soon surrounded by walls of flame. He releases the victims when they are adequately frustrated.",
        "He is holding court, arguing with eight foxes in their language. If their meeting is allowed to conclude he stomps away, banished by their words."
      ],
      "cast": [
        {
          "name": "The Imp, Scaldris, Child of Black Flame",
          "stats": "VIG 6, CLA 17, SPI 17, 10GD",
          "equipment": "Claws (2d4) or black flame (d6 blast)",
          "notes": "Feeds on frustration and pain."
        },
        {
          "name": "Foxes of the Imp's Court",
          "stats": "VIG 5, CLA 15, SPI 6, 4GD",
          "equipment": "Bite (d4), smouldering tails",
          "notes": ""
        },
        {
          "name": "Enthralled Bat Swarm",
          "stats": "VIG 5, CLA 10, SPI 3, 7GD",
          "equipment": "Bites (3d6), individual attacks are Impaired unless they are Blast attacks",
          "notes": ""
        },
        {
          "name": "Dancing White Flame",
          "stats": "VIG 3, CLA 10, SPI 6, 2GD",
          "equipment": "Burn (d6, ignoring armour)",
          "notes": "Cannot be harmed by physical attacks."
        }
      ],
      "impish_pranks_table": {
        "1": {
          "transform": "Item of clothing",
          "into": "Wormy earth"
        },
        "2": {
          "transform": "Bed sheets",
          "into": "Bog peat"
        },
        "3": {
          "transform": "Food",
          "into": "Hot ash"
        },
        "4": {
          "transform": "Pet",
          "into": "Choking smoke"
        },
        "5": {
          "transform": "Heirloom",
          "into": "Fatty grease"
        },
        "6": {
          "transform": "Flowers",
          "into": "Vinegar-soaked rags"
        }
      }
    },
    "The Troll": {
      "d6": 2,
      "d12": 6,
      "quote": "Each stab, each cut, each severance, regrown in warpsome matter\nAll stretched and swollen, big and bent, a groaning soul atatter",
      "omens": [
        "In an itchy marsh, a severed, rubbery arm pulls itself along. Claws at anybody that interferes. Has no sense of direction, eventually withering to dense, dead flesh.",
        "A tiny chameleon watches from a crooked branch. Hisses a warning if anybody passes near, stirring the Troll in the nearby trees, fleeing back to its home.",
        "A burglar is fleeing from an abandoned cave, a home carved into the earth. Clumsy furniture cobbled from rock and mud. Blood on the ground, smashed bones, another dead troll limb. The burglar found nothing of value in there.",
        "The Troll drags a dying warhorse back toward its new cave. A Knight lays dead.",
        "Bronze, shimmering pond amongst a bog of fly-infested reeds. Disturbing the water grants a vision of the Troll being attacked by soldiers with axes, hacking the creature to bits.",
        "Split from head to pelvis, the Troll holds itself together as it rampages, craving meat to aid the regeneration."
      ],
      "cast": [
        {
          "name": "The Troll, Cursed to Endure",
          "stats": "VIG 18, CLA 5, SPI 6, 7GD",
          "equipment": "A2 (rubbery skin), Flailing limbs (2d10)",
          "notes": "Regains d12 VIG at the start of its turn. Can slowly regenerate from any harm at all, but burning takes an Age to recover. Loves their pet chameleon."
        },
        {
          "name": "Troll Arm",
          "stats": "VIG 5, CLA 5, SPI 1, 1GD",
          "equipment": "A2 (rubbery skin), Claw (d6)",
          "notes": ""
        },
        {
          "name": "Clumsy Burglar, Sammesrede",
          "stats": "VIG 12, CLA 7, SPI 16, 4GD",
          "equipment": "Baton (d6), prying tools, injured leg",
          "notes": "Honest, amoral and shameless."
        }
      ]
    },
    "The Demon": {
      "d6": 2,
      "d12": 7,
      "quote": "Slumber stirred by rising blackened sun\nA mocking voice conceals the fiendsome one",
      "omens": [
        "The bloody remains of an ivory goat, its innards laid out in a broad spiral. White goats are never eaten, thought to be reincarnations of Seers from the past.",
        "A singer, beating a drum. They sing cruel lyrics about the Knights, knowing more than they possibly could. They utterly ignore the Knights, even if apprehended.",
        "In a meadow, a band of drunks are feeding a bonfire, growing out of control. They openly praise the Writher Within, gloating that he's coming to eat the Seers and free us from their lies.",
        "The sun is black, gold light flooding from its corona. Animals panic, Seers are blinded. This lasts until the next sunrise.",
        "A once-beloved Knight now rampages through the Realm slaughtering serfs. Her head has sprouted a curved horn on one side, all humanity now gone.",
        "A bloated serf is being dragged away before bursting in a red mist. The Demon emerges from within in their true form, not resting until they have eaten 7 Seers."
      ],
      "cast": [
        {
          "name": "The Demon, Ul-Huroc, Writher Within",
          "stats": "VIG 15, CLA 15, SPI 15, 8GD",
          "equipment": "A4, bypassed by weapons drenched in Seer-blood (twisted hide), Rip (d6) and lash (d8) and gore (d10)",
          "notes": "Can rip over any distance."
        },
        {
          "name": "Drunks, Eonah, Nissi, Franga",
          "stats": "VIG 10, CLA 4, SPI 9, 2GD",
          "equipment": "Aspects of the possessed (see below)",
          "notes": "Awaiting the Demon, nothing else to live for."
        },
        {
          "name": "Once-beloved Knight, Ethne, Possessed",
          "stats": "VIG 15, CLA 8, SPI 3, 7GD",
          "equipment": "A2 (bloody mail, helm), Longsword (2d8 hefty)",
          "notes": "Now knows nothing beyond slaughter."
        }
      ],
      "possessed_aspects_table": {
        "1": {
          "appearance": "Swollen head",
          "behaviour": "Fiery temper"
        },
        "2": {
          "appearance": "Bloody teeth",
          "behaviour": "Sinister whisper"
        },
        "3": {
          "appearance": "Writhing veins",
          "behaviour": "Total amnesia"
        },
        "4": {
          "appearance": "Hot breath",
          "behaviour": "Morbid cruelty"
        },
        "5": {
          "appearance": "Protruding bones",
          "behaviour": "No boundaries"
        },
        "6": {
          "appearance": "Withered tongue",
          "behaviour": "Paranoid delusions"
        }
      }
    },
    "The Sea": {
      "d6": 2,
      "d12": 8,
      "quote": "A briny tempest churns, jaden tides all swell\nThe ringen path entwines with looming ocean's spell",
      "omens": [
        "On glittering rapids, a shepherd is being attacked by 8 wolfcrabs, usually only seen scavenging on beaches.",
        "Salty rain batters the land, web-like weed hanging from the trees. In an abandoned bowyery, deer and boars take shelter.",
        "At the site of a modest pond, a new sea rises forth, its tide surging out night and day. Roaring coots honk out in a deafening protest.",
        "The Two-Hearted Knight bellows at the Sea, trying to repel the water with their coral ring. They don't know that they must be submerged in the water to command it.",
        "A great storm begins, and won't stop until the wave has arrived. Saltwater rises from all water sources, the land is flooded, and harvest ruined.",
        "The wave swells on the horizon, as tall as a mountain range. If it washes over the Realm then little can survive. After the devastation the Sea is quelled and returns to its rightful place."
      ],
      "cast": [
        {
          "name": "Wolfcrabs",
          "stats": "VIG 8, CLA 12, SPI 3, 3GD",
          "equipment": "Claws (d8)",
          "notes": "Usually only seen scavenging on beaches"
        },
        {
          "name": "Roaring Coots",
          "stats": "VIG 5, CLA 8, SPI 3, 2GD",
          "equipment": "Honking protest (deafening)",
          "notes": ""
        },
        {
          "name": "The Two-Hearted Knight",
          "stats": "VIG 14, CLA 12, SPI 10, 6GD",
          "equipment": "Coral ring, armor, weapons",
          "notes": "Must be submerged to command the Sea"
        }
      ],
      "treasures_table": {
        "1": "Ancient Armour",
        "2": "Preserved Stone Tablet",
        "3": "Chained Corpse",
        "4": "Tangled Sword",
        "5": "Rotted Pendant",
        "6": "Barnacled Shield"
      }
    },
    "The Elf": {
      "d6": 2,
      "d12": 9,
      "quote": "A steward of seasons, nature's power bestowed\nOur land bends to their whimsy, our lives no mercy showed",
      "omens": [
        "Along a sheltered stream, isolated signs of the next Season arriving early.",
        "Two season destroyers are about to kill a defenceless, defeated ironsmith outside his tiny forge. They claim the tide of seasons requires fresh blood.",
        "A season scout carries the rod of the upcoming Season, wishing to gift it to a Seer courtesy of the Elf. The rod holds the power to usher in its Season early.",
        "A season scout gifts the bow of the upcoming Season (d8 long) to the Knight with the highest SPI score. It is imbued with the power of the upcoming Season, when it is more potent (2d8).",
        "A season scout is travelling to the Seat of Power to deliver a message to the ruler of the Realm. They carry the longly viper, a leaping, talking snake. Only the viper knows the message, that the Elf is coming to claim this Realm as their own.",
        "The Elf emerges to claim the Seat of Power, a Warband each of scouts and destroyers. They'd prefer a duel."
      ],
      "cast": [
        {
          "name": "The Elf, Steward of Seasons, Coredis",
          "stats": "VIG 9, CLA 9, SPI 9, 13GD",
          "equipment": "Acts first, faster than any opponent",
          "notes": "Wants to flaunt their power. In Spring: SPI 19 and swiftbow (2d6 long). In Harvest: VIG 19 and goldfalx (3d6 long). In Winter: CLA 19 and claws and jaws (4d6)."
        },
        {
          "name": "Season Scouts, Tizra, Vioth, Santrosal",
          "stats": "VIG 8, CLA 16, SPI 12, 8GD",
          "equipment": "Swiftbow (2d6), strawlike hair",
          "notes": "Zero patience. Flee when wounded, faster than any mortal."
        },
        {
          "name": "Season Destroyers, Kilunar, Tasiviza",
          "stats": "VIG 10, CLA 12, SPI 12, 8GD",
          "equipment": "A2 (smoothbark armour, helm), Goldfalx (3d6 long)",
          "notes": "Sense of superiority"
        }
      ],
      "elf_quirks_table": {
        "1": {
          "cannot": "Harm animals",
          "absolutely_must": "Extinguish fires"
        },
        "2": {
          "cannot": "Harm plants",
          "absolutely_must": "Kill the elderly"
        },
        "3": {
          "cannot": "Feel emotion",
          "absolutely_must": "Scare children"
        },
        "4": {
          "cannot": "Speak",
          "absolutely_must": "Steal jewellery"
        },
        "5": {
          "cannot": "Step indoors",
          "absolutely_must": "Consume food seen"
        },
        "6": {
          "cannot": "Tolerate music",
          "absolutely_must": "Punish the ugly"
        }
      }
    },
    "The Axe": {
      "d6": 2,
      "d12": 10,
      "quote": "As tools of humble lumberwrack they split the log and stone\nThis one made to cleave the knights and castles that they own",
      "omens": [
        "A cowherd sleeps on a branch. Then, a rumble in the ground followed by their cattle stampeding this way.",
        "A maze of stony crags. A message carved in the rock: 'All Knights will feel the Axe'.",
        "A ruined hexagonal temple, seven stone seats the only furnishings left within. Each has a skull placed on it, the crest of a Knight roughly scratched into each seat. A flame weasel gnaws on one of the skulls.",
        "A secluded orchard, pained groans amongst the birdsong. A Knight lies bleeding, arm severed by the Axebearer. She doesn't know why she was spared.",
        "Echos of conversation from a winding tunnel. The militia within are discussing whether the Knights should lay down their lives to appease the Axebearer.",
        "The Axebearer stands atop a crag, proclaiming that the Axe will break the very land in two. Their first strike to the ground causes rumblings, the second tears a chasm across the Hex, the third a mighty canyon across the whole Realm."
      ],
      "cast": [
        {
          "name": "The Axebearer, Wella Gall",
          "stats": "VIG 14, CLA 12, SPI 15, 11GD",
          "equipment": "A1 (restitched gambeson), Axe (d10 long, +d12 vs Knights)",
          "notes": "Believes their fate is to kill all Knights. Any who carry the Axe share this delusion."
        },
        {
          "name": "Flame weasel, Embernip",
          "stats": "VIG 5, CLA 10, SPI 5, 2GD",
          "equipment": "Jaws (pleasant burn, restoring CLA once per day)",
          "notes": "Gluttony for birds and eggs"
        },
        {
          "name": "Stampeding Cattle, Warband",
          "stats": "VIG 10, CLA 5, SPI 5, 3GD",
          "equipment": "",
          "notes": ""
        },
        {
          "name": "Relaxed Cowherd, Pasco",
          "stats": "VIG 11, CLA 5, SPI 16, 3GD",
          "equipment": "Scrolls, maps, compass (extremely rare)",
          "notes": ""
        }
      ]
    },
    "The Dwarf": {
      "d6": 2,
      "d12": 11,
      "quote": "Fore first story, fore first seer, the time that came fore time\nOne smith, one hammer, rock then hill, then world in craft divine",
      "omens": [
        "An ancient fountain, smashed to pieces, tended to by a lone Dwarf. He uses his hammer to gently piece the stone back together. Claims to be in the service of the ruler of the Realm, happy to work again.",
        "Voices from within a shadowy grove. Mercenaries, arms freshly forged by the Dwarf, discussing where to find work.",
        "A sudden, broad tunnel entrance. The Dwarf leads reluctant labourers in digging out a passage to a distant Realm. He doesn't care where. The earth itself appears to bleed in the ground around the tunnel. The Dwarf seems undeterred.",
        "Suddenly rising from the ground, three great giants of vengeful earth lash out at any people they can find.",
        "Band of traders, labourers, and thieves from a distant Realm. Claim they arrived through the tunnel, looking for a home.",
        "The earth writhes and convulses. The ground opens up to claim the nearest Holding, swallowing it into the distant Realm at the end of the tunnel."
      ],
      "cast": [
        {
          "name": "The Dwarf, Drod of the First Forge",
          "stats": "VIG 15, CLA 15, SPI 12, 7GD",
          "equipment": "A2 (mail, bronze plate), Creator hammer (3d10 slow, cannot kill)",
          "notes": "Driven by a creative urge, feels nothing else."
        },
        {
          "name": "Newly Armed Mercenaries, Warband",
          "stats": "VIG 12, CLA 10, SPI 10, 5GD",
          "equipment": "A3 (mail, bronze plate, helm), Forged arms (see below)",
          "notes": "Both armour and weapons can be controlled by the wielder of the creator hammer."
        },
        {
          "name": "Giants of Vengeful Earth",
          "stats": "VIG 17, CLA 4, SPI 3, 7GD",
          "equipment": "A3 (rock and soil body), Swipes (d10) or huge smash (2d10 slow)",
          "notes": "Fights until they feel humanity has suffered."
        }
      ],
      "forged_arms_table": {
        "1": {
          "material": "Eternal bone",
          "type": "Blade (d6)"
        },
        "2": {
          "material": "Golden willow",
          "type": "Spear (d8 hefty)"
        },
        "3": {
          "material": "Blood bronze",
          "type": "Hammer (d8 hefty)"
        },
        "4": {
          "material": "Night flint",
          "type": "Bardiche (d10 long)"
        },
        "5": {
          "material": "Meteor iron",
          "type": "Maul (2d10 slow)"
        },
        "6": {
          "material": "Deep amber",
          "type": "Greatbow (d10 slow)"
        }
      }
    },
    "The Tower": {
      "d6": 2,
      "d12": 12,
      "quote": "In the tapestry of ages, stretching ever forth\nThe spiteful spirit of the land shows our follies' worth",
      "omens": [
        "Marching across a barren moor, the Bolt Knight escorts labourers in carts. They are being taken to the site of the Tower, where more efforts are needed.",
        "A dozen great birds of burden haul huge blocks across the Realm. A wake of torn earth. Tower guards escort on horseback.",
        "A stairway in the wilds, dreamlike visions to any who ascend (see opposite). At the top, a clear view of the Tower, complete on the horizon.",
        "Black clouds and thunder, but no rain. Crackling lightning turns to bolts, sparking fires across the Realm. This does not end until the Tower falls.",
        "A titanic thunderclap and dazzling bolt of lightning. The Tower begins to fall and cannot be stopped. The thunder and lightning continue.",
        "With a swell of thunder all tower-like structures in the Realm are shaken, grand or humble. With a final clap they all fall. The clouds clear."
      ],
      "cast": [
        {
          "name": "Bolt Knight, Berech of the Tower",
          "stats": "VIG 12, CLA 17, SPI 9, 7GD",
          "equipment": "A3 (mail, shimmering plate, helm), Cruel partisan (d10 long +d10 vs mounted)",
          "notes": "Hatred for anything less than perfection."
        },
        {
          "name": "Great Bird of Burden, Wazzletard",
          "stats": "VIG 17, CLA 10, SPI 4, 4GD",
          "equipment": "A2 (huge body), Trample and tear (2d10)",
          "notes": "Easily startled, longs for human approval."
        },
        {
          "name": "Tower Guards",
          "stats": "VIG 12, CLA 10, SPI 7, 4GD",
          "equipment": "A2 (mail, helm), Polearms (d10 long)",
          "notes": "Craving purpose, to be part of something big."
        }
      ],
      "dreamlike_visions_table": {
        "note": "Dreamlike visions referenced but table content not provided in source material"
      }
    },
    "The Chariot": {
      "d6": 3,
      "d12": 1,
      "quote": "Bursten forth out shroud o'night\nGraven wheel and tiger's bite",
      "omens": [
        "The stars are visible, even in day, forming a wheel pattern, visibly turning.",
        "A huge crater, barely the rubble of a stone outpost left. Heavy footprints within.",
        "A distraught family claim a pair of great tigers attacked their small farm, eating their chickens, sheep, and dog. They claim the beasts fell from the sky and vanished back into the darkness.",
        "A swathe has been cut through a forest or mountain. It leads toward the Myth Hex.",
        "The Charioteer rides over the horizon, pulled by two great tigers. He is quick to share his past triumphs, gathering followers to feed his ego. He seeks revenge against the ruler of the nearest Holding, who has slighted him in a minor way.",
        "Following up on a boast that somebody doubted, the Charioteer is preparing to charge either upstream, or into the tide, proving that no mere water is a match for the Chariot. They will succeed at this, driving the water away for good, before taking flight and returning to the stars."
      ],
      "cast": [
        {
          "name": "The Charioteer, Arayda",
          "stats": "VIG 16, CLA 7, SPI 18, 9GD",
          "equipment": "A3 (Emerald skin and armour), Meteor rod (2d8 hefty, wounded targets are thrown d6 Hexes, taking d6 further Damage)",
          "notes": "Driven to avenge any slights against himself or anybody he takes liking to."
        },
        {
          "name": "The Chariot",
          "stats": "5GD, A2 (structure)",
          "equipment": "2d12 trample",
          "notes": "Nothing can stop it"
        },
        {
          "name": "Tigers, Frecko & Parafusa",
          "stats": "VIG 15, CLA 15, SPI 5, 6GD",
          "equipment": "Rip and tear (2d8)",
          "notes": "Faster than any horse. Hatred of horses, fear of mirrors."
        }
      ],
      "boasts_and_slights_table": {
        "1": {
          "boast": "I shaped the moon",
          "slight": "It was in a past life"
        },
        "2": {
          "boast": "I set stars in motion",
          "slight": "They disgust me"
        },
        "3": {
          "boast": "I awoke the first Spring",
          "slight": "They don't appreciate their standing"
        },
        "4": {
          "boast": "I dug out the sea",
          "slight": "They mistreated a cat"
        },
        "5": {
          "boast": "I rendered the trees motionless",
          "slight": "They squander their lands"
        },
        "6": {
          "boast": "I made the mountains",
          "slight": "They sleep too much"
        }
      }
    },
    "The Desert": {
      "d6": 3,
      "d12": 2,
      "quote": "Flesh and stone and grass are nought but falsely forms\nAll are dust, nothing more",
      "omens": [
        "A dust devil whips across the grassland. It speaks in a voice like the wind, telling of a realm where only dust remains.",
        "Parched earth, a dead stream. The Dust Hag sits crooning by the water's edge, claiming the land has been 'purified'.",
        "A hunter arrives, covered in dust, claiming they've seen villages buried overnight. They carry water in a vial made from bone.",
        "The sky turns brown as sand storms rage in clear weather. Animals flee toward water.",
        "Oily buzzards circle overhead, dropping from exhaustion. Their dying croaks speak of endless dunes.",
        "The Dust Hag rises from the earth itself, offering to 'liberate' all living things from the burden of flesh."
      ],
      "cast": [
        {
          "name": "The Dust Hag, Senna",
          "stats": "VIG 5, CLA 19, SPI 19, 12GD",
          "equipment": "Dust form (can only be harmed by water), Withering touch (d12 slow, turns target to dust on Critical)",
          "notes": "Believes flesh is an illusion. Can turn any material to dust with a touch."
        },
        {
          "name": "Crafty Hunters",
          "stats": "VIG 12, CLA 14, SPI 8, 4GD",
          "equipment": "Bone vials (contain last water), Dustbow (d8 long, arrows turn to dust after hitting)",
          "notes": "Adapted to desert conditions, know where the last water sources are."
        },
        {
          "name": "Oily Buzzard, Rotbeak",
          "stats": "VIG 8, CLA 15, SPI 3, 3GD",
          "equipment": "Talons and beak (d6), Dust sense (can track living things for miles)",
          "notes": "Feeds on the dying, spreads word of the desert's expansion."
        }
      ],
      "whims_of_the_dust_hag_table": {
        "1": {
          "whim": "Turn all water to sand",
          "price": "A memory of rain"
        },
        "2": {
          "whim": "Bury a city in dust",
          "price": "The tears of children"
        },
        "3": {
          "whim": "Make plants wither",
          "price": "Songs of growing things"
        },
        "4": {
          "whim": "Turn flesh to dust",
          "price": "A lover's kiss"
        },
        "5": {
          "whim": "Dry up all rivers",
          "price": "The sound of flowing water"
        },
        "6": {
          "whim": "Create a dust storm",
          "price": "Breath of the living"
        }
      }
    },
    "The Mountain": {
      "d6": 3,
      "d12": 3,
      "quote": "How earth ajoys to lay frailty bare\nRender us small in its coldstone stare",
      "omens": [
        "Fur-clad monks pray toward the Mountain, scattering stones, water, and coals in its direction. They warn that only the worthy can climb it.",
        "The Mountain appears on the horizon. A pack of 4 crag cats have descended, laying gems as bait for unsuspecting prey.",
        "The Mountain's shadow swells, covering the Realm most of each day. Animals are distressed, crops struggle in the gloom.",
        "Seven peacock riders approach the Mountain. They claim their peacocks are so magnificent that nature simply gives way to them. They are mistaken.",
        "Two Squires return from near the peak. Their Knights were killed by a pack of crag cats, the Squires killing the cats in revenge. They're headed to the nearest Holding to seek their knighthoods.",
        "Atop the mountain, a voice questions anybody at the peak. 'Are you worthy?' Those who answer yes receive a brief vision of a glittering city. After leaving the Mountain it fades from the horizon."
      ],
      "cast": [
        {
          "name": "The Mountain Itself",
          "stats": "",
          "equipment": "Black crags, white peak",
          "notes": "Travel toward it feels uphill, causing d6 VIG loss."
        },
        {
          "name": "Peacock Riders, Castian and Company",
          "stats": "VIG 10, CLA 7, SPI 13, 4GD",
          "equipment": "A2 (glamorous shield and high helm), Light lance (d8 hefty), shield (d4), Riding peacock (VIG 7, CLA 6, SPI 6, 5GD)",
          "notes": ""
        },
        {
          "name": "Crag Cat, Gemtongue, Gluttontiger",
          "stats": "VIG 8, CLA 17, SPI 6, 4GD",
          "equipment": "Claws (2d6), mouthful of jewels laid as bait",
          "notes": ""
        },
        {
          "name": "Mourning Squires, Ennad, Merryn",
          "stats": "VIG 7, CLA 8, SPI 6, 5GD",
          "equipment": "A1 (shield), Shortsword (2d6), shield (d4)",
          "notes": ""
        }
      ],
      "path_to_the_peak_table": {
        "1": {
          "route": "Cliffside climb",
          "surroundings": "Barren rock"
        },
        "2": {
          "route": "Tight squeeze",
          "surroundings": "Mocking goats"
        },
        "3": {
          "route": "Giant steps",
          "surroundings": "Watching crows"
        },
        "4": {
          "route": "Crumbling path",
          "surroundings": "Aromatic shrubs"
        },
        "5": {
          "route": "Rope bridge",
          "surroundings": "Thorny bushes"
        },
        "6": {
          "route": "Winding tunnel",
          "surroundings": "Gnarled trees"
        }
      }
    },
    "The Star": {
      "d6": 3,
      "d12": 4,
      "quote": "The symbol of hope\nThe herald of ruin",
      "omens": [
        "A green star appears in the sky, brighter than any other, slowly circling.",
        "An archer lies on a flat rock. Trails of pale light fall from the Star onto the Realm.",
        "Spires of dull metal, planted in the ground, forming a barrier, blocking travel in the direction of the Myth Hex. Moving toward the barrier causes intense pain, pushing through it causes d12 Damage, ignoring Armour and other protection.",
        "A silver spire, patrolled by a walking tower on birdlike legs. Smaller spires slowly grow around the central spire.",
        "A mass of twenty commoners being escorted by 3 walking towers. They are being taken to the Myth Hex to be fed into the red spire that grows there.",
        "Helpless commoners being forced into the opening at the base of a towering silver spire. 5 walking towers guard them. When they have all been taken on board the spire glows with a blinding light before returning to the green star with a screaming streak. The Star fades."
      ],
      "cast": [
        {
          "name": "Walking Tower, Guardian from the Star",
          "stats": "VIG 18, CLA 12, SPI 3, 7GD",
          "equipment": "A4, treat as structure (star-iron walls), Crushing claws (2d10) or starlight bolts (3d8 or d10 blast)",
          "notes": "Being controlled from within by a creature. Strange behaviour (see below)."
        },
        {
          "name": "Creature from the Star",
          "stats": "VIG 5, CLA 13, SPI 6, 2GD",
          "equipment": "Starlit spear (2d10, hefty), gelatinous body",
          "notes": ""
        },
        {
          "name": "Mercenary Archer, Araya",
          "stats": "VIG 13, CLA 11, SPI 10, 1GD",
          "equipment": "A2 (mail, helm), Longbow (d8, slow), handaxe (d6)",
          "notes": "Out of employment, blames everybody but herself, wants a good war."
        }
      ],
      "tower_behaviour_table": {
        "note": "Tower behaviour table referenced but specific behaviors not provided in source material"
      }
    },
    "The Sun": {
      "d6": 3,
      "d12": 5,
      "quote": "Aurant of crown, a sov'reign aflame\nThe blaze of life can reap just the same",
      "omens": [
        "A field of golden flowers, moles-a-brightly munching on their stems. The Sun appears extra bright, even peeking over the horizon at night.",
        "A couple, vagabonds living off the land, carrying a basket of fruit. They praise the Sun for an unusually ripe bounty. Immediately flee from the Knights.",
        "The Sun rises to new heights, not setting again until the Myth is resolved. Roll a new blessing of the Sun each time you arrive at a settlement (see below).",
        "A shady grotto, 5 raiders arguing loudly within. They are frustrated that they cannot raid at night anymore. They plan a dire attack on the nearest Holding.",
        "A drought on the land. Wells dry, ground hardens, rivers die. The Sun brings no more boons, only banes.",
        "The Sun swells further, then descends on the Realm in the form of the feaster, a colossal golden man. He bounds about the Realm eating anything that grows. Terrified of animals, but not humans."
      ],
      "cast": [
        {
          "name": "The Sun, in the Form of the Feaster",
          "stats": "VIG 18, CLA 5, SPI 10, 4GD",
          "equipment": "A6 (colossal body), Crush (2d12 or d12 blast)",
          "notes": "Wants to eat all crops. Afraid of animals."
        },
        {
          "name": "Mole-a-Brightly, Blazenose",
          "stats": "VIG 3, CLA 13, SPI 2, 3GD",
          "equipment": "",
          "notes": "Glows pleasantly when eating, hates that which it does not already know."
        },
        {
          "name": "Raiders, Opal and Company",
          "stats": "VIG 12, CLA 12, SPI 7, 3GD",
          "equipment": "Hatchet (d6), bow (d6 long), stolen trinkets",
          "notes": ""
        },
        {
          "name": "Vagabond Couple, Harnis & Raschle",
          "stats": "VIG 9, CLA 14, SPI 12, 2GD",
          "equipment": "Dagger (d6), sling (d6), distrust Knights",
          "notes": ""
        }
      ],
      "blessings_of_the_sun_table": {
        "1": {
          "boon": "Early harvest",
          "bane": "Forest fire"
        },
        "2": {
          "boon": "Huge ball game",
          "bane": "Exhausted elders"
        },
        "3": {
          "boon": "Outdoor performance",
          "bane": "Worn out steeds"
        },
        "4": {
          "boon": "Choir of birds",
          "bane": "Ruined cropfield"
        },
        "5": {
          "boon": "Travelling merchants",
          "bane": "Insect swarms"
        },
        "6": {
          "boon": "Day of rest proclaimed",
          "bane": "Desperate predators"
        }
      }
    },
    "The Moon": {
      "d6": 3,
      "d12": 6,
      "quote": "Nasty neth'ren, neyn of night\nLain to life in loomer's light",
      "omens": [
        "On a steep-sloped scrubland an elderly woman gathers thorns. She claims they ward off the Claw, who's due another victim any night now.",
        "The Moon looms as a sharp crescent. When night falls the Claw begins to screech from the darkness. It only strikes if it spots a vulnerable target.",
        "Ferocious revellers dance around a beast idol. They break animal and human bones against the stone totem, keeping the Bonebreaker at bay for another night.",
        "The Moon looms large and crooked. As soon as night falls the Bonebreaker strikes suddenly and without warning.",
        "A wild-haired sage tries to calm a panicking congregation. He laments that they have no reptiles to sacrifice, a tradition intended to ward off the Bloodsucker, so instead people should arm themselves and bar their doors.",
        "The Moon looms waning and pale. When night falls the Bloodsucker strikes when the Knights are most off-guard."
      ],
      "cast": [
        {
          "name": "The Claw, Black Lobster of the Wood",
          "stats": "VIG 14, CLA 14, SPI 5, 6GD",
          "equipment": "A2 (carapace), scything pincers (2d10)",
          "notes": "Repelled by thorns or nettles. Wants to drag somebody into the night."
        },
        {
          "name": "The Bonebreaker, Brawn o'no Brain",
          "stats": "VIG 19, CLA 3, SPI 3, 5GD",
          "equipment": "A3 (deathless body), crush and tear (2d10)",
          "notes": "Repelled by clean bones. Wants to crush the weak."
        },
        {
          "name": "The Bloodsucker, Wolf that Walks on Foot, Queen of All Hungers, Esved",
          "stats": "VIG 12, CLA 17, SPI 15, 14GD",
          "equipment": "Claws and fangs (2d8, +d10 at night)",
          "notes": "Repelled by cold blood. Wants to drink strong blood."
        }
      ],
      "false_superstitions_table": {
        "1": {
          "tradition": "Sleep in the soil",
          "supposed_effect": "See in the dark"
        },
        "2": {
          "tradition": "Sever a toe",
          "supposed_effect": "Speak with animals"
        },
        "3": {
          "tradition": "Eat mouldy cheese",
          "supposed_effect": "Avoid nightmares"
        },
        "4": {
          "tradition": "Drink bitter root tea",
          "supposed_effect": "Prophetic dreams"
        },
        "5": {
          "tradition": "Steal a horseshoe",
          "supposed_effect": "Find love"
        },
        "6": {
          "tradition": "Nurture a butterfly",
          "supposed_effect": "Cheat death"
        }
      }
    },
    "The Lion": {
      "d6": 3,
      "d12": 7,
      "quote": "With creak and grind of time-worn wheel\nA king of all is brought to kneel",
      "omens": [
        "On the brink of a disused clay pit, a potter shapes a bowl, telling a story to the dozen children gathered to watch. She tells of the Lion, the king of beasts. No Knight could slay him, but a potter was his great enemy. She avoids giving any details.",
        "Horse breeders leading a dozen chargers toward the Seat of Power. They're struggling to get the horses moving, as they're all bowing toward the Lion's Hex.",
        "An isolated, babbling pond. A pike pokes its head from the water to cackle at passers-by. It can't really speak, but mimics words it has heard. It shouts 'He's here for his crown' among the gibberish.",
        "All steeds throw riders to the ground before charging off toward the Seat of Power to await the Lion's arrival.",
        "The Lion, heading toward the Seat of Power to peacefully take the Domain.",
        "Tired herald spreads word that the Lion has taken the Seat of Power. Some humans remain in court, but mostly they're replaced with unsuitable beasts."
      ],
      "cast": [
        {
          "name": "The Lion, Belliore, King of All Beasts",
          "stats": "VIG 18, CLA 12, SPI 15, 10GD",
          "equipment": "A2 (thick hide, shaggy mane), Claws and jaws (2d8 +d10 against humans), Roar (all who refuse to bow lose d6 SPI)",
          "notes": "All beasts bow to him, but he loathes them. Hates the sound of wheels, terrified by fire, cockerels, and any beast that stings. Even a drop of weak venom is lethal to the Lion. Can speak, but resents needing to do so."
        },
        {
          "name": "Storytelling Potter, Niefib",
          "stats": "VIG 10, CLA 14, SPI 18, 2GD",
          "equipment": "A1 (layers and layers of coats and cloaks)",
          "notes": "Always followed by a throng of infuriating children."
        }
      ],
      "infuriating_children_table": {
        "1": {
          "wants": "Entertaining",
          "will_not": "Stay still"
        },
        "2": {
          "wants": "A very specific food",
          "will_not": "Use words"
        },
        "3": {
          "wants": "What you have",
          "will_not": "Stop crying"
        },
        "4": {
          "wants": "To go home",
          "will_not": "Compromise even a bit"
        },
        "5": {
          "wants": "Something another child has",
          "will_not": "Explain themselves properly"
        },
        "6": {
          "wants": "They don't even know",
          "will_not": "Stop grabbing you"
        }
      }
    },
    "The Wheel": {
      "d6": 3,
      "d12": 8,
      "quote": "Dawn, day, then dusk. Blossom, burn, then bite.\nGreen, grown, then grey. Aborn, alive, abyss.",
      "omens": [
        "With a gust of groaning wind, the next Season begins suddenly.",
        "The wind groans again. At the start of the next morning a new Season begins, skipping next Season in line and moving immediately to the following Season. Birds screech and cry.",
        "The next Season begins suddenly. Milk finches are singing out of season, pushing their milk-filled eggs from their nests, breaking on the ground.",
        "The next Season is skipped, the following Season beginning suddenly. A grey adder, hisses from a nearby branch, beckoning the Knights over. It will whisper 'the Wheel is broken' before biting anybody who lingers.",
        "An especially intense Winter arrives suddenly and will not end until the Wheel is repaired. Swirling clouds form above the Wheel's Hex, spinning at an irregular, stuttering pace.",
        "The Wheel vanishes. Now it can only be found in a distant Realm (see below)."
      ],
      "cast": [
        {
          "name": "The Wheel of Seasons",
          "stats": "",
          "equipment": "A wooden wheel on a stone plinth",
          "notes": "Should turn inexorably with the seasons, but is stalling. It requires greasing with a mix of pollen, grain, and snow."
        },
        {
          "name": "Guardian of the Wheel, Hewgol",
          "stats": "VIG 18, CLA 8, SPI 8, 10GD",
          "equipment": "A3 (mail, gold plate, helm), Greataxe (2d10 long). Can only be lifted by a sworn Guardian of the Wheel. Can Deny.",
          "notes": "Cannot fathom that the Wheel isn't working."
        },
        {
          "name": "Grey Adder",
          "stats": "VIG 6, CLA 18, SPI 5, 4GD",
          "equipment": "Bite (d6, poisons on a Wound, the victim is unable to speak until forgiven by a snake)",
          "notes": ""
        }
      ],
      "distant_realm_table": {
        "note": "A distant realm table referenced but specific details not provided in source material"
      }
    },
    "The Cudgel": {
      "d6": 3,
      "d12": 9,
      "quote": "The stick and the city, both worths beyond quill\nPrized ever and all, their ends empty still",
      "omens": [
        "A modest tower, a lone guard protecting a petty duchess. She is obsessed with sleep and dreams. The guard wants to seek the Cudgel, but needs somebody to watch the tower in his absence. Knows that a hawkleon lives nearby, and will be drawn to such a weapon.",
        "The corpse of a large white ox lies mauled but uneaten, twitching. Moments later a swarm of clawed bees bursts forth.",
        "A hawkleon prowls the shadows and circles the skies, hoping to make sport with the Knights if it can isolate one.",
        "A scheming hedgehog tracks the Knights, hoping to steal the Cudgel for itself.",
        "The cowardly guard believes they have the Cudgel. It's just a branch (d6 hefty).",
        "Finally, the true Cudgel (d10 hefty, the wielder knows the location of every enemy in their heart, but can never stop a fight until their enemy is dead), embedded in a huge slab of unbreakable green marble. Releases itself only for somebody who honestly intends to destroy it."
      ],
      "cast": [
        {
          "name": "Clawed Bee Swarm, Warband",
          "stats": "VIG 5, CLA 3, SPI 3, 3GD",
          "equipment": "Claws and stings (d6, wounds fester, releasing more bees tomorrow)",
          "notes": ""
        },
        {
          "name": "Scheming Hedgehog, Verispa, Slysnout",
          "stats": "VIG 7, CLA 17, SPI 7, 2GD",
          "equipment": "A2 (bristles, melee attackers without a Long weapon take d4 Damage), bite (d6)",
          "notes": "Hog-sized. Always on a scheme (see below). Its spines can be made into a dozen arrows (+d6) which strike silently, then vanish."
        },
        {
          "name": "Hawkleon, the Cat of the Skies",
          "stats": "VIG 15, CLA 15, SPI 7, 9GD",
          "equipment": "A1 (muscular hide), pounce (2d8), wings",
          "notes": "Wants to toy with prey. Desires the Cudgel. Ashes of its feathers repel both cat and bird."
        }
      ],
      "schemes_of_the_hedgehog_table": {
        "1": {
          "goal": "Steal food",
          "twist": "Wants to get caught"
        },
        "2": {
          "goal": "Acquire better home",
          "twist": "In disguise"
        },
        "3": {
          "goal": "Murder rival",
          "twist": "Befriends enemies"
        },
        "4": {
          "goal": "Steal treasure",
          "twist": "Play the long game"
        },
        "5": {
          "goal": "Defeat predator",
          "twist": "Fake death"
        },
        "6": {
          "goal": "Expand dynasty",
          "twist": "Exploit superstitions"
        }
      }
    },
    "The Lizard": {
      "d6": 3,
      "d12": 10,
      "quote": "O scale'd one afernal, portenter o'decay\nO fang o'roaring ruin, sunrise o'final day",
      "omens": [
        "Black smoke on the horizon. The Lizard is birthed from the fire, blind and confused. It cannot bite yet and tries to flee.",
        "A forest reduced to ash. A silver-haired bandit gathers it up. He knows that ash created by the Lizard is a deadly poison.",
        "A river, flowing as grey ash-saturated sludge. Dead fish and newts line the riverbank. A pair of knightly salamanders, normally immune to all toxins, flail around in agonised rage.",
        "A huge tail of the Lizard, detached by the growing beast, lies twitching amongst a briar patch. Its blood sparks a fire that can only be extinguished by seawater.",
        "A burial mound, where the Lizard made a temporary nest, erupts into burning soil (d8 Damage each turn within the area). It burns until midnight.",
        "A heap of rocks, part melted, now the lair of the Lizard. If left to live it ignites into a huge fire that consumes the entire Hex, birthing four more Lizards to spread into neighbouring Realms."
      ],
      "cast": [
        {
          "name": "The Lizard, the Land's Eternal Woe",
          "stats": "VIG 18, CLA 12, SPI 5, 8GD",
          "equipment": "Scales of un-colour (ignores all Damage, but does not cover its belly), Bite (2d10, a wound incinerates the victim to ash) or thrash (d8 blast)",
          "notes": "Burning blood (a single drop sparks a fire. Only seawater can extinguish the flames)"
        },
        {
          "name": "Yfran, Veteran Bandit",
          "stats": "VIG 12, CLA 15, SPI 13, 6GD",
          "equipment": "A1 (black brigandine), 2 daggers (d6 each), bow (d6)",
          "notes": "Wants to pull off one last big job (see below)."
        },
        {
          "name": "Knightly Salamander, Helmeck",
          "stats": "VIG 10, CLA 4, SPI 5, 4GD",
          "equipment": "Claws and bite (d8), immune to most toxins",
          "notes": ""
        }
      ],
      "last_big_job_table": {
        "note": "Last big job table referenced but specific details not provided in source material"
      }
    },
    "The Ogre": {
      "d6": 3,
      "d12": 11,
      "quote": "From sluggal umbrage knit a gastrell, deck'd in grile, and grim\nBy him the curze'd kings of gloreday seem a way less dim",
      "omens": [
        "Snow begins to fall. First a flurry, then a veil that covers the whole Realm. Vision is limited to shouting distance. This remains until the Ogre dies or stops it.",
        "Two elderly weavers stagger through the snow. They were captives in the Ogre's castle. He released them because they would not work fast enough.",
        "The Ogre watches the Company from the veil of snow. He's looking for a Knight to capture, to guard his castle. Although he cannot die, he won't fight on long if hurt.",
        "Shivering in the snow, a stinging crocodile. It will lead Knights to the castle and a tunnel into the catacombs below.",
        "An ancient graveyard on a hilltop, names forgotten. Some know that the Ogre's soul is hidden in the first skull buried here.",
        "Having gathered enough servants to live a comfortable life, the Ogre bellows out in coarse laughter, heard across the Realm. His reluctant Knights gather taxes weekly, taking more than any can afford."
      ],
      "cast": [
        {
          "name": "The Ogre, the Repulsive Pretender",
          "stats": "VIG 18, CLA 10, SPI 2, 8GD",
          "equipment": "A2 (gnarled muscles), bony knife (d8), crooked horn (d10), foul finery (see below)",
          "notes": "Recovers from any harm while his soul is safely hidden. Hates being looked at. Wants to live a lazy life of luxury."
        },
        {
          "name": "Stinging Crocodile, Nattlesnap",
          "stats": "VIG 10, CLA 5, SPI 5, 3GD",
          "equipment": "Jaws (d8, wound causes a painful sting, lose d6 SPI)",
          "notes": "Hates the Ogre, who banished him."
        },
        {
          "name": "Reluctant Knights of the Ogre",
          "stats": "VIG 13, CLA 10, SPI 10, 5GD",
          "equipment": "A2 (battered helm and shield), Mace (d8 hefty), shield (d4)",
          "notes": "Only serve while the Ogre holds their kin."
        }
      ],
      "foul_finery_table": {
        "1": {
          "a_cloak_of": "Skin",
          "and_a_crown_of": "Bones"
        },
        "2": {
          "a_cloak_of": "Feathers",
          "and_a_crown_of": "Twigs"
        },
        "3": {
          "a_cloak_of": "Moss",
          "and_a_crown_of": "Dead birds"
        },
        "4": {
          "a_cloak_of": "Stomachs",
          "and_a_crown_of": "Eyes"
        },
        "5": {
          "a_cloak_of": "Bark",
          "and_a_crown_of": "Teeth"
        },
        "6": {
          "a_cloak_of": "Matted hair",
          "and_a_crown_of": "Rocks"
        }
      }
    },
    "The Spider": {
      "d6": 3,
      "d12": 12,
      "quote": "Neath stygic veils, a whisp'ring prance\nIn woestich hide and gos'mer lance",
      "omens": [
        "Six carrion storks pick at webbed corpses of a Knight, a Squire, and steeds.",
        "A makeshift trail suddenly gives way to a wide tunnel network. This labyrinth leads to the Myth Hex, but the Spider guards it.",
        "A skittering shadow in the clouds, then a blanket of thick webs covers the Company (VIG Save to break free). Next round, the Spider attacks, but only wants a snack.",
        "The Spider Herald watches over a gloomy mound, warning passers-by to keep their distance. The mound conceals a nest of writhing spider eggs. Any interference summons the Spider to defend his young.",
        "The Spider Herald arrives, beckoning the Company over. She inquires about their prowess, and if they seem worthy she cheerily informs them that they are now the Prey of the Spider, a great honour.",
        "The Spider bursts from the ground. He's been tracking the Company and fights until wounded, when he withdraws underground to return when fully healed."
      ],
      "cast": [
        {
          "name": "The Spider, Lord of Hunters, Spinjack",
          "stats": "VIG 18, CLA 19, SPI 9, 10GD",
          "equipment": "A3 (bristly carapace), Bite (3d10, Wound causes instant paralysis lasting until sunrise)",
          "notes": "Wants a good hunt. Retreats if Wounded."
        },
        {
          "name": "The Spider Herald, Alskip",
          "stats": "VIG 10, CLA 12, SPI 12, 5GD",
          "equipment": "A1 (spider husk armour, protects from webs), Fang sword (2d6, covered in Spider venom)",
          "notes": "Has a different spider aspect (see below) each time she is encountered."
        },
        {
          "name": "Carrion Stork, Cruorsnipe, Corporant",
          "stats": "VIG 5, CLA 10, SPI 5, 4GD",
          "equipment": "Razor beak (d8, ignore armour, cuts through any material)",
          "notes": "Wants to feed in peace."
        }
      ],
      "aspects_of_the_spider_table": {
        "1": {
          "head": "Extra eyes",
          "body": "Growing extra arms"
        },
        "2": {
          "head": "Huge jaw",
          "body": "Growing extra legs"
        },
        "3": {
          "head": "Mottled skin",
          "body": "Bristly hair"
        },
        "4": {
          "head": "Wide head",
          "body": "Swollen abdomen"
        },
        "5": {
          "head": "Sharp fangs",
          "body": "Jittery movement"
        },
        "6": {
          "head": "No nose",
          "body": "Spindly limbs"
        }
      }
    },
    "The Coven": {
      "d6": 4,
      "d12": 1,
      "quote": "In mossen whisper, on thundry roar\nIn starry flare, thrice-membered lore",
      "omens": [
        "The Cloud Hag descends from above, bombarding the Company with gusts of wind. She'll leave when she feels strong.",
        "A cauldron under a canopy of knotted trees. Anything dipped in glows with darkness. For the rest of the day the object is invisible to any that wish to harm you. If living matter touches the brew then one of the Coven bursts from within and admonishes for the intrusion.",
        "The Garden Witch stoops about in the shrubbery, plucking snails before eating them. She offers her snails, which allow the eater to speak with plants briefly.",
        "Amid a field of lush growth, a perfect circle of dead plants. Plants entering the circle wither and die. The Garden Witch has planted a saltstone causing this.",
        "The wind drops. The Achantrix screeches that there will be no night today. The next night phase is treated as day.",
        "The Coven fight to the death, nothing able to quell their hatred for each other. The victor mourns, then enters exile."
      ],
      "cast": [
        {
          "name": "The Cloud Hag, Nimbrel the Powerful",
          "stats": "VIG 17, CLA 13, SPI 12, 12GD",
          "equipment": "A1 (fog cloak), flight, wind orb (d10 blast)",
          "notes": "Wants to feel above everybody else."
        },
        {
          "name": "The Garden Witch, Tanselie the Petty",
          "stats": "VIG 10, CLA 13, SPI 15, 8GD",
          "equipment": "Four bony arms (d6 each), petal locket (endless water when watering plants)",
          "notes": "Wants to nurture the small, cut back the big."
        },
        {
          "name": "The Achantrix, Scathara the Perfect",
          "stats": "VIG 15, CLA 13, SPI 18, 10GD",
          "equipment": "Bright sickle (2d8), star ring (disobeying a command by the wearer causes d8 SPI loss)",
          "notes": "Wants to expel all darkness from the world."
        }
      ],
      "coven_conflicts_table": {
        "1": {
          "about": "Food",
          "exacerbated_by": "The other member"
        },
        "2": {
          "about": "Gifts",
          "exacerbated_by": "A physical fight"
        },
        "3": {
          "about": "Travel",
          "exacerbated_by": "Decades of resentment"
        },
        "4": {
          "about": "Manners",
          "exacerbated_by": "A petty lie"
        },
        "5": {
          "about": "Birds",
          "exacerbated_by": "Alcohol"
        },
        "6": {
          "about": "Property",
          "exacerbated_by": "Heartbreak"
        }
      }
    },
    "The Lich": {
      "d6": 4,
      "d12": 2,
      "quote": "From fable's heart springs fable's fear, a past within a past\nFrom time before our nightmares still, made flesh by sullen mass",
      "omens": [
        "A grey wind shrieks into the Realm. Any items made of bone tremble for a moment.",
        "A ghost of shadow and smoke drifts nearby, clutching four gems. This is the ghost of the Lich, gathering his riches.",
        "A stream surges with blood toward the Myth Hex, a crumbled palace arisen.",
        "A hooded congregation surrounds an altar, a skull resting atop it. The Lich, as a skull, proclaims his return as the old king. If disturbed the hooded robes fall to the ground, no body within. The Lich threatens any Knights, but blasts off into the sky if he needs to retreat to his palace.",
        "The Lich, as a skull, rests on a heap of bones before reassembling to a human form, desiccated skin growing to cover his bones. Now with a full body he seeks to return to his palace and rule the Realm.",
        "A sky of skull-clouds bellow a new law each Season (see below). At Season's end, all who broke the law are struck by a black bolt (6d12 Damage, ignore Armour)."
      ],
      "cast": [
        {
          "name": "The Lich, Eternal, as a Formless Ghost",
          "stats": "VIG 9, CLA 10, SPI 10, 5GD, cannot be harmed",
          "equipment": "",
          "notes": "Smells of incense and copper. Nearby metal is chilled cold enough to burn."
        },
        {
          "name": "The Lich, Eternal, as a Skull",
          "stats": "VIG 3, CLA 17, SPI 17, 1GD",
          "equipment": "A6 (mystical force)",
          "notes": "Immobile, but can manipulate nearby objects including his royal dagger (2d6)."
        },
        {
          "name": "The Lich, Eternal, as the Skeletal King",
          "stats": "VIG 10, CLA 12, SPI 16, 8GD",
          "equipment": "A2, A4 vs the living (ancient mail and helm), Kingstaff (d10 long, Mortal Wounds age the victim to old age)",
          "notes": "Can summon the dead version of a random Knight. Wants to rule over the living."
        }
      ],
      "laws_of_the_lich_table": {
        "1": {
          "subject": "All Knights",
          "must": "Fast for the day"
        },
        "2": {
          "subject": "All horses",
          "must": "Donate an eyeball"
        },
        "3": {
          "subject": "All commoners",
          "must": "Be dressed in black"
        },
        "4": {
          "subject": "All Seers",
          "must": "Donate a bone"
        },
        "5": {
          "subject": "All elders",
          "must": "Leave the Realm"
        },
        "6": {
          "subject": "All children",
          "must": "Swear to the Lich"
        }
      }
    },
    "The Wight": {
      "d6": 4,
      "d12": 3,
      "quote": "In burial mounds the sleepless lie, with gold and silver cursed\nThe living disturb their endless rest, for treasure they have nursed",
      "omens": [
        "A burial mound on a windswept hill. Ancient coins scattered around its base gleam in the moonlight.",
        "A withered tree grows from cracked earth. Beneath its roots, the outline of a barrow can be seen.",
        "Farmers report livestock going missing near the old burial grounds. They speak of pale lights in the darkness.",
        "A merchant's cart overturned on the road. The goods are scattered but untouched - except for all the metal coins and jewelry, which are missing.",
        "The Wight emerges from its barrow, wrapped in burial shrouds and wearing a crown of tarnished silver. It seeks to reclaim all precious metals in the realm.",
        "Hoards of treasure begin moving of their own accord, drawn back to the burial mounds. The Wight's influence spreads as it gathers its ancient wealth."
      ],
      "cast": [
        {
          "name": "The Wight, Keeper of Ancient Treasures",
          "stats": "VIG 8, CLA 14, SPI 16, 8GD",
          "equipment": "A3 (ancient burial armor), Treasure Grasp (2d8, steals one valuable item on Wound), Crown of Avarice (commands all precious metals within sight)",
          "notes": "Immune to non-magical weapons. Weakness: blessed silver. Wants to reclaim all treasure that was once buried with the dead."
        },
        {
          "name": "Barrow Guardians, Skeletal Retainers",
          "stats": "VIG 6, CLA 10, SPI 8, 3GD",
          "equipment": "A2 (bone and bronze), Ancient weapons (d8), rusty shields (d4)",
          "notes": "Rise from burial mounds to protect their master's hoard."
        },
        {
          "name": "Treasure Wraith, Avaricious Spirit",
          "stats": "VIG 4, CLA 16, SPI 12, 2GD",
          "equipment": "Incorporeal (immune to physical attacks), Drain Wealth (target loses one valuable possession)",
          "notes": "Seeks out and claims valuable items for the Wight's collection."
        }
      ],
      "cursed_treasures_table": {
        "1": {
          "treasure": "Golden torque",
          "curse": "Whispers of greed"
        },
        "2": {
          "treasure": "Silver chalice",
          "curse": "Drains the drinker's life"
        },
        "3": {
          "treasure": "Bronze mirror",
          "curse": "Shows only death"
        },
        "4": {
          "treasure": "Jeweled dagger",
          "curse": "Thirsts for noble blood"
        },
        "5": {
          "treasure": "Crown of copper",
          "curse": "Commands the dead"
        },
        "6": {
          "treasure": "Rings of bone",
          "curse": "Binds souls to the earth"
        }
      }
    },
    "The Spectre": {
      "d6": 4,
      "d12": 4,
      "quote": "Neither living nor truly dead, a shadow between the worlds\nBound by sorrow, driven by rage, where vengeance is unfurled",
      "omens": [
        "Mirrors crack without cause. Reflective surfaces show glimpses of a translucent figure in funeral garb.",
        "A funeral procession winds through the countryside, but the mourners cast no shadows and make no sound.",
        "Temperature drops suddenly in broad daylight. Breath mists in the air as an invisible presence passes by.",
        "Animals refuse to enter certain areas, backing away with whimpering fear from seemingly empty spaces.",
        "The Spectre manifests fully, a figure wreathed in mist and sorrow. It speaks of injustices that must be corrected.",
        "The boundary between life and death weakens. The recently deceased rise to serve the Spectre's quest for justice."
      ],
      "cast": [
        {
          "name": "The Spectre, Phantom of Vengeance",
          "stats": "VIG 6, CLA 18, SPI 18, 6GD",
          "equipment": "Incorporeal form (immune to physical attacks), Spectral Touch (2d10, ages target), Wail of Sorrow (d12 SPI damage to all who hear)",
          "notes": "Can phase through solid matter. Vulnerable to holy water and consecrated ground. Seeks to right ancient wrongs."
        },
        {
          "name": "Restless Spirits, The Wronged Dead",
          "stats": "VIG 4, CLA 12, SPI 14, 2GD",
          "equipment": "Ghostly weapons (d6, ignore armor), Chilling presence",
          "notes": "Drawn to the Spectre by shared injustices. Fade when their grievances are resolved."
        },
        {
          "name": "Death Knight, Former Champion",
          "stats": "VIG 12, CLA 10, SPI 6, 5GD",
          "equipment": "A3 (spectral armor), Phantom blade (2d8, drains VIG on wound), Undead mount",
          "notes": "Once served justice in life, now serves the Spectre in death."
        }
      ],
      "unfinished_business_table": {
        "1": {
          "injustice": "Murder unavenged",
          "resolution": "Killer must face justice"
        },
        "2": {
          "injustice": "Promise unfulfilled",
          "resolution": "Oath must be completed"
        },
        "3": {
          "injustice": "Love betrayed",
          "resolution": "Truth must be revealed"
        },
        "4": {
          "injustice": "Treasure stolen",
          "resolution": "Wealth must be returned"
        },
        "5": {
          "injustice": "Honor besmirched",
          "resolution": "Name must be cleared"
        },
        "6": {
          "injustice": "Sacred vow broken",
          "resolution": "Penance must be paid"
        }
      }
    },
    "The Boar": {
      "d6": 59,
      "d12": 118,
      "quote": "Guts burst forth in bloody flow\nAbout the tusks of nature's woe",
      "omens": [
        "The grass here feels like wiry bristles, the ground warm to the touch. Almost feels like the Realm is breathing heavily.",
        "Three hooded hunters are stalking the land, seeking the Boar who drove them out of their idyllic home nearby.",
        "A white-walled vineyard ahead. A sudden crash as the Boar arrives, tearing vines and crushing walls. It wants wine.",
        "If the hooded hunters are with the Company the Boar attacks, targeting the hunters specifically. Otherwise, their corpses lie broken in the Boar's wake",
        "Three masked hunters seek the Boar. They barely speak, miming as the animal on their mask. If their mask is ever removed they vanish into black smoke.",
        "The Boar in the distance, masked hunters concealed, ready to strike. If the Boar is killed the hunters unmask, vanishing to smoke. If the Boar survives it heads to the nearest holding for a final feast before leaving the Realm."
      ],
      "cast": [
        {
          "name": "The Boar, Rustigore, Ferrigras",
          "stats": "VIG 18, CLA 7, SPI 7, 7GD",
          "armor": "A3 (brassy bristles)",
          "attacks": "Thrash and gore (d10 blast, +d10 when charging) or impale (3d10 slow)",
          "description": "Hungers for food made by human hands. Tusks can be worked into weapons that kill beasts they Wound, but break on impact."
        },
        {
          "name": "Hooded Hunters, Dristoc, Friswold, Ulf",
          "stats": "VIG 10, CLA 8, SPI 12, 3GD",
          "attacks": "Spear (d8 hefty), javelins (d6)",
          "description": "Much anger but little hunting experience."
        },
        {
          "name": "Masked Hunters, names left behind",
          "stats": "VIG 10, CLA 15, SPI 15, 5GD",
          "armor": "A2 (fur armour, masked helm)",
          "attacks": "Greatspear (d10 long)",
          "description": "Vanish into black smoke if their masks are removed."
        }
      ],
      "locations": {
        "dwelling": "Alchemist tower",
        "sanctum": "Whispering statuary",
        "monument": "Quartz pillar",
        "hazard": "Brimstone springs",
        "curse": "Choking gorge",
        "ruin": "Scorched workshop"
      }
    },
    "The Eagle": {
      "d6": 60,
      "d12": 120,
      "quote": "A bird o'flame to claim sun's toll\nCrown for crown, gold for gold",
      "omens": [
        "A great shadow sweeps the landscape, blotting the sun for a moment.",
        "A flame above, shrieking until it plunges to the ground, sending roaring fire in every direction (d8 blast) and setting the area alight. The Eagle, Aflame, surveys the destruction then makes flight for the nearest large body of water.",
        "The Eagle, Smouldering, bathing to extinguish its feathers. It cannot fly for another Phase, but can hobble about. A crowd, driven from their burning homes, watch, and protect the Eagle from harm.",
        "The Eagle, Rising, stretches its wings, preparing to fly. As it ascends it sends a gust of wind through the Hex, felling wooden structures and flattening trees.",
        "The sun seems to swell, then a piercing cry. The shape of the Eagle, Aflame, appears in the sky, just circling for now.",
        "The Eagle, Aflame, dives on the Seat of Power, aiming to snatch the ruler and carry them up into the sun as an offering. If this fails the next harvest is dire."
      ],
      "cast": [
        {
          "name": "The Eagle, Aflame",
          "stats": "VIG 15, CLA 15, SPI 15, 8GD",
          "armor": "A2 (huge body)",
          "attacks": "talons (2d8) and beak (d12)",
          "description": "Wants lots of fire to fuel the sun."
        },
        {
          "name": "The Eagle, Smouldering",
          "stats": "VIG 13, CLA 12, SPI 10, 6GD",
          "armor": "A2 (huge body)",
          "attacks": "clumsy thrashing (d8 blast)",
          "description": "Wants to extinguish its burning wings."
        },
        {
          "name": "The Eagle, Rising",
          "stats": "VIG 15, CLA 18, SPI 18, 12GD",
          "armor": "A2 (huge body)",
          "attacks": "gusts of wind (d10 blast)",
          "description": "Must dry wings on the wind before flying."
        },
        {
          "name": "Protective Victims of the Eagle",
          "stats": "VIG 10, CLA 10, SPI 7, 2GD",
          "description": "They say the Eagle means well."
        }
      ],
      "locations": {
        "dwelling": "Falconer's hut",
        "sanctum": "Amber brook",
        "monument": "Sky boulder",
        "hazard": "Vulture peaks",
        "curse": "Tainted stream",
        "ruin": "Fallen treehouse"
      }
    },
    "The Bat": {
      "d6": 61,
      "d12": 122,
      "quote": "Spoil the loaf, taint the wine\nTo starve a fiend is most divine",
      "omens": [
        "A smug musician, drumming. He sings \"the great winged one grows, and we are the feast\" but he insists it's just a song.",
        "A flock of various birds, grounded. They look to be grovelling toward the darkest part of the sky. They scatter if disturbed.",
        "A long table is laid out, commoners gathered for a feast. Every bowl is filled with worms, which people reluctantly eat by the handful. They say the Feast of Worms will deny the Bat its food.",
        "Exhausted farmers gather pigs, cows, and sheep. They're heading to a nearby lake for a great sacrifice, hoping the bloody water will sate the Bat's wicked hunger.",
        "A crowd are lighting fires outside a cave, the Bat hiding within. They aim to smoke it out. The Bat eventually emerges, and fights only enough to allow it to flee.",
        "Wings broken, dragged in chains, the Bat is being taken to the Seat of Power to be judged for its long list of crimes against the Realm."
      ],
      "cast": [
        {
          "name": "The Bat, Most Wicked of All Beasts",
          "stats": "VIG 15, CLA 15, SPI 3, 7GD",
          "armor": "A2 (huge body)",
          "attacks": "Thrashing wings (d8 blast) or bite (2d10)",
          "description": "Wants sweet fruit and a dark place to rest."
        },
        {
          "name": "Crowd of Bat Hunters, led by Radlef",
          "stats": "VIG 10, CLA 7, SPI 13, 3GD",
          "attacks": "Weaponised tools (d8 long), Radlef has a Bow (d6 long) and batbane arrows (no effect)",
          "description": "Certainty in their convictions."
        },
        {
          "name": "Travelling Musician, Keork",
          "stats": "VIG 11, CLA 11, SPI 16, 4GD",
          "attacks": "Drum with red ribbons, dagger (d6)",
          "description": "Enjoys hearing how badly others sing."
        }
      ],
      "bat_crimes_table": {
        "1": "Stealing fruit from orchards",
        "2": "Frightening livestock at night",
        "3": "Disturbing sleep with screeching",
        "4": "Spreading disease through droppings",
        "5": "Attacking travelers in darkness",
        "6": "Consorting with other dark creatures"
      },
      "locations": {
        "dwelling": "Thistle gatherers",
        "sanctum": "Vibrant glade",
        "monument": "Sun garden",
        "hazard": "Thorned trench",
        "curse": "Stinging shade",
        "ruin": "Bloody well"
      }
    },
    "The Toad": {
      "d6": 62,
      "d12": 124,
      "quote": "In honeyed words a fat and charmsome lord\nIn poisoned gifts a bloaty malice stirred",
      "omens": [
        "A caravan of wagons, fat donkeys hauling thick logs, escorted by twelve warty guards. They are respectful to Knights, but urge the need for haste, delivering materials for the Toad's castle.",
        "Two scouts, searching for news of the Toad. They hear his castle has been built.",
        "The Toad's pet, a monstrous slug, is being delivered to his castle in chains. Six warty guards struggle with the task, asking for help. The Toad is grateful for aid given.",
        "Nestled among thorns, a scroll with green ribbon. It reads \"the Toad commends your service\". Anybody reading it feels sickly sweet, as if filled with honey. They choke and sputter syrupy spittle, losing d8 VIG.",
        "A lone warty guard, delivering a gift to one of the Knights. Its curse manifests when the item is used, which the guard encourages the Knight to do later. The curse lasts an entire Season.",
        "Twelve warty guards ride forward, demanding the Knights visit the Toad. They must swear to him or die."
      ],
      "cast": [
        {
          "name": "The Toad, the Fat Lord, Born to Rule",
          "stats": "VIG 12, CLA 5, SPI 16, 5GD",
          "armor": "A4 (blubbersome body)",
          "attacks": "Grab and bite (d10), charming voice",
          "description": "Corrupt lord who offers poisoned gifts and honeyed words."
        },
        {
          "name": "Warty Guards, led by Jabeck",
          "stats": "VIG 12, CLA 10, SPI 8, 5GD",
          "armor": "A3 (froghelm, mail, rotund plate)",
          "attacks": "Bow (d6 long), halberd (d10 long)",
          "description": "Fearful look, professional manner."
        },
        {
          "name": "Blotch, Beloved Pet to the Toad",
          "stats": "VIG 17, CLA 5, SPI 2, 5GD",
          "armor": "A4 (monstrous sluglike body)",
          "attacks": "Slobbering maw (3d8)",
          "description": "Always sad, always hungry. Wants to be released."
        }
      ],
      "baleful_gifts_table": {
        "1": "Golden goblet - wine turns to poison when drunk",
        "2": "Silk cloak - wearer becomes sluggish and bloated",
        "3": "Jeweled ring - finger swells and becomes warty",
        "4": "Silver mirror - reflection shows a toad-like visage",
        "5": "Crystal vial - contents smell sweet but cause nausea",
        "6": "Ornate dagger - blade drips with toxic slime"
      },
      "locations": {
        "dwelling": "Rambunctious fishery",
        "sanctum": "Tranquil cove",
        "monument": "Triple obelisk",
        "hazard": "Quaking ground",
        "curse": "Rippling darkness",
        "ruin": "Broken mast"
      }
    },
    "The Colossus": {
      "d6": 1,
      "d12": 21,
      "quote": "A legacy hewn in living rock\nA life that should not be",
      "omens": [
        "An elderly sculpter toils away, carving a great statue into a cliff face. He boasts that the statue is based on him in his youthful prime. He knows he is dying and longs for immortality.",
        "Across the Realm the earth shakes and rumbles as the Colossus awakes.",
        "A crushed stone house, petty belongings scattered across the nearby field. Looks as if it was bombarded with stones.",
        "The Hammer Knight rides, declaring they are seeking the Colossus, who has been terrorising the area.",
        "Two warbands of a mercenary company fight the Colossus, gradually realising they're unable to harm its stone body.",
        "In the distance, the Colossus is leaning against a mountainside. With a groan they collapse into a heap, their form merging with that of the mountain. After a few moments the new rock is covered in red and green moss."
      ],
      "cast": [
        {
          "name": "The Colossus, Woken from the Rock",
          "stats": "VIG 19, CLA 3, SPI 2, 6GD",
          "equipment": "A4, count as a structure (colossal stone body), Crush (2d12) or sweep (d12 blast)",
          "notes": "Driven by strange behaviour (see below)."
        },
        {
          "name": "The Hammer Knight, Lansheigh",
          "stats": "VIG 14, CLA 5, SPI 6, 7GD",
          "equipment": "A3 (helm, gambeson, spiked plate), Maul (2d10 slow), siege bombs (d8 blast)",
          "notes": "Sworn to never ask or answer a question."
        },
        {
          "name": "Besieger Mercenary Company Member",
          "stats": "VIG 13, CLA 7, SPI 7, 5GD",
          "equipment": "A3 (siegehelm, blackened mail, towershield), Blade (2d6 hefty), towershield (d4)",
          "notes": ""
        }
      ],
      "strange_behaviour_table": {
        "1": {
          "loves": "Fire",
          "hates": "Darkness"
        },
        "2": {
          "loves": "Water",
          "hates": "Rain"
        },
        "3": {
          "loves": "Beasts",
          "hates": "Birds"
        },
        "4": {
          "loves": "Flowers",
          "hates": "Trees"
        },
        "5": {
          "loves": "Weapons",
          "hates": "Armour"
        },
        "6": {
          "loves": "One of the Knights",
          "hates": "One of the Knights"
        }
      }
    },
    "The Fortress": {
      "d6": 1,
      "d12": 22,
      "quote": "A cage in stone, all thorned and vast\nDisguise a scheme in shadows cast",
      "omens": [
        "The Thorn Seer roams the Realm, proclaiming an invasion of great scuttling monsters is coming soon.",
        "A messenger declares that the Thorn Seer has reclaimed a lost fortress (in the Myth Hex), creating an impenetrable sanctuary for when the invasion comes.",
        "Three claw swarm cutters peer from their tunnels, scouts for the invasion. If seen they scutter back underground.",
        "A smith and her three young apprentices are looking for a new home. They left the Fortress, as the Thorn Seer wanted the impossible from them, demanding whole walls of iron be built.",
        "The voice of the Thorn Seer is heard across the land. The invasion is here, numberless hordes of the claw swarm attacking the Fortress. They will not actually breach the Fortress, as they are creations of the Thorn Seer.",
        "The invasion defeated, the Thorn Seer demands to be made ruler of the Realm, the Fortress as his Seat of Power."
      ],
      "cast": [
        {
          "name": "The Thorn Seer",
          "stats": "VIG 9, CLA 16, SPI 14, 3GD",
          "equipment": "A2 (thorny body, helm), Spined mace (d8 hefty), dagger (d6)",
          "notes": "Sees pain in the past and the future."
        },
        {
          "name": "Claw Swarm Cutter",
          "stats": "VIG 9, CLA 9, SPI 3, 3GD",
          "equipment": "A1 (green carapace), Claws (2d6), acid spit (d8)",
          "notes": "Cunning instinct (see below)."
        },
        {
          "name": "Claw Swarm Hulk",
          "stats": "VIG 15, CLA 5, SPI 5, 6GD",
          "equipment": "A2 (red carapace), Great claws (2d8), blunt instinct",
          "notes": ""
        }
      ],
      "cunning_instincts_table": {
        "1": {
          "action": "Burrow",
          "objective": "Regroup later"
        },
        "2": {
          "action": "Scatter",
          "objective": "Surprise the enemy"
        },
        "3": {
          "action": "Camouflage",
          "objective": "Target a single enemy"
        },
        "4": {
          "action": "Sprout wings",
          "objective": "Confuse the enemy"
        },
        "5": {
          "action": "Spawn more",
          "objective": "Set up an advantage"
        },
        "6": {
          "action": "Spit acid",
          "objective": "Exploit a weak spot"
        }
      }
    },
    "The Citadel": {
      "d6": 1,
      "d12": 23,
      "quote": "A watcher yond our earthly sight\nBeyond the reach of falcon's flight",
      "omens": [
        "The silhouette of the Citadel appears on the horizon, teetering and crooked. Any Seers you meet warn you not to go there.",
        "The nearest Seer skulks between the trees, seeking a new Sanctum so that the Watcher will not find them.",
        "Iron hounds, forged in the Citadel, scour the land, terrorising but not harming Seers. A pack of four charge past the Company, heading to the nearest Seer.",
        "The Watcher from the Citadel is seeking out every Seer, warning them not to interfere with the destiny of the Realm.",
        "A glowing orb falls from the sky, landing with an explosion in the nearby woods. Screams follow from the crash site, and an Immolated Seer bursts from the woods. In their death throes they attack any nearby, losing d6 VIG each round.",
        "The Citadel glows, flooding the Realm with intense white light. Seers scream. When the light fades the Citadel is gone."
      ],
      "cast": [
        {
          "name": "The Watcher in the Citadel, Setizi",
          "stats": "VIG 12, CLA 17, SPI 15, 8GD",
          "equipment": "A1 (silver mail). Can Focus. Glassy longsword (2d8 hefty), crystal lantern (peering into it gives a hazy view of a location within the Realm that you have visited. Light causes pain to Seers)",
          "notes": "Protecting a destined future (see below)."
        },
        {
          "name": "Immolated Seer",
          "stats": "VIG 10, CLA 7, SPI 7, 6GD",
          "equipment": "Bursts of anguished flames (d8 blast)",
          "notes": ""
        },
        {
          "name": "Iron Hound",
          "stats": "VIG 10, CLA 12, SPI 2, 2GD",
          "equipment": "A3 (metallic body), Forged jaws (d8)",
          "notes": "Focused on their quarry"
        }
      ],
      "destined_future_table": {
        "1": {
          "subject": "Ruler of the Realm",
          "destiny": "Must die next Season"
        },
        "2": {
          "subject": "A Seer",
          "destiny": "Must leave the Realm"
        },
        "3": {
          "subject": "A member of the Company",
          "destiny": "Must be imprisoned in the Citadel"
        },
        "4": {
          "subject": "A Knight",
          "destiny": "Must die"
        },
        "5": {
          "subject": "A Vassal",
          "destiny": "Must find the City"
        },
        "6": {
          "subject": "A courtier",
          "destiny": "Must rule the Realm"
        }
      }
    },
    "The Catacomb": {
      "d6": 1,
      "d12": 24,
      "quote": "Under skarny bough a world beneath\nBygone souls acraw in furied grief",
      "omens": [
        "Beneath a wilting tree, a heap of misshapen bones, seeming to sprout from the ground itself. They feel slightly warm.",
        "A narrow stone stairway leads down, below a huge blackened tree. It twists into a branching tunnel, each of the three branches concealing a lurking Boneborn. They attack anybody who enters.",
        "A grinding sound beyond the trees. Investigating reveals a rushing river of bones, heading from the Myth Hex, running toward the nearest body of water.",
        "The ground opens, the Company trapped in an arena of bones. They must fight three waves, each of d6 Boneborn. If they survive, a stairway to the surface opens.",
        "Three warbands of Bones at Arms march forward. They roam the land, taking out their anger on the living.",
        "The Bone Slayer emerges, fighting on behalf of all of the dead. He fights any challengers in a duel, banishing losers to a bony underground prison. Turns to ash if defeated, releasing all prisoners."
      ],
      "cast": [
        {
          "name": "Boneborn, Death's Creations",
          "stats": "VIG 10, CLA 10, SPI 5, 4GD",
          "equipment": "A2 (bone form, see below)",
          "notes": "Jealous of the living."
        },
        {
          "name": "Bones at Arms, the Soldiers of Death",
          "stats": "VIG 10, CLA 6, SPI 6, 4GD",
          "equipment": "A2 (bonehelms and boneshields), Bonehammer (d8 hefty), boneshield (d4)",
          "notes": ""
        },
        {
          "name": "The Bone Slayer, Upholder of Bonelaw",
          "stats": "VIG 15, CLA 14, SPI 11, 8GD",
          "equipment": "A3 (bonehelm, boneplate, hardened bones), Bonebreaker (2d10 long, cannot be wielded by the living)",
          "notes": ""
        }
      ]
    },
    "The Hound": {
      "d6": 1,
      "d12": 25,
      "quote": "The eye of a slayer, the nose of a hound\nIn wind and flesh, a hunter unbound",
      "omens": [
        "A search party. They're looking for an elderly woman, a herb gatherer. She's been missing for days.",
        "First a patch of blood, then pieces of flesh, gradually becoming clear as the remains of the missing elderly woman.",
        "Another heap of torn remains, this time some sort of deer. All present must pass a CLA Save or else feel compelled to sniff and paw at the remains. They now have the Hound Within (see opposite), the effects lasting until this Myth is resolved.",
        "The shadows seem to grow. Any who brave the darkness are attacked by the Hound in Shadow. It does not attack those affected by the Hound Within unless they attack first.",
        "An icy wind, then the Hound on the Wind attacks from nowhere, focusing its attacks on those affected by the Hound Within. If slain, it returns to the wind.",
        "A heap of flesh and bones. The Hound in Flesh bursts out, fighting to the death."
      ],
      "cast": [
        {
          "name": "The Hound in Shadow",
          "stats": "VIG 5, CLA 16, SPI 5, 5GD",
          "equipment": "A2 (muscular hide, wiry fur), Jaws (2d8)",
          "notes": "Cannot be hurt in darkness"
        },
        {
          "name": "The Hound on the Wind",
          "stats": "VIG 10, CLA 16, SPI 5, 7GD",
          "equipment": "A2 (muscular hide, wiry fur), Jaws (2d8)",
          "notes": "Impossibly fast, moves and attacks twice each turn"
        },
        {
          "name": "The Hound in Flesh",
          "stats": "VIG 15, CLA 16, SPI 5, 7GD",
          "equipment": "A2 (muscular hide, wiry fur)",
          "notes": "Attacks by those affected by the Hound Within are Impaired."
        }
      ],
      "hound_within_table": {
        "1": {
          "day_effect": "Enhanced smell",
          "night_effect": "Cannot use hands"
        },
        "2": {
          "day_effect": "Enhanced hearing",
          "night_effect": "Unable to speak"
        },
        "3": {
          "day_effect": "Enhanced vision",
          "night_effect": "Fear of fire"
        },
        "4": {
          "day_effect": "Can eat raw and rotten meat",
          "night_effect": "Pass a CLA Save or wander the wilderness"
        },
        "5": {
          "day_effect": "Animals respect you",
          "night_effect": "Howl at the moon"
        },
        "6": {
          "day_effect": "Powerful jaws (d8)",
          "night_effect": "Cannot sleep indoors"
        }
      }
    },
    "The Glade": {
      "d6": 1,
      "d12": 26,
      "quote": "Amid the stillen halt and hush\nA poison blooms in grove alush",
      "omens": [
        "A calm glade amid dense trees. Complete silence. Three empty plinths, one each in black, grey, and white stone. Anyone attempting to leave the clearing finds themselves back within it until an offering is left on each plinth, regardless of its value.",
        "In the Glade, the White Stone Hunter asks 'whom shall I aid?' to whoever left their offering. They vanish and perform a kind act to that person.",
        "In the Glade, the white offering is returned.",
        "In the Glade, the Grey Stone Hunter asks 'whom shall I punish?' to whoever left their offering. They vanish and perform a punishment, the effects lasting until the next Spring (see opposite).",
        "In the Glade, the grey offering is returned.",
        "In the Glade, the Black Stone Hunter asks 'whom shall I kill?' to whoever left their offering. They vanish and attempt to kill that person. The offering is left on the body of the target if killed."
      ],
      "cast": [
        {
          "name": "White Stone Hunter, Serephyllea",
          "stats": "VIG 12, CLA 12, SPI 16, 8GD",
          "equipment": "A2 (silent mail, silver plate), Hunting spear (1d10 to 3d10, made from the material of their offering)",
          "notes": "Based on the offering left at their plinth."
        },
        {
          "name": "Grey Stone Hunter, Gravok",
          "stats": "VIG 13, CLA 15, SPI 12, 8GD",
          "equipment": "A2 (heavy cloak, round helm), Hunting bow (1d8 to 3d8, arrows made from the material of their offering)",
          "notes": ""
        },
        {
          "name": "Black Stone Hunter, Therenas",
          "stats": "VIG 13, CLA 16, SPI 17, 8GD",
          "equipment": "Armour 2-4 (armour made from the material of their offering), Scythe blade (2d10 or 2d8 blast, long)",
          "notes": ""
        }
      ],
      "arbitrary_punishment_table": {
        "1": {
          "immediate_effect": "Best clothes stolen",
          "later_effect": "Eyes fall out"
        },
        "2": {
          "immediate_effect": "Hiccups",
          "later_effect": "Constant coldness"
        },
        "3": {
          "immediate_effect": "Spoiled food",
          "later_effect": "Loss of taste"
        },
        "4": {
          "immediate_effect": "Slippery hands",
          "later_effect": "Broken limb"
        },
        "5": {
          "immediate_effect": "Hair falls out",
          "later_effect": "Severed hand"
        },
        "6": {
          "immediate_effect": "Annoying insects",
          "later_effect": "Teeth fall out"
        }
      }
    },
    "The Tournament": {
      "d6": 1,
      "d12": 27,
      "quote": "Tween cog and blade, a challenge thrown\nBlood must beat bronze, its mettle shown",
      "omens": [
        "A tinkerer, accompanied by his Clockwork Knights. He boasts that a tournament will see his Knights defeat any others.",
        "A messenger from the Seat of Power. The Company is called to represent the Realm against the Clockwork Knights.",
        "Nimiod parades his Clockwork Knights before the crowd. The Company are also presented for those watching.",
        "The Company compete all together, paired against a Company of Clockwork Knights. It is a mounted battle, melee weapons only, competitors eliminated if they take a Mortal Wound.",
        "Now the Company must fight on foot, no shields permitted.",
        "Finally, one Knight must take on the Clockwork Champion."
      ],
      "cast": [
        {
          "name": "Nimiod, Genius Tinkerer",
          "stats": "VIG 10, CLA 15, SPI 12, 2GD",
          "equipment": "Fine sword (2d6), layered silks, focused eyes",
          "notes": ""
        },
        {
          "name": "Clockwork Knight",
          "stats": "VIG 13, CLA 5, SPI 5, 6GD",
          "equipment": "A4 (metal body, copper plate, helm, shield), Fine sword (2d6), shield (d4)",
          "notes": "Follows Nimiod's verbal commands. Grinding voice, imitating knightliness. Subject to one quirk (see below)."
        },
        {
          "name": "Clockwork Champion",
          "stats": "VIG 13, CLA 5, SPI 5, 6GD",
          "equipment": "A4 (metal body, copper plate, helm, shield), Fine longsword (2d8 hefty), shield (d4)",
          "notes": "As above, but knows all Feats, will disobey Nimiod in order to preserve its own life and honour."
        }
      ],
      "clockwork_quirks_table": {
        "1": {
          "quirk": "Ignore Mortal Wounds",
          "behavior": "Boasts and taunts"
        },
        "2": {
          "quirk": "Cannot be disarmed",
          "behavior": "Strict etiquette"
        },
        "3": {
          "quirk": "Human-like voice",
          "behavior": "Cunning fighter"
        },
        "4": {
          "quirk": "Mean arm (can Smite)",
          "behavior": "Soulless intimidation"
        },
        "5": {
          "quirk": "Real skull for head",
          "behavior": "Showboats for crowd"
        },
        "6": {
          "quirk": "Extra fast (can Deny)",
          "behavior": "Stiff and jerky"
        }
      }
    },
    "The Bull": {
      "d6": 1,
      "d12": 28,
      "quote": "The bless'd are bound for tragic end\nWhile jealous eyes make wrath their friend",
      "omens": [
        "Leaf-covered acolytes parade a newly born green bull, declaring a blessing on the Realm. They are taking him to a secret location for safekeeping.",
        "People rejoice in the Blessing of the Bull, now clearly taking effect (see opposite).",
        "On a dusty trail, the Bull lies dead. A scream is heard in the distance, two children running to say that they saw the Knights standing over the corpse. The Blessings of the Bull are lost.",
        "Five leaf-clad guards immediately charge the Knights, declaring them enemies of the Realm for killing the Bull.",
        "A pair of winged fiends are seen in the distance, harassing a lost horse, tormenting it with their blades. They flee if confronted.",
        "A lone leaf-clad guard is fending off an attack from five winged fiends, emboldened by their numbers. If the guard survives he vouches for the Knights' innocence."
      ],
      "cast": [
        {
          "name": "The Bull, Green of Horn and Hide",
          "stats": "VIG 10, CLA 5, SPI 3, 2GD",
          "equipment": "Horns (d6)",
          "notes": "Docile temperament"
        },
        {
          "name": "Leaf-clad Guard, led by Solas",
          "stats": "VIG 11, CLA 8, SPI 8, 4GD",
          "equipment": "A2 (leaf-clad mail, helm), Broad-bladed guisarme (d10)",
          "notes": "Intense love for the Bull. Solas wields a great guisarme (2d10 slow)."
        },
        {
          "name": "Winged Fiends, Bringers of Sorrow",
          "stats": "VIG 8, CLA 17, SPI 4, 5GD",
          "equipment": "A1 on ground only (leathery wings), Bladed arms (2d6), clumsy flight",
          "notes": "Want to sow misery and watch from afar."
        }
      ],
      "blessings_of_bull_table": {
        "1": {
          "first": "Drinks tastes better",
          "also": "Perfect weather"
        },
        "2": {
          "first": "Bread stays warm",
          "also": "Lost items return"
        },
        "3": {
          "first": "Heavenly dreams",
          "also": "New fruit flourishes"
        },
        "4": {
          "first": "The sick are healed",
          "also": "Fish leap into nets"
        },
        "5": {
          "first": "Wounds are mended",
          "also": "Music sounds sweeter"
        },
        "6": {
          "first": "The wind smells great",
          "also": "Breathtaking aurora"
        }
      }
    },
    "The Hydra": {
      "d6": 1,
      "d12": 29,
      "quote": "Our best fall before their time\nThe worst shall live forever",
      "omens": [
        "The Candle Knight lies broken in the road, unable to walk. They tell of the Hydra rising from a pool of stagnant water. It killed the rest of her Company. It cannot be killed. It must be endured.",
        "A wide hole leading down into damp darkness. Any disturbance awakens the Hydra, bursting forth and attacking the Company. It shrugs off any attack.",
        "Atop a hill, the Hydra screeches triumphantly in the ruins of a shattered stone outpost. It fights if disturbed, mocking the Company if they do not realise it cannot be killed.",
        "A rapidly spreading fire among the trees. The Hydra waits in ambush, now able to breathe fire (d8 blast).",
        "A roar from above, and the Hydra descends, now winged and able to fly.",
        "The Hydra, visibly weakened, crawls toward a bubbling spring. As it submerges itself the water boils, turning black, and the Hydra is gone."
      ],
      "cast": [
        {
          "name": "The Hydra, Punishment for Past Sins",
          "stats": "VIG 19, CLA 10, SPI 7, 12GD",
          "equipment": "A5 (unbreakable scales), Onslaught of heads (2d10 blast)",
          "notes": "Cannot be harmed. Regenerates any lost body part and heals any wounds. Sometimes feigns weaknesses to trick attackers into thinking they have a chance. One head is always holding onto some sort of treasure (see below), baiting victims."
        },
        {
          "name": "The Candle Knight, Aluane",
          "stats": "VIG 14, CLA 13, SPI 8, 8GD",
          "equipment": "A3 (mail, plate, white helm), Longsword (2d8 hefty), shortsword (2d6)",
          "notes": "Can whisper into a candle to deliver a message anywhere within the Realm. Wants to get far from the Hydra."
        }
      ],
      "treasures_of_hydra_table": {
        "1": {
          "descriptor": "Golden",
          "object": "Crown"
        },
        "2": {
          "descriptor": "Bejewelled",
          "object": "Sceptre"
        },
        "3": {
          "descriptor": "Engraved",
          "object": "Longsword"
        },
        "4": {
          "descriptor": "Luminous",
          "object": "Chalice"
        },
        "5": {
          "descriptor": "Ancient",
          "object": "Spear"
        },
        "6": {
          "descriptor": "Runic",
          "object": "Shield"
        }
      }
    },
    "The Spire": {
      "d6": 1,
      "d12": 30,
      "quote": "The pinnacle of stool and shroom\nGrown to fall in putrid bloom",
      "omens": [
        "A finely-dressed mushroom gatherer is complaining of a lean harvest. He says a great fungal spire is overdue, which will spread new fungus around the Realm.",
        "A haze of yellow spores on the wind. Those inhaling it see the world around them start to bend and breathe, mouths opening in the ground. It soon passes.",
        "Six fungal serfs are out gathering food to take back to the Spire. They take without asking but have no will to fight.",
        "A round cabin on a wooded hill, shouting within. Two stargazers, sisters, each yelling that the other one is a shape-shifter from the stars. They have both been tricked by hallucinogenic spores.",
        "The Fungal Knight shambles forward, ensuring nobody plans to interfere with the Spire. He has little appetite to fight and just wants to rot away to sludge.",
        "A squelch heard across the Realm. The Spire and all fungal beings collapse into sludge, seeping into the ground. Next season the fungus will be bountiful."
      ],
      "cast": [
        {
          "name": "The Spire, the Great Fungal Tower",
          "stats": "9GD, count as a structure",
          "equipment": "A2 (bouncy flesh)",
          "notes": "Spores grant pleasing hallucinations to friends or nightmare visions to foes."
        },
        {
          "name": "Fungal Serf, Born of the Spire",
          "stats": "VIG 10, CLA 5, SPI 5, 1GD",
          "equipment": "Heavy fist (d6), bright colouration",
          "notes": "Wants to collect food for the Spire. Doesn't understand ownership."
        },
        {
          "name": "Fungal Knight, Rotting",
          "stats": "VIG 13, CLA 7, SPI 8, 3GD",
          "equipment": "A2 (mould-covered mail, shield), Fungal mace (d8 hefty), shield (d4)",
          "notes": "Impatient to rot away fully."
        }
      ],
      "fungal_serfs_table": {
        "1": {
          "appearance": "Huge head, teetering",
          "manner": "Wheezing spores"
        },
        "2": {
          "appearance": "Spindly limbs",
          "manner": "Curious of the world"
        },
        "3": {
          "appearance": "Bloated body",
          "manner": "Aggressively diligent"
        },
        "4": {
          "appearance": "Broad cap",
          "manner": "Warm and jovial"
        },
        "5": {
          "appearance": "Covered in gills",
          "manner": "Proud and aloof"
        },
        "6": {
          "appearance": "Tall and clumsy",
          "manner": "Eating own body"
        }
      }
    },
    "The Sprite": {
      "d6": 41,
      "d12": 82,
      "quote": "Sodden gifts from spriggle wylde\nAtop a crone, below a child",
      "omens": [
        "A half-asleep fisherman by a duckweed-covered pond. He warns the \"old girl o' the pond\" can't be trusted on her word.",
        "A pond thick with duckweed, the Sprite emerges, an old woman with the voice and movement of a child. She takes a liking to one member of the Company and asks lots about them before fleeing into the pond.",
        "Another weed-covered pond. The Sprite emerges in the centre, appearing serious. She asks her beloved to name any object they want, from the past, present, or future. She insists until they give an answer, then ducks back under water.",
        "Two beings of greenish water fight loudly, each proclaiming that \"she loves only me\".",
        "A still lake, the green arms of the Sprite emerging on the bank, holding the requested item for their beloved. She attacks if the gift is refused.",
        "The Sprite, now angry, is here to reclaim the gift. She'll take it by force if needed."
      ],
      "cast": [
        {
          "name": "The Sprite, Old Girl o' the Pond, Wrundl",
          "stats": "VIG 12, CLA 16, SPI 16, 7GD",
          "armor": "A1 (robe of thick pond weed)",
          "attacks": "Water shaped to a blade (3d6) or arrow (2d6)",
          "description": "Wants to interfere with the way things should be. Feels intense love for one thing at a time before forgetting them entirely."
        },
        {
          "name": "Watery Being",
          "stats": "VIG 10, CLA 4, SPI 4, 3GD",
          "description": "Once people, drowned by the Sprite. They long for her love, but she has forgotten them."
        },
        {
          "name": "Drowsy Fisherman, Mucks",
          "stats": "VIG 12, CLA 6, SPI 10, 4GD",
          "armor": "A1 (rusty pot helm), patchwork clothes",
          "description": "Plans petty revenge against the Sprite, but she has already forgotten him."
        }
      ],
      "watery_creations_table": {
        "1": {
          "dwelling": "Moonwatcher settlement",
          "sanctum": "Steam spring",
          "monument": "Silver arch"
        },
        "2": {
          "hazard": "Strangling fog",
          "curse": "All light fades here",
          "ruin": "Darkened fort"
        },
        "3": {
          "voice": "Low gurgling",
          "attack": "Lashing weeds (2d6)"
        },
        "4": {
          "voice": "Splashing cries",
          "attack": "Bloated limbs (d8)"
        },
        "5": {
          "voice": "Sloshing song",
          "attack": "Rusted axe (d8)"
        },
        "6": {
          "voice": "Frothing hiss",
          "attack": "River rock (2d10 slow)"
        }
      },
      "additional_attacks": {
        "drowning_moan": "Choking hands (d6)",
        "rumbling_roar": "Cold scream (d6 blast)"
      }
    },
    "The Hole": {
      "d6": 42,
      "d12": 84,
      "quote": "In mud and root, from sunken land\nCareful hands plan works agrand",
      "omens": [
        "A hole in the ground rips open, growing as trees and rocks tumble in. A small blue Holfolk, Gruff, scurries out into a tree. She is shy, but explains that this only happens when there's work to be done on the surface. Those from above can't enter the Hole, held back by an invisible force.",
        "Four Holfolk run past, screaming. An angry man on a horse chases them down, claiming they are spies from a wicked Realm. They are just curious, really.",
        "A team of Ardwright builders hammer away at a great project. They explain what it is, but not why, and will not indulge in conversation.",
        "Bear-a-boar staggers around the woods, calling out a challenge to any animal that disputes his sovereignty. A pitiful sight.",
        "A band of Holfolk have Bear-a-boar in chains, taking him back to the Hole where he was banished.",
        "A team of Ardwrights are sealing up a hole in the ground, the final entrance to their world, their work completed."
      ],
      "cast": [
        {
          "name": "Holfolk, Little Ones of the Hole",
          "stats": "VIG 7, CLA 7, SPI 15, 5GD",
          "description": "Good at hiding. No means or desire to fight. Want to explore every part of every Realm."
        },
        {
          "name": "Ardwright, the Jade Architects",
          "stats": "VIG 10, CLA 15, SPI 3, 1GD",
          "armor": "A2 (green helm and plates)",
          "attacks": "Rockhammer (d8 hefty, can fuse natural objects together as if by strong adhesive)",
          "description": "Want everyone to do their job."
        },
        {
          "name": "Bear-a-boar, Deposed King of Beasts",
          "stats": "VIG 15, CLA 12, SPI 4, 6GD",
          "armor": "A2 (bulky body, tattered mail)",
          "attacks": "Tired claws (2d8)",
          "description": "Want to be respected or feared."
        }
      ],
      "ardwright_projects_table": {
        "1": {
          "creation": "Watchtower",
          "material": "Branches"
        },
        "2": {
          "creation": "Great hall",
          "material": "Rocks"
        },
        "3": {
          "creation": "Statue",
          "material": "Grass"
        },
        "4": {
          "creation": "Ship",
          "material": "Mud"
        },
        "5": {
          "creation": "Mausoleum",
          "material": "Bones"
        },
        "6": {
          "creation": "Bridge",
          "material": "Petals"
        }
      },
      "locations": {
        "dwelling": "Secret vineyard",
        "sanctum": "Lily field",
        "monument": "Eternal beacon",
        "hazard": "Fire nettles",
        "curse": "Eye burning fumes",
        "ruin": "Bone mausoleum"
      }
    },
    "The Mist": {
      "d6": 43,
      "d12": 86,
      "quote": "Agrime'd air a'dims the gleam\nA realm is lost in fearful dream",
      "omens": [
        "The air turns cool and a thin mist begins to roll in. A flock of red crows fly past, shrieking as they make urgent flight.",
        "The Mist thickens, a cold leaden curtain. Vision beyond each Hex is impossible.",
        "Six horrors lurk just beyond vision, haunting sounds and faint shadows. They stalk the Company, only striking if somebody becomes isolated.",
        "The Mist grows ever more dense, vision limited to a few feet. Even bright lights fade to a dull glow. All travel is blind.",
        "A militia warband, defected from a nearby Holding, open fire on the Company, mistaking them for horrors in the Mist.",
        "A dull bell clangs, a towering figure barely visible striding through the Mist. It's impossible to get closer to it. As it fades into the distance the Mist begins to clear. By the next Morning it has completely passed, leaving silvery dew. A Seer has been taken by the Mist, never to return."
      ],
      "cast": [
        {
          "name": "The Mist",
          "description": "Pushed back by smoke from burning bones."
        },
        {
          "name": "Misguided Militia, led by Harlger",
          "stats": "VIG 10, CLA 10, SPI 8, 4GD",
          "armor": "A2 (cloaked mail, full helm)",
          "attacks": "Shortbow (d6), axe (d8), handaxe (d6)",
          "description": "Hargler has a longbow (d8 long) and wants to overthrow her former liege."
        },
        {
          "name": "Horror in the Mist, Desperate Stalker",
          "stats": "VIG 7, CLA 14, SPI 4, 4GD",
          "armor": "A1 (cold hide)",
          "attacks": "Gripping claws and fangs (2d6)",
          "description": "Fear of bells and being seen. Shifting form (reroll frequently)."
        }
      ],
      "shifting_form_table": {
        "1": {
          "call": "Hooting",
          "body": "Long dragging limbs"
        },
        "2": {
          "call": "Shrieking",
          "body": "Hanging wet jaw"
        },
        "3": {
          "call": "Grinding",
          "body": "Huge black eyes"
        },
        "4": {
          "call": "Weeping",
          "body": "Spiked prehensile tail"
        },
        "5": {
          "call": "Gasping",
          "body": "Many rows of teeth"
        },
        "6": {
          "call": "Singing",
          "body": "Normal pitiful human"
        }
      },
      "locations": {
        "dwelling": "Reclusive perfumery",
        "sanctum": "Sapphire woods",
        "monument": "Pillar of ice",
        "hazard": "Frostbite fog",
        "curse": "Blinding blizzards",
        "ruin": "Shattered stained glass"
      }
    },
    "The Gargoyle": {
      "d6": 44,
      "d12": 88,
      "quote": "In hearthy glow, small joys take flight\nWhilst bitter past doth dwell in spite",
      "omens": [
        "Two boisterous lads clamber on a ruined temple, smashing the eroded statuary with a heavy hammer. They say they're just following orders from a nearby Seer.",
        "The Gargoyle descends on the Company, shouting that he means no harm. He's looking for a lost item, and expects the Knights to find it. He will cause an argument for his own amusement if he can, otherwise he leaves.",
        "Atop a huge stone ruin, the Gargoyle carves away at the stone with his bare hands, sculpting beasts. Two such beasts watch on, eager for a new companion.",
        "In the shade of a grey tree the Gargoyle argues with a nearby Seer. He claims that he alone gives the Seers their knowledge. This is a lie.",
        "The two lads who were smashing statues lie petrified by a sculpted beast's bite.",
        "In a quarry the Gargoyle smashes his sculpted beasts to rubble one by one. They don't resist. After this he takes flight for another Realm, declaring this one dull."
      ],
      "cast": [
        {
          "name": "The Gargoyle, Astergrist",
          "stats": "VIG 14, CLA 17, SPI 12, 6GD",
          "armor": "A4 (hulking stony body), clumsy flight",
          "attacks": "Great claws (2d8) and tail (d10 blast)",
          "description": "Well-read and ill-tempered. Hates the sun. Wants to bring back anything old. Always seeking a specific item."
        },
        {
          "name": "Sculpted Beast",
          "stats": "VIG 10, CLA 6, SPI 6, 3GD",
          "armor": "A3 (stony body, wolflike)",
          "attacks": "Stone bite (2d8, wounds cause the victim to slowly petrify over the next week, reversed only if the Gargoyle grants a pardon)",
          "description": "Mindlessly serves the Gargoyle's whims."
        }
      ],
      "lost_item_table": {
        "1": {
          "object": "Twisted tin flute",
          "last_seen": "Sinking into water"
        },
        "2": {
          "object": "Bejewelled chess set",
          "last_seen": "In the Seat of Power"
        },
        "3": {
          "object": "Huge cauldron",
          "last_seen": "Seized by a Seer"
        },
        "4": {
          "object": "Map-marked shield",
          "last_seen": "Buried in the woods"
        },
        "5": {
          "object": "Mummified Seer head",
          "last_seen": "Hurled from a peak"
        },
        "6": {
          "object": "Crown of raw iron",
          "last_seen": "Entombed in a tree"
        }
      },
      "locations": {
        "dwelling": "Orchard village",
        "sanctum": "Luminous pond",
        "monument": "Shell circle",
        "hazard": "Chilling bushes",
        "curse": "Obscuring reeds",
        "ruin": "Broken henge"
      }
    },
    "The Changeling": {
      "d6": 45,
      "d12": 90,
      "quote": "When eyes can lie and words beguile\nSo falsehoods gain a truthness vile",
      "omens": [
        "A warm gust. A dove looks at one Knight questioningly before fluttering away. Secretly roll or choose a victim whom the Changeling has captured, stealing their form, memories, and place within the Realm.",
        "An elderly rider sits on a wall, his steed chased away by horned wolves. He passes on a Seer's warning, the Changeling walks the Realm. Trust no one.",
        "A mature Knight (rolled as normal) arriving in the Realm, seeking the Seat of Power to offer her service. If she is not the Changeling she has good intentions.",
        "A fleshy door in a tree trunk. It snaps shut as quickly as it is noticed, no trace left.",
        "A pair of horned wolves leap from hiding, attacking a random member of the Company, trying to drag them away.",
        "Whoever is the Changeling stands in a clearing, facing away from the Company. If disturbed they unfold into their true form before fleeing, looking for a passage back to their own world."
      ],
      "cast": [
        {
          "name": "The Changeling, in its True Form",
          "stats": "VIG 10, CLA 16, SPI 17, 8GD",
          "armor": "A2 (twisting, shapeless form)",
          "attacks": "Warping touch (d8, Mortal Wound leaves the victim as a soft, quivering heap)",
          "description": "Shapeshifter that steals forms, memories, and places within the Realm."
        },
        {
          "name": "Elderly Rider, Beltor",
          "stats": "VIG 6, CLA 6, SPI 9, 9GD",
          "armor": "A2 (mail, leather helm)",
          "attacks": "Longsword (2d8 hefty), throwing axes (d6)",
          "description": "Rasping voice. Rejected a knighthood."
        },
        {
          "name": "Horned Wolves, Malicorn",
          "stats": "VIG 12, CLA 8, SPI 3, 3GD",
          "attacks": "Gore and tear (2d8), tries to weaken the target and return later to finish the job",
          "description": "Wolves with horns that serve the Changeling."
        }
      ],
      "chosen_victim_table": {
        "1": {
          "victim": "Ruler of the Realm",
          "clue": "They cannot eat"
        },
        "2": {
          "victim": "Known Knight",
          "clue": "They cannot drink"
        },
        "3": {
          "victim": "Known Seer",
          "clue": "Animals hate them"
        },
        "4": {
          "victim": "Known Vassal",
          "clue": "Children are scared"
        },
        "5": {
          "victim": "The last person the Company spoke to",
          "clue": "They do not have any of their memories"
        },
        "6": {
          "victim": "The next person the Company meets",
          "clue": "Sunlight causes great discomfort"
        }
      },
      "locations": {
        "dwelling": "Bright windmill",
        "sanctum": "Silent sands",
        "monument": "Crowned oak",
        "hazard": "Scalding heat",
        "curse": "Mocking clouds",
        "ruin": "Ghostly village"
      }
    },
    "The Inferno": {
      "d6": 46,
      "d12": 92,
      "quote": "Flames of greed in earth entrenched\nIn deepest soil no thirst bequenched",
      "omens": [
        "A faint heat can be felt from the soft parts of the ground, like the embers of yesterday's fire.",
        "Smoke rises from behind a row of trees. A crackling forest fire burns. It can be stopped if the Company acts quickly, else this small patch of forest burns down.",
        "An orchard lies burned to ash, the young farmer weeps among the embers. They're left with no choice but to plead for aid at the nearest Holding.",
        "A smouldering rift in the ground yawns open, the Red Serpent emerging, writhing through the hot air like a great eel. It demands gold and will engage in no other topic of conversation.",
        "A stone watchtower, two guards within, slowly sinking into the ground. The stone appears to be melting as the ground opens up, swallowing the tower in a pit of flame.",
        "The Serpent encircles a pile of riches, taken from all over the Realm, slowly sinking back into the molten earth below."
      ],
      "cast": [
        {
          "name": "The Red Serpent, Guivregule",
          "stats": "VIG 18, CLA 10, SPI 10, 10GD",
          "armor": "A4 (blazing scales, strips of golden mail)",
          "attacks": "Snapping jaw (2d10), whip tail (d10), flaming breath (3d10 blast, once per phase)",
          "description": "Regal voice. Wants gold above all else, and is willing to play the long game to get more."
        },
        {
          "name": "Young Farmer, Etane",
          "stats": "VIG 12, CLA 10, SPI 6, 2GD",
          "equipment": "Petty smoke-damaged belongings",
          "description": "Wants to build a new life, forgetting the past."
        },
        {
          "name": "Watchtower Guards, Hendon, Terone",
          "stats": "VIG 10, CLA 12, SPI 9, 3GD",
          "armor": "A2 (gambeson, helm)",
          "attacks": "Warfork (d10 long), packed lunch",
          "description": "Wants a quiet life and respectful work."
        }
      ],
      "packed_lunch_table": {
        "1": {
          "food": "Meaty cake",
          "drink": "Old wine"
        },
        "2": {
          "food": "Spiced sausages",
          "drink": "Medicinal tea"
        },
        "3": {
          "food": "Thick broth",
          "drink": "Strong mead"
        },
        "4": {
          "food": "Raw cabbage",
          "drink": "Apple juice"
        },
        "5": {
          "food": "Steamed snails",
          "drink": "Pond water"
        },
        "6": {
          "food": "Potato-filled bread",
          "drink": "Lemon water"
        }
      },
      "locations": {
        "dwelling": "Shepherd tents",
        "sanctum": "Fruits of clarity",
        "monument": "Painted cliff",
        "hazard": "Boulder rapids",
        "curse": "The haze",
        "ruin": "Scorched farm"
      }
    },
    "The Harp": {
      "d6": 47,
      "d12": 94,
      "quote": "Lilt and dirge in bough astrung\nAs sharp as soft, his doom asung",
      "omens": [
        "The wind rises, rustling branches of nearby trees, almost sounding like music for a moment.",
        "A frail carpenter is rummaging through the woods, grumbling as he searches for just the right type of wood. He says he's working on a great project, but is reluctant to share details.",
        "The carpenter cries out, he's fighting off six wood centipedes as he tries to carry freshly cut wood back to his workshop.",
        "The wind stirs the branches and leaves, glittering music in the air, now loud enough to hear clearly. This affects all in the Realm.",
        "The carpenter, riding a rickety cart, the Harp concealed beneath a grey blanket. He appears fraught, insisting the Knights take the Harp and make sure it doesn't fall into the wrong hands.",
        "A parade of white-cloaked acolytes lead a council of Seers from across the Realm. They declare that the Harp must be buried until it is truly needed."
      ],
      "cast": [
        {
          "name": "The Harp, Orlyndra",
          "description": "If played with malice, d12 ranged Attack. If played soothingly, those who fall asleep to its music restore all Virtues. If played badly, d12 Damage to the player. If played by the creator, see special effects table."
        },
        {
          "name": "Frail Carpenter, Quilfrey",
          "stats": "VIG 6, CLA 14, SPI 17, 2GD",
          "attacks": "Clumsy axe (d8 long), straggly beard",
          "description": "Shaky voice and hands, optimistic spirit. Knows the Harp will be his final and most important piece of work."
        },
        {
          "name": "Wood Centipede, Fibrex, Scuttermum",
          "stats": "VIG 7, CLA 5, SPI 2, 1GD",
          "armor": "A1 (glossy shell), insatiable appetite",
          "attacks": "Mandibles (2d6 or devour a wooden item)",
          "description": "Insatiable appetite for wood and wooden items."
        }
      ],
      "harp_creator_effects_table": {
        "1": {
          "effect": "Fall into deep sleep",
          "duration": "Just a moment"
        },
        "2": {
          "effect": "Shadows vanish",
          "duration": "For the Phase"
        },
        "3": {
          "effect": "The sun darkens",
          "duration": "Until next morning"
        },
        "4": {
          "effect": "Strong body (VIG 18)",
          "duration": "A Season"
        },
        "5": {
          "effect": "Sharp senses (CLA 18)",
          "duration": "A year"
        },
        "6": {
          "effect": "Light heart (SPI 18)",
          "duration": "An Age"
        }
      },
      "locations": {
        "dwelling": "Trapper cabin",
        "sanctum": "Aromatic pines",
        "monument": "Worldview peak",
        "hazard": "Lack of air",
        "curse": "Blinding lights",
        "ruin": "Only shadows left"
      }
    },
    "The Tree": {
      "d6": 48,
      "d12": 96,
      "quote": "Not all that grows is good and fair\nNot all from 'bove an answered prayer",
      "omens": [
        "On the horizon, twisting branches of a great tree, black and blue.",
        "The branches on the horizon seem to grow with each moment, fading to grey, then white, as they reach into the clouds and spread above every part of the Realm.",
        "Branches scrape the clouds in every part of the Realm. With a scratching scream six cloud raiders fall from above, landing unharmed, looking to seize whatever they can carry back to the clouds.",
        "A militia warband march toward the Tree, aiming to chop it down. They do not know that earthly tools cannot harm the Tree.",
        "Great branches fall from the sky across the Realm. One falls nearby, a pair of cloud creatures clinging on before attacking in panic.",
        "With a thunderous creak the Tree begins to lean. A moment later it falls, followed by a rain of branches. The Myth Hex and all adjacent Hexes are devastated, causing 2d12 Damage to all within."
      ],
      "cast": [
        {
          "name": "Raiders from the Clouds",
          "stats": "VIG 14, CLA 8, SPI 8, 5GD",
          "armor": "A1 (hazy form)",
          "attacks": "hooked trident (d10)",
          "description": "Want to take earthy goods back to the clouds, valuing anything that grows in soil."
        },
        {
          "name": "Felling Militia, led by Melca",
          "stats": "VIG 11, CLA 8, SPI 8, 3GD",
          "attacks": "Felling axes (d8 long), poor motivation",
          "description": "Melca has A2 (helm, mail), theatrical voice"
        },
        {
          "name": "Cloud Creature",
          "stats": "VIG 12, CLA 8, SPI 4, 3GD",
          "armor": "A1 (formed of cloud, see cloud form table)",
          "attacks": "Slam (d8), lightning (d12, once per Phase)",
          "description": "Just wants to get back to the clouds."
        }
      ],
      "cloud_form_table": {
        "1": {
          "shape": "Snakelike",
          "descriptor": "Thin (VIG 6)"
        },
        "2": {
          "shape": "Wolflike",
          "descriptor": "Swift (can fly)"
        },
        "3": {
          "shape": "Bearlike",
          "descriptor": "Icy (A2)"
        },
        "4": {
          "shape": "Goatlike",
          "descriptor": "Dense (VIG 16)"
        },
        "5": {
          "shape": "Squidlike",
          "descriptor": "Unstable (collapses into water if Wounded)"
        },
        "6": {
          "shape": "Apelike",
          "descriptor": "Crackling (can use lightning twice)"
        }
      },
      "locations": {
        "dwelling": "Tiny market",
        "sanctum": "Golden grove",
        "monument": "Constellation dome",
        "hazard": "Exhausting spores",
        "curse": "Nightmare fungus",
        "ruin": "Smashed jail"
      }
    },
    "The Pool": {
      "d6": 49,
      "d12": 98,
      "quote": "Idle fiends steep murksome brew\nA heart's desire turned false or true",
      "omens": [
        "A joyous farmer skips and sings, leading an ox made entirely of gold. She claims she wished for the ox after drinking from the Pool. Hasn't got much of a plan for what to do with the ox.",
        "An elderly man, crying out for help. Claims that a curse has left him old, previously a healthy young hunter.",
        "Beneath a shady canopy, light peeks through, directing attention to the Pool, surrounded by round stones.",
        "Two bodies lie on a large bloodstain, seemingly having stabbed each other. A dried-up pool sits between them.",
        "The Pool presents itself again, this time atop a hill, among jagged rocks.",
        "A babbling sound echoes on the air. The mossy earth yawns and a great stone cauldron rises up. Here the Pool provides enough water for the Company to drink as much as they like, though each receive just one effect. This remains here until the end of the Season."
      ],
      "cast": [
        {
          "name": "The Pool",
          "description": "When somebody drinks its cloudy water they make a SPI Save. If they pass they receive a blessing, if they fail they receive a curse. The only cure is the blood of a great whale. The Pool then dries up."
        },
        {
          "name": "Joyous Farmer, Dolm, with Golden Ox",
          "stats": "VIG 10, CLA 6, SPI 13, 3GD",
          "description": "Rash and impulsive. Seeking another pool."
        },
        {
          "name": "Elderly Wretch, Alastig",
          "stats": "VIG 8, CLA 8, SPI 7, 2GD",
          "attacks": "Bow (d6), leaf-lined clothes",
          "description": "Appears elderly, claims to be young."
        }
      ],
      "pool_effects_table": {
        "blessing": {
          "1": "Invisible in moonlight",
          "2": "Never age past Mature",
          "3": "Immunity to fire",
          "4": "Fire breath (d8 blast)",
          "5": "Wish for one object",
          "6": "An icesword (3d6 hefty) rises from the water for you"
        },
        "curse": {
          "1": "Blind in moonlight",
          "2": "Become Old",
          "3": "Memory wiped",
          "4": "A limb withers away",
          "5": "All possessions lost",
          "6": "Attack nearest ally, stopping only when Mortally Wounded"
        }
      },
      "locations": {
        "dwelling": "Peaceful disciples",
        "sanctum": "Lush island",
        "monument": "Roots of the world",
        "hazard": "Biting muck",
        "curse": "Labyrinth stream",
        "ruin": "Massacre moor"
      }
    },
    "The Elephant": {
      "d6": 50,
      "d12": 100,
      "quote": "Booming march and children's cheer\nA hunter ushers death a'near",
      "omens": [
        "With thunderous steps, the Elephant Knight parades past with armoured soldiers. She marches toward the Seat of Power to receive a hero's welcome.",
        "Excited children bicker over which of the Elephant Knight's deeds were the greatest.",
        "A cruel hunter watches from the shadows, quietly alerting the Company and asking if they have seen the Elephant. He is hunting it for sport.",
        "The Elephant lies dead, the Elephant Knight screaming in anger, running into the distance. The hunter lurks, waiting for a safe moment to claim his trophy.",
        "In a muddy pit, the Elephant Knight slathers herself in wet clay, shouting to the sky in a language you cannot speak. She fights off any attempt to stop her, leaving when completely caked in clay.",
        "A monstrous clay elephant smashes at trees, trumpets at the sky. Heavy rain begins to fall, washing the creature away into the damp earth."
      ],
      "cast": [
        {
          "name": "The Elephant, Balihanthor",
          "stats": "VIG 18, CLA 5, SPI 5, 6GD",
          "armor": "A3 (tough hide, mail)",
          "attacks": "Gore (d10) and trample (2d10)",
          "description": "Only feels safe with the Elephant Knight."
        },
        {
          "name": "The Elephant Knight, Castine",
          "stats": "VIG 16, CLA 9, SPI 13, 8GD",
          "armor": "A2 (blue-embroidered gambeson, helm)",
          "attacks": "Hooked greatsword (2d10 slow)",
          "description": "Travel-weary. Wants to retire in comfort."
        },
        {
          "name": "Cruel Hunter, Berach",
          "stats": "VIG 14, CLA 16, SPI 6, 6GD",
          "attacks": "Crossbow (2d8 slow), shadowy cloak, countless pots of animal bait and repellent",
          "description": "Can Smite when shooting prey."
        }
      ],
      "deeds_of_elephant_knight_table": {
        "1": {
          "action": "Defeated the",
          "target": "Iron Crocodile"
        },
        "2": {
          "action": "Restored the",
          "target": "Invisible Wolf"
        },
        "3": {
          "action": "Mastered the",
          "target": "Faerie King"
        },
        "4": {
          "action": "Exposed the",
          "target": "Blood Heron"
        },
        "5": {
          "action": "Sated the",
          "target": "Labyrinth Beast"
        },
        "6": {
          "action": "Beheaded the",
          "target": "Mirror Ghost"
        }
      },
      "locations": {
        "dwelling": "Master hunter hut",
        "sanctum": "Youthful forest",
        "monument": "Sky spire",
        "hazard": "Bloodsucking insects",
        "curse": "Mossy air",
        "ruin": "Desolate inn"
      }
    },
    "The Snail": {
      "d6": 51,
      "d12": 102,
      "quote": "On grimely stone a truth be told\nThe sluggen path in slime enscrolled",
      "omens": [
        "Over crooked rocks, a trail of slime has left runic inscriptions in the stone. Nobody recognises the language, but everybody can understand it. It promises \"the truth in time\".",
        "A narrow, slime-covered passage leads down into the darkness. On the walls within, runes glowing, promising \"passage to wherever you wish\". The tunnel leads to the desired location with just a Phase of travel, then closes, and five helix beasts launch an ambush.",
        "A huge empty snail shell, like a great cave. Entering shows a taunting vision of the future.",
        "A spiral of runes marked on a white cliff, advising \"avoid the short cuts\".",
        "A thick slime covers the whole Realm. Animals refuse to travel across it.",
        "The Snail approaches. He asks what the Company have learned from his lessons. Takes any answer as proof of his methods and philosophy before gliding toward another Realm, his slime fading away."
      ],
      "cast": [
        {
          "name": "The Snail, Tutor of Time, Glossly",
          "stats": "VIG 10, CLA 5, SPI 5, 1GD",
          "armor": "A2 (or A4 when retracted into shell)",
          "attacks": "Slow sword (2d6 slow)",
          "description": "Feels responsible for maintaining the structure of time across all reality, but doesn't know how to do that. Covers this with smug overconfidence."
        },
        {
          "name": "Helix Beast",
          "stats": "VIG 7, CLA 7, SPI 2, 3GD",
          "attacks": "Acidic bite (d8)",
          "description": "Looks like a mass of coiled worms in the shape of a hound. Collapses into dead worms when Wounded."
        }
      ],
      "locations": {
        "dwelling": "Musical hermit",
        "sanctum": "Caves of creation",
        "monument": "Guardian willow",
        "hazard": "Parasitic worms",
        "curse": "Dead-end tunnels",
        "ruin": "Great fallen tree"
      }
    },
    "The Cave": {
      "d6": 52,
      "d12": 104,
      "quote": "A weary soul discerns no truth or lie\nAn eager heart asks neither what or why",
      "omens": [
        "A wide cave mouth looms from a vine-cloaked cliff. It seems empty, but echoes sound slightly altered.",
        "Three iron pilgrims attempt to seal the cave, claiming it can only cause harm.",
        "The Cave, a familiar shape and echo. This time a glow emanates from within, revealing 3 useful crystals.",
        "The Cave appears again, on a new cliff face, the word \"gold\" echos from within. Anybody entering awakens the beast of solid darkness, which only fights to prevent entry to the Cave. Beyond the beast lies a heavy coffer of gold.",
        "The Cave appears on a great boulder, now with eye-like holes and tooth-like stalactites. It slowly speaks, granting one question to each Knight present. It knows all and answers to the best of its ability.",
        "A towering figure strides out of a shadow, like folds of material darkness. He is the Debt Collector, here to take payment for the Cave. He accepts anything of value, and tries to kill those who won't pay."
      ],
      "cast": [
        {
          "name": "Beast of Solid Darkness",
          "stats": "VIG 12, CLA 12, SPI 7, 8GD",
          "armor": "A3 (darkness hardened to iron)",
          "attacks": "Blade out of darkness (3d10) or burst of un-light (d8 blast)",
          "description": "Guards the cave entrance and its treasures."
        },
        {
          "name": "Iron Pilgrims, Lymon, Sid, Hayma",
          "stats": "VIG 12, CLA 10, SPI 13, 3GD",
          "equipment": "Robes and chains, blacksmith tools",
          "description": "Seek to seal dangerous caves and supernatural threats."
        },
        {
          "name": "Debt Collector, Ambralleon",
          "stats": "VIG 16, CLA 16, SPI 7, 8GD",
          "armor": "A2 (shadow form, cold plates)",
          "attacks": "Black spear (2d8 hefty, can be thrown and called back into his hand). Can Smite.",
          "description": "Collects payment for use of the Cave's power."
        }
      ],
      "useful_crystals_table": {
        "1": {
          "appearance": "Flickering grey",
          "power_when_broken": "d10 blast of lightning"
        },
        "2": {
          "appearance": "Milky white",
          "power_when_broken": "Releases horrifying but harmless ghosts"
        },
        "3": {
          "appearance": "Dull ochre",
          "power_when_broken": "Winter arrives immediately"
        },
        "4": {
          "appearance": "Pale mauve",
          "power_when_broken": "Open up a flaming pit (d10) in the ground"
        },
        "5": {
          "appearance": "Swirling turquoise",
          "power_when_broken": "Vision of a useful truth"
        },
        "6": {
          "appearance": "Pulsing crimson",
          "power_when_broken": "Plants grow rapidly"
        }
      },
      "locations": {
        "dwelling": "Guardian hearth",
        "sanctum": "Ember cavern",
        "monument": "Diamond aurora",
        "hazard": "Acidic fog",
        "curse": "Vortex of smoke",
        "ruin": "Crumbled obelisk"
      }
    },
    "The Apparatus": {
      "d6": 53,
      "d12": 106,
      "quote": "When all the seeds are tallied, and every leaf scribed down\nThe age of Seers shall tumble, bereft their wicked crown",
      "omens": [
        "Mother and daughter trappers, searching for ducks. They have noticed a strange order to the Realm recently.",
        "A learned numerator and his young scribe note down observations of nature. He claims that the time of order may be here, where the future can be seen in calculations, not the whims of Seers.",
        "A great bridge spanning a ravine. The Brawler Knight sits on a ledge. States that she'd normally fight those passing over, but doesn't see the point anymore.",
        "The numerator's scribe rides, blowing a trumpet. They're declaring that the Apparatus is complete, and the numerator can calculate the future perfectly. The age of Seers is over!",
        "A warband of Knights, loyal to the Seers, rides toward the Apparatus to destroy it, demanding the Company join them.",
        "The numerator rides on an old steed, pleading for the Company's protection. If left unchecked, the Seer-loyal Knights ride ahead and break the Apparatus."
      ],
      "cast": [
        {
          "name": "The Apparatus, Oracular Device",
          "description": "Copper springs and cogs. Predicts the future perfectly, but takes a long time to do so."
        },
        {
          "name": "Learned Numerator, Alfger",
          "stats": "VIG 10, CLA 17, SPI 14, 2GD",
          "equipment": "Sack of scrolls, busy mind",
          "description": "Believes mathematics can replace Seers' prophecies."
        },
        {
          "name": "Cynical Brawler Knight, Charcabol",
          "stats": "VIG 15, CLA 6, SPI 6, 7GD",
          "armor": "A2 (layered mail, bucket helm)",
          "attacks": "Heavy gauntlets (d8 each)",
          "description": "Feels all is futile. Can't explain it."
        },
        {
          "name": "Seer-Loyal Knights",
          "stats": "VIG 12, CLA 12, SPI 12, 7GD",
          "armor": "A3 (mail, full helm, kite shield)",
          "attacks": "Axe (d8 hefty), kite shield (d4)",
          "description": "Loyal to the Seers, seeking to destroy the Apparatus."
        }
      ],
      "strange_order_table": {
        "the_land": {
          "1": "Crops grow in squares",
          "2": "Cube boulders",
          "3": "Worms forming signs",
          "4": "Rivers straightening",
          "5": "Symmetrical trees",
          "6": "Pulse from below"
        },
        "the_sky": {
          "1": "Stars fully aligned",
          "2": "Spiral clouds",
          "3": "Orderly rain",
          "4": "No wind",
          "5": "Wasps in formation",
          "6": "Birds forming lines"
        }
      },
      "locations": {
        "dwelling": "Dreamweaver's cocoon",
        "sanctum": "Prismatic falls",
        "monument": "Echo of song",
        "hazard": "Biting serpents",
        "curse": "Hopeless mirage",
        "ruin": "Tomb of the oathbreaker"
      }
    },
    "The Rock": {
      "d6": 54,
      "d12": 108,
      "quote": "Amid the waves a stony throne\nWhere ancient warlords sleep alone",
      "omens": [
        "A breeze with the scent of steel and blood.",
        "A dancing farmer is herding her geese and dragging a skeletal corpse wrapped in cloth. She gladly explains that she's taking her grandfather to the Rock, the only resting place for such a warrior.",
        "A Knight of white stone stands guarding a withered tree, just a few pieces of fruit on its branches. He explains that this fruit is being kept for warriors returning from the Rock. Punishments for eating the fruit can be lifted by a Seer.",
        "A band of nine pilgrims seek the Rock. They offer protective talismans to Knights. These will ensure that warriors returning from the Rock do not mistake the Knights for enemies of the Realm.",
        "An invigorating storm. With each flash of lightning the sound of battle can be heard.",
        "Mist rolls back from a lake, revealing a rocky island within, a rowboat on the shore. Three bellowing warbands of warriors, waiting in death, ready to serve the Realm in battle one last time."
      ],
      "cast": [
        {
          "name": "Alabaster Knight, Denebawde",
          "stats": "VIG 15, CLA 8, SPI 8, 4GD",
          "armor": "A4 (body of white stone)",
          "attacks": "Black stone greatsword (3d10 slow)",
          "description": "Wears a white python that whispers shrewd guidance, but cannot bite or cause harm."
        },
        {
          "name": "Rock Pilgrims, led by Marik",
          "stats": "VIG 10, CLA 10, SPI 13, 2GD",
          "equipment": "Red cloaks, sacks of weapons intended as offerings to the warriors of the Rock",
          "description": "Pilgrims seeking the Rock to honor ancient warriors."
        },
        {
          "name": "Warriors of the Rock, led by Olthiar",
          "stats": "VIG 16, CLA 10, SPI 16, 8GD",
          "armor": "A2 (ancient mail, helm)",
          "attacks": "Sword of extinct metal (2d8 long)",
          "description": "Want to fight in a worthy battle. Can Smite."
        }
      ],
      "sacred_fruit_table": {
        "1": {
          "type": "Silver berries",
          "punishment": "Turn to stone"
        },
        "2": {
          "type": "Bright oranges",
          "punishment": "Voice silenced"
        },
        "3": {
          "type": "Translucent grapes",
          "punishment": "Loss of eyes"
        },
        "4": {
          "type": "Purple pears",
          "punishment": "A hand withers away"
        },
        "5": {
          "type": "Star figs",
          "punishment": "Ghoulish face"
        },
        "6": {
          "type": "Huge peaches",
          "punishment": "Become Exposed"
        }
      },
      "locations": {
        "dwelling": "Philosopher tower",
        "sanctum": "Soothing thunder",
        "monument": "Quiet flame",
        "hazard": "Magma field",
        "curse": "Drizzle veil",
        "ruin": "Defiled catacomb"
      }
    },
    "The Wraith": {
      "d6": 55,
      "d12": 110,
      "quote": "An unbirthed life, no first breath drawn\nIn dark of night, unlife til morn",
      "omens": [
        "A reedy song in the distance. A dark swan sings, advancing night or morning faster than normal. The swan flees if seen.",
        "Messengers carry word from all Seers. The Fallen Seer is to be killed on sight.",
        "In a dark patch of woods, a shadowy mass looms over a broken body. The shadow flees if seen. The corpse is a local Seer.",
        "A messenger from the nearest Seer calls for all Knights to report to guard them. The Wraith strikes on the next night.",
        "The Fallen Seer dances in the woods, cursing their brothers and sisters aloud. They spout false prophecies to Knights they meet. At nightfall the Wraith attacks the Fallen Seer.",
        "The nearest Seer has come to seek the Wraith alone, offering themselves as sacrifice. The Wraith materialises at night and attacks. When this is done there is a scream heard across the Realm and the Wraith returns to wherever they were summoned from."
      ],
      "cast": [
        {
          "name": "The Wraith, Night as Cold Flesh",
          "stats": "VIG 16, CLA 16, SPI 16, 11GD",
          "attacks": "Touch of unlife (d12, ignore armour, cannot be Denied)",
          "description": "Hunting Seers. Can only exist in darkness."
        },
        {
          "name": "The Fallen Seer, Ossoanamme",
          "stats": "VIG 12, CLA 4, SPI 16, 3GD",
          "armor": "A1 (wooden armour)",
          "attacks": "Blade (2d8 hefty), burned silks",
          "description": "No longer knows the past, present, or future. Awoke the Wraith but has no control of it."
        },
        {
          "name": "Dark Swan, Netherplume, Nirrow",
          "stats": "VIG 10, CLA 10, SPI 6, 3GD",
          "attacks": "Wing and beak (2d6)",
          "description": "His song can hurry day into night, or night into day, but only sings when feeling safe."
        }
      ],
      "locations": {
        "dwelling": "Sapling village",
        "sanctum": "Hallowed grove",
        "monument": "Crystal rose",
        "hazard": "Fierce winds",
        "curse": "Fading light",
        "ruin": "Sunken abbey"
      }
    },
    "The Beast": {
      "d6": 56,
      "d12": 112,
      "quote": "In cutting coil and snatching horn and crushing limb abound\nTameless creature sees no knight, no seer, no king a'found",
      "omens": [
        "A hulking furred shadow moves between thick trees. Its form changes as you catch it at new angles. It burrows into the ground if disturbed.",
        "A frightened rider points out two huge red eyes, watching on the horizon. Hot breath on your skin. The eyes close. Vanished.",
        "First a breath of wind, then a rumble, opening into a crackled roar. All animals in the Realm panic until the next sunrise.",
        "A clawed limb snatches at one of the Knights, emerging from the undergrowth, no body in sight. Each turn a new limb emerges to snatch at another Knight, up to six emerging in total. If the Knights flee the limbs retreat into earth.",
        "All Knights in the Realm that fail a SPI Save fly into rage, attacking all nearby. This ends if they are Wounded.",
        "With a howling bark the Beast bounds toward the nearest body of water. When it dives into the abyss a tidal wave covers all within two Hexes of the water, smashing buildings and flooding the land."
      ],
      "cast": [
        {
          "name": "The Beast, Nature Wild and Raw",
          "stats": "VIG 19, CLA 17, SPI 5, 14GD",
          "armor": "A3 (thick hide)",
          "attacks": "maul and tear (4d10)",
          "description": "Has no need for food or water, only fighting to display dominance."
        },
        {
          "name": "Clawed Limb of the Beast",
          "stats": "VIG 15, CLA 5, SPI 5, 6GD",
          "attacks": "Claw (d10, wounded targets are gripped and must pass a VIG Save to move away)",
          "description": "Individual limbs of the Beast that emerge independently."
        },
        {
          "name": "Frightened Rider, Fevych",
          "stats": "VIG 11, CLA 16, SPI 6, 6GD",
          "armor": "A2 (helm, shield)",
          "attacks": "Javelins (d6), axe (d6), shield (d4)",
          "description": "Abandoned her dream of becoming a Knight after seeing so many die. Now looking for a mercenary company to join."
        }
      ],
      "forms_of_beast_table": {
        "1": "Serpentine coils",
        "2": "Massive bear-like form",
        "3": "Horned bull shape",
        "4": "Wolf-like predator",
        "5": "Clawed ape creature",
        "6": "Shifting chimeric form"
      },
      "locations": {
        "dwelling": "Sage's den",
        "sanctum": "Raven roost",
        "monument": "Obsidian henge",
        "hazard": "Venomous fens",
        "curse": "Colourless woods",
        "ruin": "Haunted hamlet"
      }
    },
    "The Judge": {
      "d6": 57,
      "d12": 114,
      "quote": "In time she calls for all the knights\nUpon the best her blade still bites",
      "omens": [
        "A wretch pleads for charity. She was a Knight, sentenced harshly by the Judge.",
        "A courtyard in black and white, carved seats in a circle. Vague voices echo, arguing, then a loud clap followed by silence. This place is gone if returned to.",
        "Three Sergeants of Law deliver a scroll to the Knight called for judgement. The Knight will be retrieved when the time is right; a horn will be the warning.",
        "One of the Knights vanishes into mist, forced to give witness to the trial of a Knight that they know. After testifying they are returned in a swirl of mist.",
        "A clear horn is heard across the Realm.",
        "The Retriever of Justice comes bounding on the horizon, roughly dragging the summoned Knight to court, which has materialised nearby. The Judge awaits, able to summon witnesses for or against, judging whether the Knight has truly done their best to follow the Oath. At the next sunset or sunrise she gives her verdict."
      ],
      "cast": [
        {
          "name": "The Judge, Ambrageft, of Diamond Eye",
          "stats": "VIG 13, CLA 19, SPI 17, 10GD",
          "armor": "A3 (gambeson, white fur plate, tall helm)",
          "attacks": "Judgementsword (2d10 long, +d10 vs the guilty, striking causes a moment of silence)",
          "description": "Can Deny and sees all lies."
        },
        {
          "name": "Sergeants of Law, Lyo, Tonnel, Muntin",
          "stats": "VIG 12, CLA 14, SPI 14, 6GD",
          "armor": "A1 (checkerboard longcoats)",
          "attacks": "Polehooks (d10 long, +d10 vs fleeing targets)",
          "description": "Bitter, bound to service for their own crimes."
        },
        {
          "name": "Retriever of Justice, Lawhound, Azdart",
          "stats": "VIG 15, CLA 18, SPI 7, 7GD",
          "armor": "A1 (hardened body)",
          "attacks": "huge jaws (2d8)",
          "description": "Only obeys the Judge."
        }
      ],
      "judgement_table": {
        "1": "Guilty - stripped of knighthood and exiled",
        "2": "Guilty - must perform a quest of penance",
        "3": "Guilty - suffer a curse or punishment",
        "4": "Innocent - but warned to be more vigilant",
        "5": "Innocent - restored to full honor",
        "6": "Exemplary - granted a blessing or boon"
      },
      "locations": {
        "dwelling": "Minstrel's nook",
        "sanctum": "Starfilled valley",
        "monument": "Story stone",
        "hazard": "Razor crags",
        "curse": "Growing shadows",
        "ruin": "Lost fort"
      }
    },
    "The Crown": {
      "d6": 58,
      "d12": 116,
      "quote": "No crown brings peace\nThis one least",
      "omens": [
        "An old herald from the Seat of Power rides, blasting his horn. He spreads word that the Seat of Power condemns the false Crown, and promises a vague reward for the one who turns it in for destruction.",
        "The same herald blasts their horn, announcing the hunt for the Crown. He has no memory of his previous message.",
        "Five brutal mercenaries approach, roughly interrogating any Knights to see what they know about the Crown, reporting back to the Seat of Power.",
        "The herald is beset by tiger spiders, d6 attacking openly, a further d6 lurking nearby waiting to pounce.",
        "Twelve brutal mercenaries are enforcing a curfew on all Knights, ordering them to return to the nearest Holding until the mercenaries have found and destroyed the Crown.",
        "In a well-lit clearing the Crown sits on a mahogany plinth."
      ],
      "cast": [
        {
          "name": "The Crown, the Twelve-Wood Diadem",
          "description": "Seers see the wearer as a ruler, but Knights see them as a fraud. Cannot be removed by its wearer. Whispers to the wearer."
        },
        {
          "name": "Old Herald, Alnect",
          "stats": "VIG 6, CLA 7, SPI 13, 2GD",
          "attacks": "Mace (d8 hefty), fine garb, loud horn",
          "description": "Herald from the Seat of Power with memory issues."
        },
        {
          "name": "Brutal Mercenaries, Veyril's Vanguard",
          "stats": "VIG 12, CLA 10, SPI 10, 4GD",
          "armor": "A1 (redmail), Veyril is A2 (redmail, plate)",
          "attacks": "Poleaxe (d10 long), no empathy",
          "description": "Veyril has long red hair and lots of grudges."
        },
        {
          "name": "Tiger Spider, Horrortrix",
          "stats": "VIG 12, CLA 14, SPI 5, 3GD",
          "attacks": "Fangs (2d6), acidic spit (d8), harasses prey",
          "description": "Aggressive spider that hunts in groups."
        }
      ],
      "crown_whispers_table": {
        "1": "Commands to claim nearby holdings",
        "2": "Promises of great armies to command",
        "3": "Warnings about treacherous advisors",
        "4": "Demands for tribute from subjects",
        "5": "Paranoid suspicions about everyone",
        "6": "Grandiose plans for conquest"
      },
      "locations": {
        "dwelling": "Weaver's loft",
        "sanctum": "Cool meadow",
        "monument": "Looming arch",
        "hazard": "Crumbling ridge",
        "curse": "Misdirecting branches",
        "ruin": "Frayed bridge"
      }
    },
    "The City Quest": {
      "type": "city_quest",
      "quote": "For the oath, for the glory, through sorrow and ache\nThe City, that quest to which no Knight can make",
      "mechanics": {
        "glory_requirement": "Knights must have Glory of 12+ to be worthy of the City Quest",
        "trigger": "When Company would encounter Omen from random Myth by rolling 1 on Wilderness Roll AND Company has Glory 12+",
        "glory_insufficient": "With Glory < 12, encounter next Omen from a random Myth in this Realm instead",
        "omen_determination": "Roll d12 + number of previous City Quest omens encountered (minimum 0)",
        "duplicate_handling": "Take next omen down the list",
        "max_roll": 24,
        "quest_end_condition": "After encountering Omen 18 or higher"
      },
      "omen_count": 24,
      "omens": {
        "1": "A lost traveller in finely cut cloth, armed with a strange device. He's desperate to get back to the City, telling stories of a place of coloured lights and brick towers.",
        "2": "On the horizon, a jagged skyline of towers, domes, impossible bridges, dotted with warm light. It fades in the next Phase.",
        "3": "Four strange raiders stroll up, mocking the Knights as primitives. They attempt to rob anything of value the Knights have.",
        "4": "A broken trail appears to have a golden hue, gradually turning to slabs of sparkling stone, impossibly smooth. After a while the road fades back to nothing.",
        "5": "The City Knight, returning from the City. She advises you to turn back.",
        "6": "Three great shapes move in the sky, casting shadows over the land. Like huge, dark eggs, a growling hum. With a chorus of bangs they send an explosive barrage (2d10 blast) down onto the Company before drifting off to the horizon.",
        "7": "A rider in ugly red plate. She claims to be the Arch-Hellion of Jules, pressing a claim on the nearest Seat of Power. She is from the City, but smugly refuses to share any information about it.",
        "8": "A wide tunnel through a sheer cliff face, the other side visible. Partway through the tunnel, a rumble, a whistle, a blast of white smoke. Anyone who doesn't vacate the tunnel is struck by an immense force (3d10), which vanishes before it exits the other side of the tunnel.",
        "9": "Green-grey smoke washes over the land for the rest of the season. It burns slightly, but no serious effect.",
        "10": "A Warband of Knight-Catchers charge, aiming to preserve you for display in a museum that does not exist yet.",
        "11": "A metal wagon lies in ruin, various canisters and pipes lie broken within the wreckage, like nothing you've seen before. Amongst the wreckage, a metal chest contains a beautiful crystal bottle filled with fiery liquor, and a pouch of impossibly clear diamonds.",
        "12": "A woman in a black coat, with a broad hat. She's a science-mystic, trading wonders from the City in return for guidance to mystical places in the Realm.",
        "13": "A pottery-like stairway leading downward in a spiral. A green-tiled tunnel with soft light, soothing music. The exit leads to a distant point in the Realm.",
        "14": "A wooden case with six rifles (2d10 long) and a good amount of ammunition.",
        "15": "A sponge-like, metallic material has burst forth from the soil, slowly growing from beneath. Narrow tunnels lead into a chamber where ten silver ghouls sleep.",
        "16": "A towering, square mountain. The slightest touch reduces it to rubble, releasing the brick giant within.",
        "17": "Scattered plates and wires. A faint voice from a blinking light. You may ask the voice one question, which it will answer with certainty. It knows everything.",
        "18": "An open plain. You are utterly certain that this is where the City must be built.",
        "19": "A vast, empty, glittering castle. The City will grow from here with the right ruler.",
        "20": "The City. A hellish smoke-choked factory.",
        "21": "The City. All coloured lights, strange machines, and discordant music.",
        "22": "The stars look closer. You feel a force drawing you toward them, into the void.",
        "23": "A liquid light roars over you. Embrace the end or abandon your quest.",
        "24": "You see now. The City was a lie."
      },
      "cast": [
        {
          "name": "Lost Traveller, Hopkin",
          "stats": "VIG 8, CLA 13, SPI 11, 3GD",
          "attacks": "Carbine (2d10 long, a few bullets left)",
          "description": "Wants to get back to the electric city of Bastion, but has wandered too far."
        },
        {
          "name": "Strange Raiders, led by Hooper",
          "stats": "VIG 13, CLA 11, SPI 8, 6GD",
          "armor": "A2 (hardened leather, spiked plates)",
          "attacks": "Roaring-toothed blades (2d10), a few grenades (d8 blast)",
          "description": "Hooper has a flamethrower (2d6 blast). Want to feel powerful and get rich."
        },
        {
          "name": "The City Knight, Abril",
          "stats": "VIG 14, CLA 17, SPI 16, 13GD",
          "armor": "A3 (shining chain, helm, kite shield)",
          "attacks": "Etched longsword (2d8 hefty), shield (d4)",
          "description": "Has seen the City, and was immensely disappointed. Doesn't want to talk about it, but warns others away."
        },
        {
          "name": "Arch-Hellion of Jules, Quith",
          "stats": "VIG 10, CLA 13, SPI 13, 7GD",
          "armor": "A3 (armoured cloth, red plate, ornate helm)",
          "attacks": "Lightning rod (3d8, can release its shocking power a short distance), sacks of gold",
          "description": "Wants to gather an army to press their claim on the nearest Seat of Power. Hates the City that rejected her, but gets joy from withholding information about it."
        },
        {
          "name": "Knight-Catchers",
          "stats": "VIG 12, CLA 12, SPI 10, 7GD",
          "armor": "A2 (cloth-armour, round helms)",
          "attacks": "Tremor-guns (2d8, long, ignore armour, causes non-lethal Damage), formaldehyde",
          "description": "Want to collect artifacts from this world, ensuring they are undamaged."
        },
        {
          "name": "Science-Mystic, Lyonelle",
          "stats": "VIG 6, CLA 16, SPI 11, 4GD",
          "attacks": "Ceramic staff (2d6 long), case of technological wonders containing alchemical lamps (impossibly bright), flasks of acid (d8 Damage each round until washed, ignoring armour), magnets, springs, and glue",
          "description": "Trades wonders from the City for guidance to mystical places."
        },
        {
          "name": "Silver Ghoul",
          "stats": "VIG 7, CLA 7, SPI 6, 6GD",
          "armor": "A2 (metallic body)",
          "attacks": "Claws and teeth (2d6), bone-melting scream (d12 slow, ignore armour, once per day each)",
          "description": "Wants to be left alone in their cave."
        },
        {
          "name": "Brick Giant",
          "stats": "VIG 18, CLA 7, SPI 2, 4GD",
          "armor": "A3 (brickwork), count as a structure",
          "attacks": "Crush (3d12 slow) or sweep (2d12 slow blast)",
          "description": "Voice like a cement mixer. Only knows words that a building would know. Wants to destroy all other structures."
        }
      ],
      "quest_phases": {
        "discovery": "Omens 1-6: Initial encounters and hints about the City",
        "investigation": "Omens 7-12: Deeper exploration and mysterious technologies",
        "revelation": "Omens 13-17: Understanding the truth about the City",
        "conclusion": "Omens 18-24: Multiple possible endings and resolutions"
      }
    },
    "The Colossus": {
      "d6": 63,
      "d12": 125,
      "quote": "A legacy hewn in living rock\nA life that should not be",
      "omens": [
        "An elderly sculpter toils away, carving a great statue into a cliff face. He boasts that the statue is based on him in his youthful prime. He knows he is dying and longs for immortality.",
        "Across the Realm the earth shakes and rumbles as the Colossus awakes.",
        "A crushed stone house, petty belongings scattered across the nearby field. Looks as if it was bombarded with stones.",
        "The Hammer Knight rides, declaring they are seeking the Colossus, who has been terrorising the area.",
        "Two warbands of a mercenary company fight the Colossus, gradually realising they're unable to harm its stone body.",
        "In the distance, the Colossus is leaning against a mountainside. With a groan they collapse into a heap, their form merging with that of the mountain. After a few moments the new rock is covered in red and green moss."
      ],
      "cast": [
        {
          "name": "The Colossus, Woken from the Rock",
          "stats": "VIG 19, CLA 3, SPI 2, 6GD",
          "armor": "A4, count as a structure (colossal stone body)",
          "attacks": "Crush (2d12) or sweep (d12 blast)",
          "description": "Driven by strange behaviour (see below)."
        },
        {
          "name": "The Hammer Knight, Lansheigh",
          "stats": "VIG 14, CLA 5, SPI 6, 7GD",
          "armor": "A3 (helm, gambeson, spiked plate)",
          "attacks": "Maul (2d10 slow), siege bombs (d8 blast)",
          "description": "Sworn to never ask or answer a question."
        },
        {
          "name": "Besieger Mercenary Company Member",
          "stats": "VIG 13, CLA 7, SPI 7, 5GD",
          "armor": "A3 (siegehelm, blackened mail, towershield)",
          "attacks": "Blade (2d6 hefty), towershield (d4)",
          "description": ""
        }
      ],
      "strange_behaviour_table": {
        "loves_hates": {
          "1": {"loves": "Fire", "hates": "Darkness"},
          "2": {"loves": "Water", "hates": "Rain"},
          "3": {"loves": "Beasts", "hates": "Birds"},
          "4": {"loves": "Flowers", "hates": "Trees"},
          "5": {"loves": "Weapons", "hates": "Armour"},
          "6": {"loves": "One of the Knights", "hates": "One of the Knights"}
        }
      },
      "locations": {
        "dwelling": "Scribe's shelter",
        "sanctum": "Haven of roots",
        "monument": "Carved monolith",
        "hazard": "Needle grass",
        "curse": "Tablet of falsehoods",
        "ruin": "Faded library"
      }
    },
    "The Fortress": {
      "d6": 64,
      "d12": 127,
      "quote": "A cage in stone, all thorned and vast\nDisguise a scheme in shadows cast",
      "omens": [
        "The Thorn Seer roams the Realm, proclaiming an invasion of great scuttling monsters is coming soon.",
        "A messenger declares that the Thorn Seer has reclaimed a lost fortress (in the Myth Hex), creating an impenetrable sanctuary for when the invasion comes.",
        "Three claw swarm cutters peer from their tunnels, scouts for the invasion. If seen they scutter back underground.",
        "A smith and her three young apprentices are looking for a new home. They left the Fortress, as the Thorn Seer wanted the impossible from them, demanding whole walls of iron be built.",
        "The voice of the Thorn Seer is heard across the land. The invasion is here, numberless hordes of the claw swarm attacking the Fortress. They will not actually breach the Fortress, as they are creations of the Thorn Seer.",
        "The invasion defeated, the Thorn Seer demands to be made ruler of the Realm, the Fortress as his Seat of Power."
      ],
      "cast": [
        {
          "name": "The Thorn Seer",
          "stats": "VIG 9, CLA 16, SPI 14, 3GD",
          "armor": "A2 (thorny body, helm)",
          "attacks": "Spined mace (d8 hefty), dagger (d6)",
          "description": "Sees pain in the past and the future."
        },
        {
          "name": "Claw Swarm Cutter",
          "stats": "VIG 9, CLA 9, SPI 3, 3GD",
          "armor": "A1 (green carapace)",
          "attacks": "Claws (2d6), acid spit (d8)",
          "description": "Cunning instinct (see below)."
        },
        {
          "name": "Claw Swarm Hulk",
          "stats": "VIG 15, CLA 5, SPI 5, 6GD",
          "armor": "A2 (red carapace)",
          "attacks": "Great claws (2d8), blunt instinct",
          "description": ""
        }
      ],
      "locations": {
        "dwelling": "Exile pottery",
        "sanctum": "Timeless cavern",
        "monument": "Lyre tree",
        "hazard": "Numb ache on the air",
        "curse": "The Silence",
        "ruin": "Scoured trail"
      }
    },
    "The Citadel": {
      "d6": 65,
      "d12": 129,
      "quote": "A watcher yond our earthly sight\nBeyond the reach of falcon's flight",
      "omens": [
        "The silhouette of the Citadel appears on the horizon, teetering and crooked. Any Seers you meet warn you not to go there.",
        "The nearest Seer skulks between the trees, seeking a new Sanctum so that the Watcher will not find them.",
        "Iron hounds, forged in the Citadel, scour the land, terrorising but not harming Seers. A pack of four charge past the Company, heading to the nearest Seer.",
        "The Watcher from the Citadel is seeking out every Seer, warning them not to interfere with the destiny of the Realm.",
        "A glowing orb falls from the sky, landing with an explosion in the nearby woods. Screams follow from the crash site, and an Immolated Seer bursts from the woods. In their death throes they attack any nearby, losing d6 VIG each round.",
        "The Citadel glows, flooding the Realm with intense white light. Seers scream. When the light fades the Citadel is gone."
      ],
      "cast": [
        {
          "name": "The Watcher in the Citadel, Setizi",
          "stats": "VIG 12, CLA 17, SPI 15, 8GD",
          "armor": "A1 (silver mail). Can Focus.",
          "attacks": "Glassy longsword (2d8 hefty), crystal lantern (peering into it gives a hazy view of a location within the Realm that you have visited. Light causes pain to Seers)",
          "description": "Protecting a destined future (see below)."
        },
        {
          "name": "Immolated Seer",
          "stats": "VIG 10, CLA 7, SPI 7, 6GD",
          "armor": "",
          "attacks": "Bursts of anguished flames (d8 blast)",
          "description": ""
        },
        {
          "name": "Iron Hound",
          "stats": "VIG 10, CLA 12, SPI 2, 2GD",
          "armor": "A3 (metallic body)",
          "attacks": "Forged jaws (d8), focused on their quarry",
          "description": ""
        }
      ],
      "locations": {
        "dwelling": "Harpist gathering",
        "sanctum": "Lullaby stream",
        "monument": "Marble mesa",
        "hazard": "Draining dunes",
        "curse": "Gorge of sorrow",
        "ruin": "Broken tools"
      }
    }
  }
}