{
  "plotTitle": "Shadows of Kharos: The Drowned King's Return",
  "mainObjective": "Investigate the disappearances and supernatural unrest plaguing the Isle of Kharos, break the curse corrupting the lighthouse, and confront the Drowned King before his ancient power reclaims the living.",
  "plotPoints": [
    {
      "id": "PP001",
      "title": "Mists and Whispers in Marrow’s Rest",
      "description": "The party arrives at Marrow’s Rest Village (MRV001), shrouded in dense mist and fear. Villagers have been vanishing, and Elder Dorun pleads for help, hinting at old superstitions and darkness creeping from the marsh. The investigation reveals tensions, rumors of a secret cult, and the first hints that the evil extends beyond the village. Clues point toward the old abbey and the lighthouse on the cliffs. This sets the stage for the adventure and introduces major NPCs.",
      "location": "MRV001",
      "nextPoints": [
        "PP002"
      ],
      "status": "not started",
      "plotImpact": "Introduces the village’s supernatural threat, major NPCs, and the pattern of disappearances. Provides first leads toward the Abbey Ruins & Lighthouse.",
      "sideQuests": [
        {
          "id": "SQ001",
          "title": "The Spirit’s Request",
          "description": "A restless spirit (Echo of a lost villager) seeks closure. If the party listens to its whispers in the graveyard, it can reveal a hidden clue about the disappearances and the cult’s activities.",
          "involvedLocations": [
            "MRV001"
          ],
          "status": "not started",
          "plotImpact": "Provides an optional lead about Brother Lintar and the cult’s hideout."
        },
        {
          "id": "SQ002",
          "title": "Fisherman’s Fear",
          "description": "Finn Caster, the fisherman, refuses to go out on the water. Convincing him or helping him perform a calming ritual can earn the party local trust and a token for safe travel in the marsh.",
          "involvedLocations": [
            "MRV001"
          ],
          "status": "not started",
          "plotImpact": "Improves villagers’ trust and may provide a minor magical boon."
        }
      ]
    },
    {
      "id": "PP002",
      "title": "Beneath the Lantern Light",
      "description": "As night falls on Marrow’s Rest (MRV001), the party follows suspicious activity—cultists meeting in shadowed lanes and ritual symbols appearing. Brother Lintar is seen slipping toward the old abbey. Panic spreads as another villager goes missing. The party must confront the cult’s operations and uncover their ambitions, which point toward the Abbey Ruins & Lighthouse (ARL001) as the center of the disturbance.",
      "location": "MRV001",
      "nextPoints": [
        "PP003"
      ],
      "status": "not started",
      "plotImpact": "Escalates tension, reveals the cult as central to the disappearances, and links the unrest in the village to the corrupted abbey and lighthouse.",
      "sideQuests": [
        {
          "id": "SQ003",
          "title": "Rescue the Taken",
          "description": "A villager is snatched by cultists. If the party acts quickly, they can intercept the kidnappers, rescuing the villager and capturing a cultist for questioning.",
          "involvedLocations": [
            "MRV001"
          ],
          "status": "not started",
          "plotImpact": "Provides direct intelligence on the cult’s plans and the abbey ruins."
        },
        {
          "id": "SQ004",
          "title": "The Shipwreck Survivor’s Tale",
          "description": "Captain Merek, haunted by his own near-death, will share what he saw in the mist if the players help him recover his lost keepsake from the marsh’s edge.",
          "involvedLocations": [
            "MRV001"
          ],
          "status": "not started",
          "plotImpact": "Reveals lore about spectral figures and a path to the Abbey Ruins."
        }
      ]
    },
    {
      "id": "PP003",
      "title": "The Abbey’s Shadow",
      "description": "Clues from the village lead the party up the overgrown path to the Abbey Ruins & Lighthouse (ARL001). Here, they discover evidence of old rites, Sister Hela’s vigil, and the cult’s attempts to summon a force from beneath. The mist thickens, and ghostly echoes warn of the Drowned King’s approach. Connections between the cult, the abbey’s fall, and the lighthouse’s corruption become clear, pushing the party to investigate the source of the supernatural unrest.",
      "location": "ARL001",
      "nextPoints": [
        "PP004"
      ],
      "status": "not started",
      "plotImpact": "Links the village’s plight directly to the Abbey Ruins & Lighthouse. Unveils Sister Hela’s knowledge and the true scale of the threat.",
      "sideQuests": [
        {
          "id": "SQ005",
          "title": "Bone Wind-Clatter Blessings",
          "description": "Sister Hela offers to strengthen the party’s defenses against the restless dead if they gather sacred bones and herbs from the village and marsh.",
          "involvedLocations": [
            "MRV001",
            "ARL001"
          ],
          "status": "not started",
          "plotImpact": "Improves the party’s chances against undead and may grant protection from the Drowned King’s influence."
        },
        {
          "id": "SQ006",
          "title": "The Lantern Keeper’s Secret",
          "description": "An old lantern keeper hints at a hidden passage beneath the Abbey. Persuasion or stealth reveals a safer route, bypassing some cult traps and undead guardians.",
          "involvedLocations": [
            "ARL001"
          ],
          "status": "not started",
          "plotImpact": "Grants tactical advantage for the final confrontation in the Abbey Ruins."
        }
      ]
    },
    {
      "id": "PP004",
      "title": "Arrival at the Abbey Ruins",
      "description": "The party enters the storm-lashed Abbey Ruins & Lighthouse (ARL001), drawn by the corrupted beacon. The ancient doors groan open, revealing abandoned halls and shadowy figures. Here, the party explores the entry halls and prayer chambers, piecing together the abbey’s fall and encountering Mira Tidewise, the secretive lighthouse keeper. As the party delves deeper, they realize the supernatural threat is growing and that the lighthouse beacon is a crucial part of the curse threatening the entire isle.",
      "location": "ARL001",
      "nextPoints": [
        "PP005"
      ],
      "status": "not started",
      "plotImpact": "Establishes the eerie, otherworldly mood; uncovers initial clues about the abbey, its keepers, and the corruption infecting the lighthouse.",
      "sideQuests": [
        {
          "id": "SQ007",
          "title": "The Guardian’s Plea",
          "description": "A spectral figure—Eliad, a drowned herald—appears, pleading for the party to lay restless spirits to rest. Only by calming these shades can the way to the lighthouse be safely navigated.",
          "involvedLocations": [
            "ARL001"
          ],
          "status": "not started",
          "plotImpact": "Completing this side quest will grant the party sanctuary from the most dangerous hauntings in later sections."
        },
        {
          "id": "SQ008",
          "title": "Shards of the Past",
          "description": "Exploring the abbey narthex, the party can recover fragments of a shattered stained-glass window depicting the abbess and her flock. Assembling them unlocks a vision of the abbey’s last night and a cryptic warning.",
          "involvedLocations": [
            "ARL001"
          ],
          "status": "not started",
          "plotImpact": "Provides insight into Abbess Miralda’s fate and reveals a hidden passage."
        }
      ]
    },
    {
      "id": "PP005",
      "title": "The Tower’s Shadow",
      "description": "Venturing deeper into the Abbey Ruins & Lighthouse (ARL001), the party navigates moss-choked corridors and perilous spiral stairs. The unnatural light pulses above, warping reality and calling forth horrors—drowned dead, cultists, and echoes of the abbey’s fall. Mira Tidewise, if confronted, reveals she has been keeping dark secrets about the Drowned King and the true source of the beacon’s corruption, and hints that something even deeper lies beneath the abbey.",
      "location": "ARL001",
      "nextPoints": [
        "PP006"
      ],
      "status": "not started",
      "plotImpact": "The party learns the corrupting force is bound beneath the lighthouse and that the beacon must be dealt with—risking either the Drowned King’s release or continued corruption.",
      "sideQuests": [
        {
          "id": "SQ009",
          "title": "The Keeper’s Bargain",
          "description": "Mira Tidewise offers a bargain: help her banish the Drowned King’s influence in exchange for the abbey’s lost relics. Alternatively, expose her lies and face her wrath (with or without her secrets).",
          "involvedLocations": [
            "ARL001"
          ],
          "status": "not started",
          "plotImpact": "If Mira is convinced or defeated, her knowledge or the relics can greatly aid in the final confrontation."
        }
      ]
    },
    {
      "id": "PP006",
      "title": "The Bell, the Light, and the King Below",
      "description": "Atop the lighthouse in the Abbey Ruins (ARL001), the party confronts the source of the supernatural beacon: the bound spirit of Abbess Miralda, tormented by the Drowned King’s will. The party faces a crucial decision: attempt to free the abbess, destroy the beacon, or bargain with the Drowned King’s power. Their choices here will shape the fate of the abbey and the entire isle, and may uncover a path leading into the Drowned Catacombs (DC001) beneath the lighthouse.",
      "location": "ARL001",
      "nextPoints": [
        "PP007"
      ],
      "status": "not started",
      "plotImpact": "The climax of the Abbey Ruins arc offers meaningful choices: defeat or redeem Miralda, shatter or sanctify the beacon, and determine the Drowned King’s hold over the region. Unlocks the entrance to the Drowned Catacombs.",
      "sideQuests": [
        {
          "id": "SQ010",
          "title": "Sin-Eater’s Rite",
          "description": "A hidden ritual chamber contains the tools to purify the abbess’s spirit. The party can attempt the dangerous Sin-Eater’s Rite to redeem Miralda, but failure provokes her wrath and strengthens the Drowned King.",
          "involvedLocations": [
            "ARL001"
          ],
          "status": "not started",
          "plotImpact": "Successful redemption allows the abbess to aid in the final battle; failure makes her a powerful enemy."
        }
      ]
    },
    {
      "id": "PP007",
      "title": "Echoes Beneath the Waves",
      "description": "Following clues beneath the lighthouse, the party descends into the Drowned Catacombs (DC001). Here, they are assailed by chilling whispers and the oppressive sense of watching eyes. Spectral apparitions force the party to confront their own fears and the tragic history of the tombs. Navigating collapsed passageways and briny pools, they learn these catacombs once safeguarded powerful relics now sought by the Drowned King, and that the final confrontation is at hand.",
      "location": "DC001",
      "nextPoints": [
        "PP008"
      ],
      "status": "not started",
      "plotImpact": "The party learns that the catacombs are haunted by drowned souls, and disturbing the dead risks incurring their wrath. Discovers clues about a relic that could turn the tide against the Drowned King.",
      "sideQuests": [
        {
          "id": "SQ011",
          "title": "Peace for the Restless",
          "description": "Several spirits can be laid to rest by piecing together their fragmented burial rites or returning lost tokens to their sarcophagi. Doing so may grant spectral aid later or lessen supernatural threats.",
          "involvedLocations": [
            "DC001"
          ],
          "status": "not started",
          "plotImpact": "Eases later encounters with ghosts and may grant a guiding blessing."
        },
        {
          "id": "SQ012",
          "title": "The Forgotten Passage",
          "description": "A flooded, hidden corridor can be drained or traversed with ingenuity, granting access to a cache of ancient offerings and context about the catacombs’ original defenders.",
          "involvedLocations": [
            "DC001"
          ],
          "status": "not started",
          "plotImpact": "Provides material rewards and lore to assist in later negotiations or confrontations."
        }
      ]
    },
    {
      "id": "PP008",
      "title": "The Briny Gate",
      "description": "Deep within the Drowned Catacombs (DC001), the party finds a sealed chamber—the Briny Gate—guarded by spectral sentinels and deadly traps. The door is warded by both arcane and mundane locks, requiring negotiation with Eliad, the drowned herald, or unraveling the puzzle of the gate itself. How the party approaches this challenge will alter the supernatural hostility within the catacombs and reveal the Drowned King’s true intentions.",
      "location": "DC001",
      "nextPoints": [
        "PP009"
      ],
      "status": "not started",
      "plotImpact": "How the party deals with Eliad and the gate changes the catacombs’ supernatural hostility and may reveal hidden truths about the Drowned King’s intentions.",
      "sideQuests": [
        {
          "id": "SQ013",
          "title": "Ciphers of the Ancients",
          "description": "Ancient runes scattered throughout the catacombs can be deciphered to reveal the true nature of the Briny Gate and the relic sealed beyond.",
          "involvedLocations": [
            "DC001"
          ],
          "status": "not started",
          "plotImpact": "Solving these ciphers may allow for peaceful negotiation or easier passage past magical wards."
        }
      ]
    },
    {
      "id": "PP009",
      "title": "Relic of the Drowned King",
      "description": "Beyond the Briny Gate lies the flooded heart of the catacombs (DC001), where the Drowned King’s relic is enshrined. Here, the party must contend with the Drowned King’s loyal undead and environmental hazards. The fate of the relic—whether acquired, destroyed, or purified—will determine the strength of the Drowned King and the curse upon Kharos.",
      "location": "DC001",
      "nextPoints": [
        "PP010"
      ],
      "status": "not started",
      "plotImpact": "Acquiring or destroying the relic is pivotal: its fate will determine the strength of the Drowned King and the malevolent curse upon the region.",
      "sideQuests": [
        {
          "id": "SQ014",
          "title": "The Sibilant Pact",
          "description": "A desperate spirit offers the party secret passage or a boon in exchange for vengeance against a traitor interned nearby.",
          "involvedLocations": [
            "DC001"
          ],
          "status": "not started",
          "plotImpact": "Completing the pact may grant an escape route, extra firepower, or increased spectral unrest depending on choices made."
        }
      ]
    },
    {
      "id": "PP010",
      "title": "Drowning in Shadows",
      "description": "In a climactic confrontation in the Drowned Catacombs (DC001), the Drowned King himself emerges to claim the relic and the party’s souls. The outcome depends on the party’s actions: the restless dead may aid or hinder, and the catacombs begin to collapse as ancient wards fail. The party must decide whether to use, destroy, or purify the relic, choosing between escape, sacrifice, or a desperate gamble to seal the Drowned King away forever.",
      "location": "DC001",
      "nextPoints": [
        "PP011"
      ],
      "status": "not started",
      "plotImpact": "The outcome determines the fate of the Drowned Catacombs, the surrounding land, and the party’s standing with mortal and supernatural forces.",
      "sideQuests": [
        {
          "id": "SQ015",
          "title": "The Final Whisper",
          "description": "As the chamber collapses, a remorseful spirit pleads for the party to carry a message to the surface world—offering a cryptic warning or blessing in exchange.",
          "involvedLocations": [
            "DC001"
          ],
          "status": "not started",
          "plotImpact": "Completing this request can provide plot hooks for future adventures or grant magical aid as the party escapes."
        }
      ]
    },
    {
      "id": "PP011",
      "title": "Reckoning in the Beacon’s Wake",
      "description": "With the fate of the relic and the Drowned King decided, the party escapes the collapsing catacombs and emerges into a dawn breaking over a changed Kharos. The unnatural light may fade, blaze anew, or leave the isle in uneasy peace. Survivors and spirits alike watch as the consequences of the party’s choices ripple out, determining whether Marrow’s Rest, the Abbey Ruins, and the Isle of Kharos are saved, cursed, or transformed forever.",
      "location": "MRV001",
      "nextPoints": [],
      "status": "not started",
      "plotImpact": "Resolves the module. The party’s choices determine if the region is saved, doomed, or left in uneasy balance. Sets up lasting repercussions and future adventure hooks.",
      "sideQuests": [
        {
          "id": "SQ016",
          "title": "Free the Bound Spirits",
          "description": "During the aftermath, the party can attempt to release the restless spirits with a ritual, weakening the Drowned King or granting boons, but risking spiritual unrest if performed incorrectly.",
          "involvedLocations": [
            "MRV001"
          ],
          "status": "not started",
          "plotImpact": "Can change the ending (village’s outcome, future threats, or party reputation)."
        },
        {
          "id": "SQ017",
          "title": "Echoes Set Free",
          "description": "If the party completed Eliad’s request to calm the spirits, they can now help the freed souls find peace or use their lingering power to seal (or break) the Drowned King’s prison.",
          "involvedLocations": [
            "MRV001"
          ],
          "status": "not started",
          "plotImpact": "May influence the safety of the village, earn boons, or set up future adventures."
        }
      ]
    }
  ],
  "activeQuests": [],
  "completedQuests": [],
  "failedQuests": [],
  "worldEvents": [],
  "dmNotes": []
}