{
  "moduleName": "Keep_of_Doom",
  "completionDate": "2025-06-21T17:25:19.758585",
  "summary": "### The Chronicle of Shadows Over Harrow's Hollow\n\nIn the annals of the Sablemoor marches, there endures the tale of Norn, steadfast wanderer, and Elen, the scout whose courage outshone even the witchlights of the haunted wood. Their legend began in the anxious heart of Harrow's Hollow, a village beset by whispers of curses and the dread of Shadowfall Keep looming above the Gloamwood. It was Elder Mirna who first entrusted the fate of her people to Norn, pressing into his hand a bronze key etched with the raven sigil--both a plea and a burden that would shape the days to come.\n\nThe village's fears were not unfounded. Disappearances plagued the night, and Elen--their boldest scout--had vanished into the mist. Among fluttering notices and the wary eyes of kin, Norn found only fragments of her trail: a scuffed bootprint, a torn scrap of blue cloth, and the echo of her resolve. Yet even as the villagers' hope flickered, Norn's resolve grew, joined by stories of restless spirits and poltergeists that haunted the inn's cellar and the lonely paths beyond.\n\nThe journey led Norn and companions into the Gloamwood's depths, where ancient stones pulsed with fading wards and shadows prowled, hungry for warmth and memory. In battle with these shades, wounds were taken both seen and unseen, but the party's courage held. At the Withered Shrine, they glimpsed the spirit of a guardian, and at a faerie circle choked by spectral energy, they found the marks of Elen's unfinished ritual--a testament to her desperate hope and the darkness on her heels.\n\nIt was here that Norn's greatest sacrifice came to bear: through pain and blood and the scattering of silvery dust, the Lost Ward Circle was restored, its old magic flaring to life and weakening the keep's spectral grasp. The Keeper Morvath, fey-touched and sorrowful, witnessed this feat and spoke somber truths of the curse that festered within Shadowfall's crumbling walls. Elen, it seemed, had fled before the ritual's completion, her fate uncertain.\n\nArmed with the Keeper's knowledge and Mirna's key, Norn pressed deeper into the forest's haunted heart. Through hidden passages and moonlit courtyards, the company traced Elen's desperate flight, each new chamber echoing with the memory of old betrayals and oaths unkept. In the Ruined Chapel, spectral knights and wraiths rose to challenge them; in the barracks, the remnants of the garrison's last, doomed stand told of a darkness awakened beneath the keep.\n\nThe deeper they delved, the more the keep's sorrow pressed upon them. In the Great Hall, a spectral scribe revealed the truth: the curse was not merely a wound upon the land, but the legacy of Lord Thaddeus Greymont's despair and the treachery that corrupted his noble line. Among shattered relics and coded rosters, the party found the \"knight's heart\" amulet--a symbol of hope and the key to confronting the darkness below.\n\nThe descent into the dungeons marked a crucible of will and spirit. Norn faced shadows that walked like men, the gibbering madness of things best left nameless, and the echo of Elen herself--trapped in a spectral loop of terror. Piecing together cryptic clues and risking exhaustion and curse, they pressed on, consecrating shrines and restoring what little light remained to the stones.\n\nAt last, in the ossuary's gloom, Norn stood before the Bone Speaker and was judged worthy, his understanding of betrayal and redemption unlocking the way to the Relic Chamber. There, amidst runes and spectral chains, the vengeful spirit of Lord Greymont rose in wrath, the shadow relic at his heart pulsing with ancient hate. Elen, half-consumed by shadow, called out--her courage undimmed, her hope pinned to Norn's resolve.\n\nThe final confrontation was a symphony of sacrifice and valor. Norn shattered the relic, braving the shadow's grasp, while Elen's spirit and will shielded him from despair. The curse's power broke at last; darkness fled the stones, and Greymont's spirit was freed to peaceful rest. The keep's halls grew quiet, and Elen, battered but alive, was pulled from the edge of oblivion.\n\nTheir return to Harrow's Hollow was met with jubilation and awe. Norn, ever humble, publicly credited Elen for her heroism; in doing so, he not only restored her name but kindled a new era of hope for the village. Elder Mirna distributed rewards--a coffer of gold, a gleaming deed, and the promise of land--sealing their place as heroes and stewards of the village's future. The villagers embraced Elen, who bloomed from hesitant scout to beloved protector, her confidence and standing forever changed.\n\nIn the glow of the Wyrd Lantern Inn, laughter replaced fear. Norn and Elen shared stories, healing wounds both physical and unseen. Amidst the warmth, a new intimacy blossomed: gentle confessions, a vow to always bring each other home, and a kiss that spoke of hope beyond shadow. Their bond, forged in darkness, became the light by which new legends would be written.\n\nYet not all wounds heal at once. The keep, haunted still by its history, awaited restoration. The echoes of old betrayals lingered at the edge of dreams, and the shadows of the Gloamwood would not easily forget. But for Harrow's Hollow, dawn had at last broken. Norn and Elen, united in purpose and affection, set their sights on distant horizons--the Silver Vein, the haunted ruins of Calamyr--ready to meet whatever new legends the world would demand.\n\nThus closed the tale of Shadows Over Harrow's Hollow: a story of darkness confronted, of bonds forged in trial, and of hope restored where once only fear had dwelt. The echoes of their courage would linger long in the hearts of those they saved, and the road ahead--though still shrouded in mist--would ever be theirs to walk, together.",
  "exportedData": {
    "relationships": {},
    "artifacts": {},
    "hubs": {},
    "worldState": {},
    "unlockedModules": []
  },
  "sequenceNumber": 15
}