{
  "moduleName": "Keep_of_Doom",
  "completionDate": "2025-06-21T17:52:03.723975",
  "summary": "### Shadows Over Harrow's Hollow: The Lifting of the Gloamwood Curse\n\nIn the spring of 1492, when the nights lay long upon the earth and hope was but a frail ember in the hearts of the people, there came to Harrow's Hollow a pair whose deeds would echo through generations. Norn, steadfast as the old stones, and Elen, the village's own scout, would prove themselves against the shadow that had crept from the ancient keep and settled like a shroud over the land.\n\nFrom the first, Harrow's Hollow was a place of wary glances and trembling hands. Elder Mirna, matron of the people, confided in Norn the tales of vanished kin and the dread that clung about the Keep of Doom. The villagers' faith had withered beneath weeks of disappearances and rumors--some swore to curses, others to hungry spirits, but all agreed the old keep's shadow stretched farther than stone or memory. It was Elen's absence, most recently, that had torn the veil of composure from the town; she, the brave scout whose trail had faded into the Gloamwood mists, was both the spark of hope and the axis of fear.\n\nNorn's resolve did not waver. He gathered the whispers of the Wyrd Lantern Inn, the cryptic wisdom of Old Tommen, and clues from the haunted trail: torn blue cloth, broken branches, a scuffed bootprint near ancient standing stones. Each sign led deeper into the Gloamwood, where the very trees leaned close as if to listen, and where shadows--living, hungry--spilled forth to test the mettle of any who dared the path.\n\nIt was at the Withered Shrine that the first great ordeal was met: twig blights burst from the earth, driven by a malice older than the village itself. Battered and blooded, Norn and his companions pressed on, discovering that Elen had attempted a ritual of warding, only to be driven away by horrors she could not name. Through courage and reverence, they completed the rite, and the shrine's guardian spirit, momentarily stirred, bestowed its blessing--a fragile shield against the darkness to come.\n\nThe trail wound onward to the Spectral Clearing, where Elen's footprints faltered and a fey ring awaited restoration. Here, the party undertook the ritual Elen had begun, offering her cloak's clasp and their resolve. The magic, once rekindled, freed the grieving ghost who lingered there, and in return, the forest's weight lessened, if only for a moment. The Keeper, Morvath, was found in his cottage--a figure of ancient knowledge and cautious trust. He tasked the party with restoring the Lost Ward Circle, and in doing so, Norn glimpsed Elen herself, a fleeting shadow among the trees, always beyond reach.\n\nThus fortified, the party pressed toward the keep, passing the battered Ranger Outpost and the mercenaries' empty camp. The Hidden Keep Entrance was found beneath brambles, the way sealed by wards and opened by Mirna's bronze key--a token of trust and the village's last hope. Through the secret ways, Norn and his allies descended into the ruined halls where Elen's desperate trail shone brightest: fresh blood on the stones, warnings scrawled in chalk, the press of shadow at every turn.\n\nWithin the keep, trial followed trial. The ghost of Sir Garran rose in the chapel, his sorrowful oath binding the living and the dead. Norn's hand was steady; he bore the knight's heart amulet, found hidden within the altar, which proved both shield and key. Each spectral foe--shadow, wight, or bone--was met not merely with steel, but with words and deeds that honored memory and sought release for the suffering souls. In these adversities, the bond between Norn and Elen grew: though separated by darkness and time, each act to restore the wards, each fragment of her trail recovered, was a silent promise that neither would be abandoned to the night.\n\nThe keep's depths revealed the true nature of the curse: a relic forged in betrayal, Lord Thaddeus Greymont's soul twisted by grief and hatred. In the Relic Chamber, with Elen chained in shadow and the lord's spirit raging, Norn faced the heart of the darkness. The battle was fierce, but it was not might alone that shattered the relic--it was the fulfillment of broken oaths, the restoration of Garran's honor, and the light of unyielding hope. Elen, freed from the shadow's grasp, emerged battered but alive, her gratitude as fierce as her courage.\n\nTheir return was a triumph not merely of arms, but of spirit. The curse lifted, the woods brightened, and the villagers' fear melted into jubilation. Norn publicly honored Elen's bravery, and the village embraced her as a hero--her quiet strength, once overlooked, now the beacon by which others measured their courage. Elder Mirna bestowed upon them treasures and land, symbols of a new era, and the keep, long a source of dread, was pledged to their care and restoration.\n\nIn the days that followed, laughter and hope returned to the Wyrd Lantern Inn. Tales of mimic chairs and spectral battles became legends whispered by firelight. Norn and Elen's partnership deepened, their quiet vows to one another forged in hardship and sealed in moments of vulnerability and humor. The gifting of the elven cloak, the gentle clasp of hands, the promise to always bring one another home--these were the treasures that would outlast any golden coffer.\n\nYet even as the shadows receded, the world beckoned. Rumors of the Silver Vein River and the haunted ruins of Sablemoor stirred restless dreams. With the curse broken and the keep's future secured, Norn and Elen set their sights beyond Harrow's Hollow, stepping into the mist-laden wilds where new stories awaited. The bonds they had forged--between themselves, with the village, and with the weary spirits of the past--would endure as shield and lodestar against whatever darkness the wider world might yet conceal.\n\nThus ended the tale of Shadows Over Harrow's Hollow: a story of courage and kinship, of wounds healed and hope rekindled, and of heroes who dared the darkness so that others might live in the light. But as is always true, the greatest legends are never truly finished, and the road ahead glimmered with the promise of adventures yet unclaimed.",
  "exportedData": {
    "relationships": {},
    "artifacts": {},
    "hubs": {},
    "worldState": {},
    "unlockedModules": []
  },
  "sequenceNumber": 16
}