{
  "moduleName": "Keep_of_Doom",
  "completionDate": "2025-06-21T14:05:38.027742",
  "summary": "Let it be chronicled in the annals of Harrow's Hollow: in the waning days of the season of storms, when the shadows grew long and the hearts of the people grew wary, there arrived a company of wanderers whose names would be spoken with reverence and wonder for generations hence. Chief among them was Norn, whose quiet resolve belied a spirit unyielding, and at their side, Elen, the village's own lost scout, whose fate was bound by dread and hope to the brooding ruin known as the Keep of Doom.\n\nThe tale began beneath dripping eaves and restless skies, with the anxious summons of Elder Mirna Harrow. Fear gripped the hollow; folk vanished without trace--Elen among them. Whispers of curses and the haunted keep's malevolence drifted through the lamplit haze of the common room, where suspicion and sorrow commingled. Yet it was not terror, but the hunger for truth, that set Norn and their companions upon their path.\n\nThey wove through the tapestry of village life, gathering threads of rumor and fragments of courage. Though the haunted tale of Old Tommen and the poltergeist beneath Cira's inn would remain unprobed for now, it was the Keeper of the forest's edge--hermit, sage, and reluctant oracle--who became both guide and riddle. Keeper Morvath, wary yet watchful, revealed fragments of the keep's ancient curse and the peril that awaited any who dared its shadowed halls. It was Morvath who spoke of the Lost Ward Circle, a ring of ancient magic long since faded, whose restoration could shield the land from spectral doom.\n\nThus the company plunged into the haunted Gloamwood, where the mists clung like memories and the wind carried the lament of the lost. Here, at the faerie circle, Norn knelt in the moonlit hush to weave old words and hope together, restoring the circle's power with patient resolve. The air stirred with a gentler presence, and for the first time in many moons the spirits recoiled from the village's edge, the curse's grip loosened by a lone act of faith.\n\nYet the journey was not without hardship nor doubt. The forest's heart tested all bonds: with each spectral ambush and treacherous glade, Norn and Elen--newly found and still haunted by what she'd fled--grew closer, their silences deepening into understanding. In moments of fatigue, Norn's hand would find Elen's shoulder, a silent promise that neither would walk alone again.\n\nThe Keep of Doom awaited, stark against a bruised sky, its stones heavy with centuries of grief. Entry was neither forced nor blundered but earned--Norn's cunning saw them past the ancient wards and into the lord's forsaken study, where secrets and traps lingered like coiled serpents. The evidence of Elen's earlier passage haunted every corridor: a dropped token, a scrawled plea, the echo of her hurried steps. The party pressed onward, descending through the trapdoor into the keep's cursed dungeons--the threshold between legend and fate.\n\nIn the heart of darkness, beneath earth and memory, the truth of the curse revealed itself. Lord Thaddeus Greymont, once protector, now a vengeful shade--corrupted by grief, bound by dark magic, and unwilling to release his hold upon the living. Here the party faced not only the wrath of a spirit but the lingering wounds of history. It was Elen, trembling yet resolute, who dared to speak the words of peace and memory that Norn had gleaned from Keeper Morvath. The confrontation was less a battle than a reckoning; pain was named, the past acknowledged, and as the final ritual was uttered, Lord Greymont's rage gave way to sorrow, then at last to release.\n\nWhen dawn crowned the hollow, Norn and Elen emerged from Gloamwood's pale mists, changed in ways both visible and unseen. The curse was broken; the keep's shadows receded, and the village gathered in awe as Elder Mirna wept openly for relief and joy. Before all, Norn gave voice to Elen's lost valor, ensuring that her name--and her courage--would be harbored in every heart. The villagers embraced their prodigal scout, and Cira, the innkeeper, pressed gifts and thanks into their hands, tears shining in the new morning's light.\n\nThe rewards bestowed--coffered riches, a deed to land, and the warm embrace of a grateful people--were but tokens compared to the bonds forged in darkness. The Keeper, once aloof, now sought the company of Norn and Elen, hopeful for the hollow's future. There were feasts and songs, and laughter returned to Harrow's Hollow, though the memory of those perilous nights would linger, a shadow sweetened by hope.\n\nYet not all threads were tied. The restless spirits Old Tommen spoke of, the Black Banner mercenaries who skulked near the keep, and the secrets of the Silver Vein beyond the moors--these beckoned with new promise and peril. Norn and Elen, their hearts tempered by trial and trust, stood at the threshold of new legends, the echo of their deeds shaping the dawn.\n\nThus ended the shadow over Harrow's Hollow, but the legend of Norn and Elen endures, a testament to the courage that transforms fear into hope and strangers into kin.",
  "exportedData": {
    "relationships": {},
    "artifacts": {},
    "hubs": {},
    "worldState": {},
    "unlockedModules": []
  },
  "sequenceNumber": 5
}