{
  "moduleName": "Keep_of_Doom",
  "completionDate": "2025-06-16T23:59:08.711179",
  "summary": "In the waning days of a sorrow-stained spring, a shadow lingered over the far hamlet of Harrow's Hollow. The village, once a place of modest cheer, now cowered beneath the weight of vanished kin and whispering dread. Elder Mirna Harrow, stooped by grief and responsibility, summoned the bold to unravel the cause of these disappearances--most grievously, the loss of Scout Elen, whose absence had left the village watchful and raw.\n\nTo the call answered Norn, whose steadfast resolve marked him as both outsider and last hope. The villagers' suspicion was thick as mist; tales of curses and the haunted Keep of Doom stifled trust and reason alike. Yet through patience and small kindnesses, Norn won the wary confidence of Mirna and those few who dared hope for deliverance. It was in the warm-lit inn, among the embers and muttered prayers, that the first slivers of truth emerged: Elen had ventured toward the keep on some secret errand, her trail now lost in the haunted Gloamwood.\n\nThough rumors of wandering spirits and poltergeists flickered on village lips, Norn's focus remained unbroken. He did not heed Old Tommen's tales of the shade nor turn aside to soothe Cira's haunted cellar--tempting as the promise of clues or gratitude might be. Instead, his path bent ever toward the cursed heart of the forest, where the roots of the village's doom ran deep.\n\nBeneath the ancient boughs, the Gloamwood throbbed with spectral unrest. Norn pressed on, guided by fading tracks and the memory of Elen's courage. The forest tested both body and soul: spectral forms rose from the earth, wards throbbed with fading power, and the very air seemed to resist intrusion. At the faerie circle--a place older than the village itself--Norn uncovered the Lost Ward Circle, its protective magics shattered. With quiet determination, he undertook the ancient rites, drawing upon whispered lore and his own well of hope. The ritual's completion sent a pulse of light through the shadowed undergrowth, weakening the keep's baleful grip and granting the village a fragile reprieve.\n\nIt was near the forest's edge that Norn found Keeper Morvath, a solitary hermit whose knowledge of the curse proved invaluable. Morvath demanded proof and purpose before sharing his secrets, and Norn's honesty--his admission of Elen's unfinished work and the peril that still lingered--kindled in the hermit a measure of trust. Morvath's warning was grim: the keep's curse was not a mere haunting, but a festering grievance rooted in betrayal and blood.\n\nSo Norn pressed on, passing the ancient ward and descending at last to the Keep of Doom. Its stones loomed black and broken, its portals sealed with traps and ghostlight. Within, the air grew heavy; shadows twisted in the corners, and the restless dead stirred at the party's intrusion. Norn's courage did not falter. He maneuvered through the keep's cunning defenses, his resolve strengthened by the hope of finding Elen--alive or at rest.\n\nIn the Lord's study, beneath the dust of centuries, a hidden trapdoor yawned open. Norn descended into the Cursed Dungeons, where the source of the village's torment awaited. There, in that lightless heart, he discovered Elen--wan, bloodied, but unbroken. Together, they beheld the specter of Lord Thaddeus Greymont: a once-noble soul, now twisted by vengeance and dark sorcery. The confrontation was as much of spirit as of steel. Norn and Elen, by word and will, unearthed the truth of Thaddeus's pain. They offered him the solace of remembrance and the promise that his story would not fade into the silence that had devoured so many. In the end, it was not violence but empathy that laid the spirit to rest.\n\nThe curse broke with a shudder that echoed through stone and soil. The dead found peace, and the keep's shadow lifted. Norn and Elen emerged from the gloom, passing once more through the Gloamwood--the air now sweet with the promise of renewal. At the village's east gate, their return was met with awe, then jubilation. The people of Harrow's Hollow, who had dwelled so long beneath fear, gathered to celebrate not only the ending of the curse but the courage of those who defied it.\n\nElder Mirna, in a rare moment of unguarded emotion, embraced Elen and Norn both. Before all, Mirna spoke the truth: that Elen's defiance and Norn's resolve had saved them all. The villagers--once so haunted--now found in Elen a symbol of their own strength, and in Norn, a reminder that hope may come from beyond the familiar. A coffer of coins and gems, a deed to land, and a feast beneath the open sky marked the tale's end. Yet the truer rewards were less tangible: the bonds of loyalty forged in darkness, the quiet understanding shared between survivor and savior, the healing of old wounds.\n\nKeeper Morvath's eyes lingered on the horizon, troubled still by mysteries left unresolved, and the Black Banner mercenaries remained a rumor in the wilds--future storms on the edge of peace. Yet as night fell, and laughter returned to Harrow's Hollow, it was clear that the tale had become legend, and that the bravery of one stranger and one scout would echo through the hollow's generations yet to come.",
  "exportedData": {
    "relationships": {},
    "artifacts": {},
    "hubs": {},
    "worldState": {},
    "unlockedModules": []
  },
  "sequenceNumber": 1
}