{
  "moduleName": "Keep_of_Doom",
  "completionDate": "2025-06-21T13:48:48.789893",
  "summary": "### Shadows Over Harrow's Hollow: The Chronicle of the Keep's Unbinding\n\nIn the waning days of a restless autumn, the company led by the steadfast Norn arrived on the muddy lanes of Harrow's Hollow, a village long shadowed by dread. The air hung with unease: doors barred by sundown, children hushed, and every night haunted by the memory of those who vanished. Elder Mirna Harrow, her eyes troubled but voice unbroken, implored Norn and his companions to unravel the mystery of the disappearances--most grievous among them, the loss of Scout Elen, whose absence gnawed at the heart of the hollow.\n\nRumors, like wind among dead leaves, spoke of ancient curses, vengeful spirits, and the malignant silhouette of the Keep of Doom looming in the haunted forest. The party, strangers at first, found themselves drawn into the villagers' whispered fears. In the flickering hearthlight of the inn, plans were forged and alliances tested. Cira the innkeeper, burdened by her own small hauntings, offered what clues she could, while Old Tommen muttered of wandering shades, his warnings ignored in the haste of greater dangers.\n\nYet, it was not fear that defined Norn's company, but resolve. Their early efforts won the trust of Mirna and the townsfolk. Laughter, rare in those days, broke out when Norn, in a rare moment of levity, coaxed a smile from the grim-faced blacksmith. Bonds were kindled in those uncertain hours--of duty, of friendship, and, for some, the first stirrings of something deeper.\n\nGuided by fragmentary trails and the hope that Elen still lived, the company braved the Gloamwood, where shadows clung thick as cobwebs and the trees seemed hunched in silent warning. The air shimmered with unnatural energies, and spectral dangers stalked their every step. Deep within a faerie ring, Norn performed the ancient ritual of the Lost Ward Circle, weaving old magic with newfound determination. The circle's light flared, weakening the curse's grip and granting fleeting respite to the land--a moment that would be remembered as the night when hope first returned to Harrow's Hollow.\n\nIt was in these haunted wilds that the party encountered Keeper Morvath, a hermit of the margins and last steward of the keep's secrets. Morvath's wary counsel proved invaluable, though extracting it required deeds as much as words. Only when Norn recounted the ritual's completion, and the spectral encounter that followed, did the Keeper's mask of suspicion give way to a flicker of hope. Still, the truth of Elen's fate remained elusive; she had fled before the ritual's end, her trail vanishing into the keep's darkness.\n\nThe approach to the Keep of Doom was fraught with peril. The company skirted the camp of Black Banner mercenaries, would-be plunderers whose ambitions might have spelled ruin for the unwary. Yet Norn's company pressed on, their unity forged by purpose and mutual reliance. At the threshold of the keep, traps and ancient wards tested both cunning and courage. It was Elen's trail--faint but persisting--that guided them through the labyrinthine halls and into the keep's shadowed heart.\n\nWithin those crumbling stones, the true source of the village's torment awaited: Lord Thaddeus Greymont's tormented spirit, warped by centuries of bitterness and dark sorcery. The confrontation was not merely one of arms, but of wills and compassion. Elen, found at last, battered but unbroken, stood with Norn in the final hour. Together, they braved the spirit's wrath, not with cold steel alone but with words and gestures of remembrance--granting Greymont the peace long denied him. The curse, thus unraveled, loosed a torrent of spectral energy that threatened to consume all, yet the party's unity and resolve proved their shield.\n\nEmerging from the Gloamwood beneath a dawn suffused with new light, Norn and Elen returned to Harrow's Hollow as the first true heroes the village had seen in a generation. Their journey had not been without cost: both bore scars invisible and lasting, and the memory of their ordeal would forever bind them. Elen, once a solitary scout, found herself embraced by a grateful people, her name spoken with reverence and pride. Norn, ever the stalwart, received honors and gratitude, yet found his greatest reward in the bonds forged and the hearts mended.\n\nThe village celebrated with feast and song, Elder Mirna bestowing upon the pair a coffer of treasure and a deed to land--a gesture not merely of reward, but of trust reborn. Keeper Morvath lingered at the edge of the revels, his outlook less grim and his warnings softened by hope. Though some mysteries--the origins of the spectral curse, the fate of other lost souls, the machinations of the Black Banner mercenaries--remained unresolved, the hollow itself pulsed with new life.\n\nAs the mists of the Gloamwood thinned and the company prepared to journey onward--drawn now toward the silvery whispers of lands unknown--the tale of the Keep's unbinding became legend. In the hearts of Harrow's Hollow, and in the wary gaze of all who dwell beneath the world's shadow, the memory endured: of courage in the face of dread, of friendships tested and renewed, and of a darkness finally overcome--not by might alone, but by hope and the bonds of those who dared to challenge the night.",
  "exportedData": {
    "relationships": {},
    "artifacts": {},
    "hubs": {},
    "worldState": {},
    "unlockedModules": []
  },
  "sequenceNumber": 4
}