{
  "moduleName": "Keep_of_Doom",
  "completionDate": "2025-06-21T16:57:31.329149",
  "summary": "On the eve of Springmonth's second day, in the waning years of the age, a shadow fell upon the hamlet of Harrow's Hollow. It was not the shadow cast by the withered boughs of the Gloamwood, nor merely the pall of vanished kin, but a darkness of spirit, rumor, and curse. Into this anxious dusk strode the outsider Norn--sword-bearer and steadfast soul--summoned by Elder Mirna Harrow's trembling plea, and haunted by the name of a missing scout: Elen.\n\nFrom the first, the Hollow's folk watched Norn with eyes sharpened by hope and dread. Elder Mirna pressed a bronze key into his hand, marked by a raven's sigil and the weight of unspoken secrets. The innkeeper Cira whispered of poltergeists in her cellar, and Old Tommen muttered of a wandering shade, yet it was Elen's trail--her courage, her blue-clad passage through the Witchlight Trail--that drew Norn into the heart of mystery. At the East Gate, the guardians' lanterns barely pierced the mist as Norn gathered what clues he could, each token--a scrap of cloth, a ration's wrapper, a scuffed bootprint--becoming a silent testament to Elen's desperate flight.\n\nThe wilds beyond were no mere backdrop, but a living crucible. The Gloamwood pressed close, ancient stones pulsing with forgotten pacts, and shadows--hungry, cold, and innumerable--tested the party's resolve. Norn's steel and resolve carried him through, though not without wounds, and the witchlights themselves seemed to breathe easier after the battle's end. In the moss-choked Withered Shrine, victory over twig blights and the completion of a forsaken ritual earned the party a spectral blessing: a fleeting courage to face what darkness remained.\n\nYet Elen's path was one of unfinished wards and faltering hope. In the Spectral Clearing, her lost clasp and the traces of her ritual spoke of a flight not merely from monsters, but from despair itself. Norn, with companions both living and spectral, restored the Lost Ward Circle--casting silvery dust and whispered vows into the faerie ring--and in so doing, weakened the forest's curse and earned the trust of Keeper Morvath, the fey-touched hermit whose wisdom bridged the living and the dead.\n\nThrough abandoned outposts and treacherous ruins, Norn pieced together the last days of the keep's defenders: coded rosters, love letters, and the battered horn of the commander. Each relic, each scrap of Elen's blue cloak, bound the party's fate tighter to that of the lost scout--and to the secret heart of Shadowfall Keep itself. The way was barred by spectral guardians, riddles, and desperate echoes, yet Norn pressed on, the knight's heart amulet thrumming with promise and peril.\n\nWithin the keep, the remnants of old tragedies writhed anew. In the Great Hall, a mimic nearly claimed Norn's life, prompting laughter and humility in the retelling, and spectral scribes offered cryptic warnings: not all who offered hospitality could be trusted, and the true curse lay deeper still. Piece by piece, the past was unveiled--Sir Garran Vael's betrayal, the scribe's unleashed shadow, and the relic that bound the lord's soul in anguish.\n\nBeneath the Lord's Study, in dungeons marked by suffering and madness, Norn confronted horrors made flesh: gibbering mouthers, ghouls, and the echo of Elen herself, trapped in a prison of memory and pain. With wisdom and compassion, he unraveled the riddle of the \"knight's heart,\" learning that only by restoring broken oaths and wielding the amulet with true intent could the curse be undone.\n\nIn the Forgotten Ossuary, the Bone Speaker tested Norn's understanding and resolve--three questions for three truths. Only by answering with honor did the party earn passage to the Relic Chamber, where Lord Thaddeus Greymont's shade awaited, torn between vengeance and peace. The final battle was fought not only with blade and spell, but with the courage to face grief and the will to offer mercy: the shadow relic was shattered, Greymont's spirit released, and the spectral chains binding Elen fell away.\n\nTheir return to Harrow's Hollow was a triumph tinged with humility. Norn, battered yet unbowed, publicly credited Elen's heroism, and the village embraced her as their own--a quiet scout transformed by ordeal into a beacon of hope. Elder Mirna's reward--a coffer of gold, a deed to the keep's land, and heartfelt gratitude--cemented the heroes' place in village lore. The villagers' laughter and tears, the children's eager questions, and Cira's warm embrace at the inn knit the company into the fabric of the Hollow's future.\n\nYet it was in the quiet moments--over shared bread, a gentle clasp of hands, and a kiss bestowed in gratitude--that the tale's true heart was revealed. Elen, once haunted by failure and shadows, found new confidence and purpose, her bond with Norn deepened by ordeal and affection. Together, they dreamed not only of restoring the keep, but of seeking new legends beyond the Witchlight Trail.\n\nAs spring's dusk fell and word of distant mysteries trickled in--the Silver Vein River, the haunted ruins of Calamyr, and the marshes of Sablemoor--Norn and Elen looked beyond Harrow's Hollow, their burdens lightened, their spirits entwined. The village stood renewed, its fears dispelled by bravery and compassion, while the keep's curse became legend. Yet not all wounds were visible, and not all stories had ended; the promise of new adventure called, and the road beckoned them onward.\n\nThus closed the tale of the Shadows Over Harrow's Hollow: a chronicle of courage, sacrifice, and the forging of bonds in darkness. The keep's stones bore witness to hope reborn, the villagers' hearts to heroes made from the lost and the loyal, and the world beyond awaited--its mists thick with secrets, its rivers whispering the next chapter of their legend.",
  "exportedData": {
    "relationships": {},
    "artifacts": {},
    "hubs": {},
    "worldState": {},
    "unlockedModules": []
  },
  "sequenceNumber": 12
}