{
  "moduleName": "Keep_of_Doom",
  "completionDate": "2025-06-21T16:11:40.822825",
  "summary": "=== Shadows Over Harrow's Hollow: Chronicle of the Gloamwood Curse ===\n\nIn the annals of Sablemoor, let it be recorded how, in the waning days of the second Springmonth, a pall of dread settled over the village of Harrow's Hollow. Shadows lengthened beneath the ancient boughs of the Gloamwood, and folk spoke in fearful whispers of vanished neighbors, of spectral lights on the Witchlight Trail, and of the haunted ruins looming above--a keep once known as Shadowfall, now a byword for doom.\n\nInto this turmoil strode Norn, a steadfast wanderer, drawn by the pleas of Elder Mirna Harrow and the desperate hope that flickered in the eyes of the villagers. She entrusted Norn with a bronze key, its raven sigil dulled by time, bidding him unravel the mystery of the lost scout Elen--one of their own, whose courage had carried her into the dark and who had not returned.\n\nHarrow's Hollow was a place of brittle courage, forging unlikely bonds in the hour of need. Norn's arrival was met with wary hope, and as dusk gathered, the tales of anxious townsfolk--Cira the innkeeper, Old Tommen, and the militia at the East Gate--wove a tapestry of rumor and dread. Yet it was Elen's trail, marked by torn cloth and desperate footprints, that led Norn beyond the safety of hearthlight and into the haunted wild.\n\nThrough mist and ancient standing stones, Norn pressed into the Gloamwood, where shadows struck with an icy hunger. The first specters were banished by blade and will, but not without cost: the cold of the grave lingered in Norn's bones, and the darkness seemed to whisper of greater evils yet to come. The journey's first victory was one of survival, and with each step, the resolve to find Elen deepened.\n\nAt the Withered Shrine, Norn confronted twisted blights--roots and branches animated by old malice. Only after this test did the shrine's guardian grant a fleeting blessing, and among scattered offerings, tokens of Elen's flight were found. The party pieced together her unfinished ritual, vowing to complete what she could not. Their voices joined in sacred promise, and the witchlight flared, granting a boon of courage against the forest's terrors.\n\nNorthward, the Spectral Clearing awaited: a place of faerie circles and sorrowful ghosts. Elen's trail led through this eldritch glade, her courage flickering but unbroken. Here, Norn and his companions enacted the ritual she had begun, restoring the Lost Ward Circle and weakening the curse's grip on the land. In the act of mending broken wards, Norn glimpsed Elen, always just ahead, her shadow a beacon of hope and desperation.\n\nGuided by the enigmatic Keeper Morvath--ancient warden of the Gloamwood--the company gained knowledge of the keep's curse and the means to breach its shadowed gates. With bone talisman and sacred earth, they pressed to the ward's heart, where deathless guardians rose. The battle was fierce, but resolve and sacrifice prevailed. The circle's restoration brought fleeting peace, and the Keeper's herbal poultices mended wound and spirit alike.\n\nReturning to Harrow's Hollow with hope renewed, Norn was entrusted at last with the bronze key, the villagers' last hope, and Elen's fate entwined with the keep's ancient secret. The passage into Shadowfall Keep demanded both cunning and valor: traps, spectral knights, and the bitter cold of death awaited within. Norn traced Elen's desperate passage through ruined halls, chapels desecrated by shadow, and courtyards strewn with the relics of lost honor.\n\nIn the depths, the truth was laid bare. Elen, battered and hunted by the curse's hunger, had fought to complete the rituals and restore the wards, but was ensnared below by darkness incarnate. Norn navigated gaols haunted by gibbering horrors and spectral echoes--each step fraught with peril, yet lit by the unwavering hope that Elen could yet be saved.\n\nIn the ossuary, Norn faced the Bone Speaker and answered the riddles of betrayal, sacrifice, and the power of memory. The knight's heart amulet--a symbol of broken oaths and enduring love--became the key to the final confrontation. Deep in the Relic Chamber, Norn confronted Lord Thaddeus Greymont's vengeful shade and the crawling shadows that threatened to consume Elen.\n\nThe battle was harrowing: shadows clawed at body and soul, and Elen's life hung by a thread. Through valor, wisdom, and the power of restored oaths, Norn and his companions shattered the shadow relic, dispersing the curse that had festered for generations. Greymont's spirit, at last at peace, blessed the heroes as the curse's weight lifted. Elen, freed from spectral chains and wounds both seen and unseen, wept with gratitude and relief.\n\nTheir return to Harrow's Hollow was a procession of hope. At the East Gate, Norn publicly declared Elen's heroism, and the villagers embraced her as their champion. Elder Mirna honored both Norn's steadfastness and Elen's indomitable spirit, bestowing upon them a coffer of gold, gems, and the deed to the keep itself--a promise that darkness could be banished, and that the haunted halls above would be reclaimed as a place of guardianship and hope.\n\nIn the warmth of the Wyrd Lantern Inn, laughter and tears mingled. Norn and Elen shared both the spoils of their victory and the quiet promise to always bring one another home--an oath sealed with clasped hands and a gentle kiss, witnessed by friends and kin. The villagers' fear gave way to celebration; Cira's hearth became a sanctuary of tales, and Elen donned the cloak of elvenkind, a symbol of her new place in the heart of the community.\n\nYet, as the fires burned low, the horizon beckoned. Stories told by traveling merchants and the lure of the Silver Vein River whispered of new legends to be forged. Elen, emboldened by survival and belonging, chose not to linger in safety. Together with Norn, she set her sights on the misty reaches of Sablemoor and the river's haunted banks, ready to seek what lay beyond the known.\n\nThus ended the shadow over Harrow's Hollow. Through sacrifice, courage, and the forging of bonds that transcended fear, the village was remade--its people forever changed by the light brought forth from darkness. Some wounds would linger, and not all mysteries were laid to rest, but in the hearts of heroes and villagers alike, hope blossomed anew. In their triumph and tenderness, in the memory of kin both lost and found, the legend of Norn and Elen would echo through Sablemoor--and wherever shadows threatened, their names would be a watchword for the dawn.",
  "exportedData": {
    "relationships": {},
    "artifacts": {},
    "hubs": {},
    "worldState": {},
    "unlockedModules": []
  },
  "sequenceNumber": 10
}