{
  "moduleName": "Keep_of_Doom",
  "completionDate": "2025-06-21T14:38:34.963077",
  "summary": "**Chronicle of the Breaking of Shadowfall Keep**\n\nIt was in the trembling dusk of autumn that Norn and his companions first crossed the boundary stones of Harrow's Hollow, a village whose every silence seemed to conceal a tremor of fear. The hollow's thatched roofs lay hunched beneath a pall of rumor and loss: the old folk whispered of curses, the young hid behind shuttered windows, and Elder Mirna Harrow's eyes betrayed the weight of too many nights spent waiting for the vanished to return. Chief among the missing was Elen, a scout whose name lingered on every anxious tongue.\n\nThe party moved quietly among the villagers, earning trust where they could, but the shadows proved stubborn. Old Tommen's stories of a restless shade went unheeded, and Cira the innkeeper's haunted cellar remained a mystery, for the party's focus narrowed on the path that Elen herself had last trodden--toward the forest and the brooding Keep of Doom that loomed at the edge of living memory.\n\nWith the first threads of dawn unraveling the mist, Norn led the way into the Gloamwood, where the trees pressed close and the air thrummed with uncanny power. It was here, in a clearing ringed with the stones of an ancient faerie circle, that the party discovered the remnants of a failed ward: the spectral influence of the keep pulsed hungrily against a boundary grown frail with neglect. Guided by knowledge gleaned from the enigmatic Keeper Morvath--whose riddles hinted at both history and warning--Norn undertook the ritual of restoration. The weave of old magic responded to his resolve, and the circle blazed anew, its light forcing back the spectral haze. In that moment, the party felt the village's doom slacken, if only slightly, and Morvath's wary respect was won.\n\nYet the forest held further peril. The journey to the keep was a gauntlet of shifting shadows and bitter memories, and it was by the light of the newly restored ward that the party evaded the worst of the spectral assaults. At last they stood before the Keep of Doom--its stones cold as regret, its gates warped by the pressure of centuries and the weight of an unquiet soul.\n\nWithin, the party's courage and cunning were tested in equal measure. They bypassed cunning traps and spectral guardians, for the keep itself seemed to resist intrusion, its very walls shifting with malice. It was in the Lord's Study, beneath a trapdoor cunningly concealed, that they finally descended into the heart of darkness--the Cursed Dungeons, where the true source of the blight awaited.\n\nThere, they confronted the vengeful spirit of Lord Thaddeus Greymont, whose torment echoed through every stone. Corrupted by ancient magic, he was neither living nor wholly dead--a tyrant undone by his own grief. Norn, with Elen at his side--her spirit unbroken despite her ordeal--chose not only to challenge the specter but to meet his sorrow with understanding. Through words and the fulfillment of a final, long-denied wish, the party offered Greymont the peace he had been denied. The curse unraveled, its venom lifting from both stone and soul.\n\nTheir return through the Gloamwood was met by the first rays of dawn in many years to touch that haunted land. At the east gate of Harrow's Hollow, the villagers gathered, hope rekindled in their eyes. Elder Mirna wept openly as Elen was embraced by her kin, and before all, Norn gave credit to Elen's heroism--her courage the spark that had guided them all. The hollow, so long bowed beneath dread, now rang with celebration. Cira pressed a coffer of coins and gems into their hands, and a deed to land was bestowed: not merely as reward, but as a sign that the hollow's faith in its protectors had been restored.\n\nSome wounds would not heal overnight. Old Tommen still kept watch for shades at twilight, and the Keeper lingered at the forest's edge, searching for meaning in the aftermath. But the villagers, for the first time in memory, spoke with laughter, and children played beneath banners sewn in Elen's honor.\n\nFor Norn and Elen, the journey had forged a bond of deep trust--hardened in the crucible of shared peril, softened by moments of doubt confessed and hope restored. Their triumph was not merely over a haunted keep, but over the sorrow that had threatened to claim them all.\n\nYet even as the hollow rejoiced, the world beyond beckoned. Word of their deeds spread, and the river mists to the east whispered of new mysteries. The adventure of the Keep of Doom had ended, but its legacy--of courage, sacrifice, and the healing of old wounds--would endure, both in the hearts of those who survived and in the legends yet to be written.",
  "exportedData": {
    "relationships": {},
    "artifacts": {},
    "hubs": {},
    "worldState": {},
    "unlockedModules": []
  },
  "sequenceNumber": 9
}